{
  "Anthony Braxton": [
    {
      "url": "https://anthonybraxton.bandcamp.com/album/solo-willisau",
      "title": "Solo Willisau",
      "artist": "ANTHONY BRAXTON",
      "classification": "paid",
      "tags": [
        "Anthony Braxton",
        "Jazz",
        "Willisau",
        "avant-garde",
        "composition",
        "contemporary",
        "New York"
      ],
      "item_id": 27686161,
      "datePublished": "01 Jan 2007 00:00:00 GMT",
      "about": "Intakt CD 126\n\n\n\nAnthony Braxton’s musical cosmos has no limits, is colorful and moves tumultuously. In the world of jazz, he made his debut with the solo double-LP, For Alto. The first unaccompanied saxophone solo jazz record was a provocation. Anthony Braxton has not stopped breaking through the conventions of jazz and placing his own, original alternatives up again it. Now, after forty years, the master takes stock of his work with his new recording, Solo Willisau (Intakt CD 126). In the large hall, alone on the stage, he enthralled more than 1,500 listeners. “An unheard-of variety of sound,” wrote Rainer Kobbe in the German Jazzzeitung. “His solo on the alto sax was concentrated and never lost itself in quotations. During an intoned march, a looseness briefly swept up that quickly lost itself in a fantastic improvisation on ‘All the Things You Are’.”\n\n\n\n\n\nREVIEW:\n\nRegardless of how grandiose or fantastical Anthony Braxton’s compositional goals, his periodic solo recitals remain sources of reliable solace - dispatches where that fervent and often gloriously impractical imagination boils down to the comforting kernel of a man and his horn(s). Braxton’s recorded work in the format commonly comes in the form of concert dates rather than studio sessions. Following the blueprint of his first double album release on Delmark, alto remains his principal implement in such settings.\n\nThis new Intakt set, recorded at the Willisau Jazz Festival in 2003, follows the prescribed mold in presenting eight pieces, all of relatively uniform duration. Colorful ink squiggles distinguish the graphic schema used to codify the compositions. The program opens with the air and force of a Brötzmann record, Braxton blowing shrill split tones and tonguing in lots of gravely vibrato on “No. 328c”. The amplitude of his articulation is striking, ballooning into the space and sounding exponentially larger than the capacity his horn would normally dictate. He explores permutations of “328a” and “d” later in the program, leavening coarse exhalations with surprisingly delicate curlicues of melody. The former piece contains a passage limited to little more than keypad clicks and circulating breath while the latter alights on simple Aylerian repetition.\n\nSandwiched between the succession of stark numerical compositions sits an eight-minute meditation on “All the Things You Are”. Braxton builds off the mothballed melody, alternating recognizable variations with flurried asides and huffing inhalations of air. The opening minutes of “No. 119m” consist of a comically labored wrestling match with his reed, malformed notes squeaking past his muffled speechifying like those of an orator holding court from the confines of a paper sack. “No. 106p” returns to gently rippling melodic territory with Braxton exploring a suitably serpentine line with a lightly aerated intonation. The pristine recording gives percussive presence to peripheral sounds of his instrument. Even the pursing of saliva-moistened lips is audible. The set winds up as it started with another nod to staccato Brötz-speak through the whinnying flutter tonguing of “No. 191j”.\n\nAs with Intakt’s solo Cecil Taylor release from a few years back, this set distills its subject’s art and intentions down to diamond sharp clarity. Braxton’s available solo sets now number into the double digits, but this one still succeeds in illuminating significant insights into the ever-evolving mind behind them.\n\nDerek Taylor, Bagatellen, November 27, 2007",
      "credits": "released January 1, 2007\n            \n            Anthony Braxton: Alto Saxophone\n\n\n\nAll compositions by Anthony Braxton except «All the Things You Are» by Jerome Kern. Recorded live at Jazzfestival Willisau, September 1, 2003 by Martin Pearson for Radio DRS 2. Radio Producer: Peter Bürli · Cover art: Niklaus Troxler. Graphic design: Jonas Schoder · Produced and published by Intakt Records. Executive production: Patrik Landolt",
      "license": "all rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a3761779498_0",
      "trackinfo": [
        {
          "title": "NO. 328 c",
          "duration": "09:10",
          "lyrics": null
        },
        {
          "title": "NO. 344 b",
          "duration": "11:48",
          "lyrics": null
        },
        {
          "title": "NO. 328 a",
          "duration": "08:53",
          "lyrics": null
        },
        {
          "title": "All the Things You Are",
          "duration": "08:23",
          "lyrics": null
        },
        {
          "title": "NO. 119 m",
          "duration": "08:17",
          "lyrics": null
        },
        {
          "title": "NO. 106 p",
          "duration": "10:43",
          "lyrics": null
        },
        {
          "title": "NO. 328 d",
          "duration": "08:45",
          "lyrics": null
        },
        {
          "title": "NO. 191 j",
          "duration": "08:32",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://anthonybraxton.bandcamp.com/album/duo-palindrome-2002-vol-1",
      "title": "Duo Palindrome 2002, Vol. 1",
      "artist": "ANDREW CYRILLE - ANTHONY BRAXTON",
      "classification": "paid",
      "tags": [
        "Andrew Cyrille",
        "Anthony Braxton",
        "Jazz",
        "black music",
        "improvisation",
        "New York"
      ],
      "item_id": 79512442,
      "datePublished": "01 Jan 2004 00:00:00 GMT",
      "about": "Intakt CD 088\n\n\n\nFor many years, both greats of modern jazz - the saxophone player Anthony Braxton and the drummer Andrew Cyrille - have been pursuing their own musical developments. In the autumn of 2002 their wish to make a joint CD recording was fulfilled.\n\n\n\nWhat came of the meeting are fifteen internal dialogues: new compositions, spontaneous improvisations, as well as interpretations of well-known pieces from Cyrille and Braxton. Both CDs are an artistic manifesto of two jazz innovators, a document of African-American music, borne of mutual respect, equality and esteem.\n\n\n\nThe legendary duo of saxophone and percussion, which Anthony Braxton began with Max Roach, finds a fascinating continuation in the duo Anthony Braxton-Andrew Cyrille.",
      "credits": "released January 1, 2004\n            \n            Anthony Braxton: Saxophones\n\nAndrew Cyrille: Drums\n\n\n\nCompositions by Andrew Cyrille (Major-A-Music, ASCAP) and Anthony Braxton (Synthesis Music, BMI). Recorded at Wesleyan University, October 26, 2002 by Jon Rosenberg. Mixed and mastered by Jon Rosenberg, Andrew Cyrille and Anthony Braxton, December 28, 2002.\n\nProduced by Intakt Records. Published and copyright by Intakt Records (except The Loop and Composition No. 310). Liner Notes: Ted Panken. Photos: Francesca Pfeffer, Dominik Huber. Executive production: Patrik Landolt",
      "license": "all rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a2179170368_0",
      "trackinfo": [
        {
          "title": "Duo Palindrome 2002",
          "duration": "04:34",
          "lyrics": null
        },
        {
          "title": "The Loop",
          "duration": "05:39",
          "lyrics": null
        },
        {
          "title": "Interlacing",
          "duration": "04:35",
          "lyrics": null
        },
        {
          "title": "Celestial Gravity",
          "duration": "02:48",
          "lyrics": null
        },
        {
          "title": "Quickened Spirits",
          "duration": "04:50",
          "lyrics": null
        },
        {
          "title": "Effluence",
          "duration": "04:24",
          "lyrics": null
        },
        {
          "title": "Composition No. 310",
          "duration": "11:46",
          "lyrics": null
        },
        {
          "title": "Ascendancy",
          "duration": "11:36",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://anthonybraxton.bandcamp.com/album/duo-palindrome-2002-vol-2",
      "title": "Duo Palindrome 2002, Vol. 2",
      "artist": "ANTHONY BRAXTON - ANDREW CYRILLE",
      "classification": "paid",
      "tags": [
        "Jazz",
        "New York"
      ],
      "item_id": 2544011640,
      "datePublished": "01 Jan 2004 00:00:00 GMT",
      "about": "Intakt CD 089\n\n\n\nFor many years, both greats of modern jazz - the saxophone player Anthony Braxton and the drummer Andrew Cyrille - have been pursuing their own musical developments. In the autumn of 2002 their wish to make a joint CD recording was fulfilled.\n\n\n\nWhat came of the meeting are fifteen internal dialogues: new compositions, spontaneous improvisations, as well as interpretations of well-known pieces from Cyrille and Braxton. Both CDs are an artistic manifesto of two jazz innovators, a document of African-American music, borne of mutual respect, equality and esteem.\n\n\n\nThe legendary duo of saxophone and percussion, which Anthony Braxton began with Max Roach, finds a fascinating continuation in the duo Anthony Braxton-Andrew Cyrille.",
      "credits": "released January 1, 2004\n            \n            Anthony Braxton: Saxophones\n\nAndrew Cyrille: Drums\n\n\n\nCompositions by Andrew Cyrille (Major-A-Music, ASCAP) and Anthony Braxton (Synthesis Music, BMI). Recorded at Wesleyan University, October 26, 2002 by Jon Rosenberg. Mixed and mastered by Jon Rosenberg, Andrew Cyrille and Anthony Braxton, December 28, 2002\n\nProduced by Intakt Records. Published and copyright by Intakt Records (except Water, Water, Water, Exerpt from the Navigator, Composition No 311, Dr. Licks). Liner Notes: Ted Panken. Photos: Francesca Pfeffer. Executive Production: Patrik Landolt",
      "license": "all rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a3716005855_0",
      "trackinfo": [
        {
          "title": "Water, Water, Water",
          "duration": "05:31",
          "lyrics": null
        },
        {
          "title": "Dreams Alive ... Concretize",
          "duration": "04:26",
          "lyrics": null
        },
        {
          "title": "Excerpt from the Navigator",
          "duration": "04:59",
          "lyrics": null
        },
        {
          "title": "Sound Relations",
          "duration": "09:17",
          "lyrics": null
        },
        {
          "title": "Composition No. 311",
          "duration": "10:19",
          "lyrics": null
        },
        {
          "title": "Dr. Licks",
          "duration": "07:33",
          "lyrics": null
        },
        {
          "title": "A Musical Sense of Life",
          "duration": "06:49",
          "lyrics": null
        }
      ]
    }
  ]
}