{
  "Arrington de Dionyso": [
    {
      "url": "https://arrington.bandcamp.com/album/tuvan-shamanism-anxiety-killer",
      "title": "Tuvan Shamanism Anxiety Killer",
      "artist": "Chingiz Kam",
      "classification": "paid",
      "tags": [
        "Ethnographic",
        "Experimental",
        "Shamanic",
        "Trance-punk",
        "Tuvan Throat Singing",
        "bass clarinet",
        "free jazz",
        "shamanic",
        "shamanic drum",
        "shamanism",
        "siberian punk",
        "throatsinging",
        "trance",
        "Olympia"
      ],
      "item_id": 408947280,
      "datePublished": "31 Mar 2025 00:00:00 GMT",
      "about": "Chingiz Kam is the hereditary Brown Bear Shaman of the Tuva Republic. This recording was made during the Spring Equinox of 2025 in Olympia, Washington. We made several attempts to make this recording using digital equipment, but the spirits were absolutely not going to allow it. Instead they were much happier when we brought out the Marantz cassette recorder to make a tape recording of Chingiz's ceremony. This recording is very useful in removing anxiety, it's recommended to turn it up as loudly as you can bear it. \n\n\n\n In Chingiz’s own words – “I was born on the banks of the mighty Siberian river Yenisei and raised in the city of Kyzyl, Republic of Tuva. I have the title of Brown Bear Shaman. I come from shamanic ancestry, both on my father’s side and on my mother’s side. Ancestors come from Tes-Khemsky and Ovyursky districts, the Republic of Tuva, which is located on the border with Mongolia.\n\n\n\nChildhood and youth were mostly spent at the shepherd’s camp of my grandparents. They have kept their culture of nomadic life up to the present. Every vacation I came to them and helped them with the housework. During this time, my special connection and love for nature and animals was formed. Just like all Tuvans always, I pastured sheep and goats, sang songs in the steppes and in the mountains. I recognized life around me through the prism of Tuvan traditions. During this period, I met many spirits of the mountains, taiga, and rivers of my native places. They sometimes appeared in the form of deer, bear, wolf, snowy owl, eagle and other animals, and sometimes as strong strange short winds.\n\n\n\nAll my life I clearly felt that someone was watching me closely. They were invisible defenders. When I was very ill, my ancestors came in dreams in the guise of various familiar people and fumigated with the help of artysh (juniper), after which I quickly began to recover. I have never been able to get lost in a dense forest or in an unfamiliar area. I felt many strange inexplicable things very accurately and my correct decisions were formed from this. Some people felt that I was a shaman and asked me to make charms and amulets. \n\n\n\nAncestral shamans also gave life lessons and the necessary knowledge for shamanic practice to one degree or another. They began to actively “work” at the time when I was about 27 years old. At that time, I had already graduated from the university and worked in my specialty. Any technology stopped working next to me, because of this there were problems at work. Reality seemed to become unreal and I experienced health problems, but the results of all tests showed that I was healthy. This went on for a couple of years, until the ancestors of the shamans “in their own ways” found me a mentor – a practicing Tuvan shaman, who is also a member of the “Adyg Eeren” society. I was initiated by three strongest shamans of the Adyg Eeren society, one of whom was the Supreme Shaman of Tuva. So I started my practice in a shamanic clinic in Kyzyl.\"",
      "credits": "released March 31, 2025\n            \n            recorded and mixed by Arrington de Dionyso, shamanic performance by Chingiz Kam.",
      "license": "some rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a3389456433_0",
      "trackinfo": [
        {
          "title": "Part One",
          "duration": "19:56",
          "lyrics": null
        },
        {
          "title": "Part Two",
          "duration": "14:42",
          "lyrics": null
        },
        {
          "title": "Part Three",
          "duration": "11:08",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://arrington.bandcamp.com/album/unheard-indonesia-vol-17-reak-juarta-putra-with-arrington-de-dionyso",
      "title": "Unheard Indonesia vol. 17 REAK Juarta Putra with Arrington de Dionyso",
      "artist": "Juarta Putra with Arrington de Dionyso",
      "classification": "nyp",
      "tags": [
        "Ethnographic",
        "Experimental",
        "Indonesia",
        "Trance-punk",
        "bass clarinet",
        "ethnic music",
        "free jazz",
        "jathilan",
        "javanese",
        "reak",
        "shamanic",
        "shamanic music",
        "sundanese music",
        "throatsinging",
        "trance music",
        "Olympia"
      ],
      "item_id": 2680443575,
      "datePublished": "01 Nov 2024 00:00:00 GMT",
      "about": "I'm so excited to be able to share this music with the wider world, one of the most life affirming international collaborations I've been involved with in recent memory. \n\n\n\nJUARTA PUTRA is a group performing the traditional REAK music and dance of West Java, Indonesia. They're based in Jatinangor, just east of Bandung. Track one was recorded in Jakarta at Kios Ojo Keos during our rehearsal preparing for the performance that took place at Synchronize Festival at the Jakarta Expo Center on October 4th 2024. The rest were recorded at their Sanggar (community center) in Jatinangor on October 18th, edited from a session about two and a half hours in total duration. \n\n\n\nWhat is REAK? Reak is a very popular style of West Javanese trance music, related to the Jathilan or \"Kuda Lumping\" horse trance dances found in other regions of Java, but with a very distinct Sundanese flair. You don't usually encounter any gongs in Reak, rather the large bedug bass drum is the central instrument surrounded by a multitude of other drums of varying sizes called dogdog beating out a multivalent hypnotic train of throbbing polyrhythms that will speed up or slow down at crucial moments during the ceremony. The drums are accompanied by the piercing snake charmer's wail of the double-reeded tarompet, almost always driven through a primitive amplifier cone powered by a car battery. In these recordings Juarta Putra is also joined by American avant-garde artist Arrington de Dionyso on the bass clarinet!\n\n\n\nReak ceremonies also include a dancing Barong- kind of like a Lion meets Dragon hybrid creature that guards temples and other holy places, in Reak the Barong is at turns frightfully hideous and hilariously comical, with his dance full of acrobatic antics that might include incredible somersaults and leaps into the air, followed by asking members of the audience to throw some money down his throat. \n\n\n\nReak defies dualistic divisions of what is sacred or profane, it is both an incredibly sacred healing ceremony and ludicrously confrontational performance art that is enjoyed by the entire community. \n\n\n\nIt is normal for the dancers and sometimes even audience members to go into trance, becoming possessed by the spirits of ancestors or local nature spirits. There are different \"levels\" of trance possession according to the type of healing one might need, and the experience level of the participants. The Malim is a shaman-like figure who stands guard during the ceremony monitoring the dancers as they become trance-possessed, he is able to determine the types of spirits that manifest themselves during the ceremony and acts to make sure that the ritual maintains a safe container for the spirits to dance without causing harm. \n\n\n\nIf you would like to see footage of Reak rituals there are thousands of great videos of Reak Sunda on YouTube. Here is a documentary I produced with a different group, Sanca Birawa, in 2015:  www.youtube.com/watch?app=desktop&v=BGb6LJsCf4A\n\n\n\n There is also another recording of Juarta Putra recorded by Luigi Monteanni that is available as an LP from Discrepant Records via bandcamp:  luigimonteanni.bandcamp.com/album/the-sacred-entertainment-r-ak-ceremonial-horse-trance-music-from-priangan\n\n\n\n also \n\nRead more at The Attic: \n\ntheatticmag.com/reports/2277/investigating-the-sundanese-ritual-of-kasenian-r%C3%A9ak.html",
      "credits": "released November 1, 2024",
      "license": "some rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a0094424469_0",
      "trackinfo": [
        {
          "title": "REAK at Kios Ojo Keos October 3 2024",
          "duration": "16:35",
          "lyrics": null
        },
        {
          "title": "Jatinangor Session part 1",
          "duration": "14:36",
          "lyrics": null
        },
        {
          "title": "Jatinangor Session part 2",
          "duration": "19:36",
          "lyrics": null
        },
        {
          "title": "Jatinangor Session part 3",
          "duration": "19:31",
          "lyrics": null
        },
        {
          "title": "Jatinangor Session part 4",
          "duration": "07:24",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://arrington.bandcamp.com/album/sacred-mushroom-songs",
      "title": "Sacred Mushroom Songs",
      "artist": "Arrington de Dionyso",
      "classification": "paid",
      "tags": [
        "Experimental",
        "Trance-punk",
        "bass clarinet",
        "free jazz",
        "mushroom",
        "mushroom music",
        "psilocybin",
        "shamanic",
        "shamanic music",
        "throatsinging",
        "Olympia"
      ],
      "item_id": 3153568712,
      "datePublished": "03 Nov 2023 01:49:38 GMT",
      "about": "SACRED MUSHROOM SONGS by Arrington de Dionyso",
      "credits": "released November 3, 2023",
      "license": "some rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a3082124621_0",
      "trackinfo": [
        {
          "title": "Exorcist Blues",
          "duration": "03:02",
          "lyrics": null
        },
        {
          "title": "Purge All Pathways Swirling Form",
          "duration": "02:47",
          "lyrics": null
        },
        {
          "title": "Death to All Dictators Worldwide",
          "duration": "03:46",
          "lyrics": null
        },
        {
          "title": "Spellcaster Blues",
          "duration": "02:05",
          "lyrics": null
        },
        {
          "title": "The Lungs Are the Amazon Rainforest of the Body",
          "duration": "02:45",
          "lyrics": null
        },
        {
          "title": "Teotl is the Totality",
          "duration": "02:42",
          "lyrics": null
        },
        {
          "title": "The Urgent Message of Nonduality",
          "duration": "05:06",
          "lyrics": null
        },
        {
          "title": "Conjuring the Spinal Cord of the Cosmic Serpent",
          "duration": "04:54",
          "lyrics": null
        },
        {
          "title": "The Black Song of Cacallicoatl",
          "duration": "02:44",
          "lyrics": null
        },
        {
          "title": "Bass Blood Jaranan Doom",
          "duration": "05:00",
          "lyrics": null
        },
        {
          "title": "Cave Song Supreme",
          "duration": "12:58",
          "lyrics": null
        },
        {
          "title": "The Sun Is My Blood",
          "duration": "05:52",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://arrington.bandcamp.com/album/medicine-blues-tapes",
      "title": "Medicine Blues Tapes",
      "artist": "Arrington de Dionyso",
      "classification": "paid",
      "tags": [
        "Experimental",
        "Shamanic",
        "Trance-punk",
        "bass clarinet",
        "field recording",
        "free improvisation",
        "free jazz",
        "shamanic",
        "shamanic music",
        "shamanism",
        "throatsinging",
        "yoik",
        "Olympia"
      ],
      "item_id": 1773051449,
      "datePublished": "26 Feb 2025 00:00:00 GMT",
      "about": "At this crucially strange juncture of human history, Arrington de Dionyso releases what is perhaps his most radical statement yet in MEDICINE BLUES TAPES, nearly two hours of Medicine Songs, Algysh chants, Shamanic Blues, Shouts and Hollers. Ethnopoetically inspired and spiritually FIRED UP to a Shaking Fever- these are songs for confronting all demons, corruption and oppression, for extracting all poisons and restoring right relations between Planet Earth and the ever outward expanding Omniverse. Using CASSETTE TAPE as a medium for transmitting a magnetized message, I hope these songs set you on fire, shake you to your core, and change your life forever. DEATH TO ALL DICTATORS. \n\n\n\n\n\nNOTE: The \"merch item\" that accompanies the Medicine Blues Tapes digital download is a completely UNIQUE session of all-analog Medicine Songs recorded directly to magnetic tape and \"made to order\". This is an experiment in developing new strategies of resistance, artistic integrity and survival for a living musician in this fucking insane age where every single resource and collective wealth is being robbed from us blindly seemingly without recourse. \n\n\n\nThese songs are MEDICINE and these tapes will be tailored to your unique needs as an act of Psychomagic. You do not need to listen to the entire tape at once, but it will aid you in whatever spiritual work you do for personal or collective healing, and for the energetic protection of yourself and those you care about most deeply. AUTHENTIC Intelligence versus \"Artificial Intelligence\"!\n\n\n\nYou will receive THE ACTUAL recording itself, not a copy. I will not keep a personal copy for myself, if you order this item you will have the sole unique copy of 90 minutes of Medicine Songs made for you- how you choose to share with others is up to you. \n\n\n\nThe cover packaging will also include a small hand-made painting created uniquely for you. Please allow at least two weeks for delivery.",
      "credits": "released February 26, 2025\n            \n            Recorded direct to a modified Marantz cassette recorder between February 19-22 2025",
      "license": "some rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a2639176861_0",
      "trackinfo": [
        {
          "title": "Invocation",
          "duration": "03:17",
          "lyrics": null
        },
        {
          "title": "Holler and Moan",
          "duration": "03:30",
          "lyrics": null
        },
        {
          "title": "Hay Hee How",
          "duration": "04:38",
          "lyrics": null
        },
        {
          "title": "The Roots Go Incredibly Deep Underground",
          "duration": "03:54",
          "lyrics": null
        },
        {
          "title": "Shaking Medicine Blues",
          "duration": "03:09",
          "lyrics": null
        },
        {
          "title": "The Mask Is Also A Drum",
          "duration": "01:50",
          "lyrics": null
        },
        {
          "title": "The Black Hills",
          "duration": "04:38",
          "lyrics": null
        },
        {
          "title": "Wild Spirits part one",
          "duration": "00:48",
          "lyrics": null
        },
        {
          "title": "A Forcefield of Protection",
          "duration": "02:16",
          "lyrics": null
        },
        {
          "title": "Wild Spirits part two",
          "duration": "00:27",
          "lyrics": null
        },
        {
          "title": "Spinal Cord of the Rainbow Serpent Blues Again",
          "duration": "05:12",
          "lyrics": null
        },
        {
          "title": "A Song For My Enemies",
          "duration": "00:56",
          "lyrics": null
        },
        {
          "title": "The Howl",
          "duration": "03:34",
          "lyrics": null
        },
        {
          "title": "The Tiger, advanced studies in Ethnopoetics",
          "duration": "03:04",
          "lyrics": null
        },
        {
          "title": "Sucking Out The Venom",
          "duration": "01:47",
          "lyrics": null
        },
        {
          "title": "Curing Song",
          "duration": "01:31",
          "lyrics": null
        },
        {
          "title": "Fractal Emanations Inside the Skull",
          "duration": "02:09",
          "lyrics": null
        },
        {
          "title": "Algysh",
          "duration": "03:48",
          "lyrics": null
        },
        {
          "title": "Turn Up the Lightning, Conductor",
          "duration": "01:58",
          "lyrics": null
        },
        {
          "title": "The Bass Clarinet is Not A Musical Instrument, It Is a Religion",
          "duration": "03:27",
          "lyrics": null
        },
        {
          "title": "The Lalove of Central Sulawesi",
          "duration": "04:34",
          "lyrics": null
        },
        {
          "title": "Chetker",
          "duration": "03:08",
          "lyrics": null
        },
        {
          "title": "Chetker Going Down Deep",
          "duration": "03:00",
          "lyrics": null
        },
        {
          "title": "Each Key on the Piano Transmits Synaptic Information",
          "duration": "03:07",
          "lyrics": null
        },
        {
          "title": "Dreaming Song",
          "duration": "02:22",
          "lyrics": null
        },
        {
          "title": "Exorcism Blues",
          "duration": "01:56",
          "lyrics": null
        },
        {
          "title": "BONUS TRACK: Drinking With the Dragon",
          "duration": "05:43",
          "lyrics": null
        },
        {
          "title": "BONUS TRACK: Smoking Song",
          "duration": "02:26",
          "lyrics": null
        },
        {
          "title": "BONUS TRACK: Singing Into the Snare",
          "duration": "01:51",
          "lyrics": null
        },
        {
          "title": "BONUS TRACK: All The Parts Connect",
          "duration": "02:15",
          "lyrics": null
        },
        {
          "title": "BONUS TRACK: The Paint By Numbers Placenta of the First Human Being",
          "duration": "02:13",
          "lyrics": null
        },
        {
          "title": "BONUS TRACK: The Poet",
          "duration": "03:12",
          "lyrics": null
        },
        {
          "title": "BONUS TRACK: Migrations of 40,000 Years Ago Blues",
          "duration": "01:29",
          "lyrics": null
        },
        {
          "title": "BONUS TRACK: What We Learn From Birdsong Blues",
          "duration": "07:40",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://arrington.bandcamp.com/album/malaikat-dan-singa-klp215",
      "title": "Malaikat dan Singa (KLP215)",
      "artist": "Arrington de Dionyso",
      "classification": "paid",
      "tags": [
        "Experimental",
        "Trance-punk",
        "bass clarinet",
        "free jazz",
        "shamanic",
        "throatsinging",
        "Olympia"
      ],
      "item_id": 566933123,
      "datePublished": "01 Jan 2009 00:00:00 GMT",
      "about": "Malaikat Dan Singa [KLP215] is a collection of throbbing, hallucinogenic, trance-inducing trans-utopian cosmic post-punk sounds from Old Time Relijun’s Arrington de Dionyso. It was recorded at the Dub Narcotic Studio in Olympia, Washington, by Karl Blau. Never one to compromise in pursuit of his twisted visions of the future of music, de Dionyso not only rattles listeners with heavy grooves but he also sings every song on this album in Indonesian. What? Arrington tells us that some of the lyrics are lifted from the poems of William Blake and passages from The Zohar. \n\n\n\nMusically speaking, despite the Indonesian influence, de Dionyso doesn’t survey continents in search of exotic sounds. Instead he drills holes through them with a contemporary urgency. Malaikat Dan Singa is an album of translated and personal mysticism that sounds like it was dug up from the Earth. Left here from a future time, unknown to us in the present. \n\n\n\nVast tracts of the uncharitable cavernous underground is exposed in this imagined musical Pangaea by using microtones, polyrhythms, throat singing, echoplex, bass clarinet and reverb in addition to drums, guitar and bass (three of the songs on this album include the Old Time Relijun line-up). Although there is a familiar and foreign rhythm with its mixture of post-punk and Gamelan tendencies, Malaikat Dan Singa is really Future World Music. Maybe it will be used to sell transportive vehicles in 2369. Or a DNA replacement cream. And you can dance to it. \n\n\n\nSome artists push the envelope, de Dionyso eats the envelope and spits out an origami of sound. And he says he recorded this album to impress a girl. It was followed up by another excursion into Indonesian dance raga by Arrington de Dionyso's Malaikat dan Singa, Suara Naga [KLP226].\n\n\n\n“Arrington de Dionyso’s … ravishingly alien sound [is] deep, guttural, trance-inducing and overpoweringly physical.” - Plan B Magazine \n\n\n\n\"This is a great record--who else is going to be crazy enough to do an entire American release sung in Indonesian? It's as if Arrington stole Tom Waits' old band, dragged them to 1974 Bandung, slipped them some mescaline, made them listen to BROERY at maximum volume until they begged him to stop the cassette and then took them to record the whole thing in a cloud of burning smoke on the lip of Krakatoa.\" - Alan Bishop, Sublime Frequencies/Sun City Girls",
      "credits": "released January 1, 2009",
      "license": "some rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a2870460290_0",
      "trackinfo": [
        {
          "title": "Kedalaman Air",
          "duration": "03:52",
          "lyrics": null
        },
        {
          "title": "Mani Malaikat",
          "duration": "06:32",
          "lyrics": null
        },
        {
          "title": "Mani Malaikat Window",
          "duration": "02:19",
          "lyrics": null
        },
        {
          "title": "Nama Bersembunyi",
          "duration": "02:45",
          "lyrics": null
        },
        {
          "title": "Mahkota Kotor",
          "duration": "02:05",
          "lyrics": null
        },
        {
          "title": "Mahkota Kotor Window",
          "duration": "04:51",
          "lyrics": null
        },
        {
          "title": "Rasa Sentuh",
          "duration": "02:21",
          "lyrics": null
        },
        {
          "title": "Ruang Dan Waktu",
          "duration": "02:26",
          "lyrics": null
        },
        {
          "title": "Tak Terbatas",
          "duration": "05:43",
          "lyrics": null
        },
        {
          "title": "Cahaya Bahaya",
          "duration": "03:24",
          "lyrics": null
        },
        {
          "title": "Nafsu",
          "duration": "12:56",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://arrington.bandcamp.com/album/exorcism-in-america",
      "title": "Exorcism in America",
      "artist": "Arrington de Dionyso and Ben Bennett",
      "classification": "paid",
      "tags": [
        "Experimental",
        "Portland OR",
        "Shamanic",
        "Trance-punk",
        "bass clarinet",
        "cosmic drama",
        "exorcism",
        "free jazz",
        "ritual",
        "shamanic",
        "shamanic drum",
        "throatsinging",
        "Olympia"
      ],
      "item_id": 229229164,
      "datePublished": "04 Dec 2020 00:00:00 GMT",
      "about": "This album was recorded on the historic day of November 7th 2020, when the world awoke to the confirmation that Donald J Trump had indeed met defeat in the 2020 US Presidential Election. As the nation erupted in emotional celebration, Ben Bennett and Arrington de Dionyso gathered their forces together to create this sonic ritual, an exorcism for the soul of a land plagued with a deep and painful history of violence and oppression. \n\nWe offer these sounds as a cleansing smoke.",
      "credits": "released December 4, 2020\n            \n            Arrington de Dionyso plays voice, Bromiophone, and Lalove (flute of Palu, Central Sulawesi) on track 1, and bass clarinet on track 2. \n\nBen Bennett plays a unique array of floor percussion including frame drums, gongs, and assorted objects. \n\n\n\nRecorded November 7th-8th 2020 in Portland, Oregon.",
      "license": "some rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a1597115252_0",
      "trackinfo": [
        {
          "title": "Calling All Spirits of Earth and Sky",
          "duration": "20:45",
          "lyrics": null
        },
        {
          "title": "We Will Never Return to What Was Before",
          "duration": "19:01",
          "lyrics": null
        },
        {
          "title": "Bonus Track 1",
          "duration": "05:03",
          "lyrics": null
        },
        {
          "title": "Bonus Track 2",
          "duration": "09:02",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://arrington.bandcamp.com/album/open-the-crown",
      "title": "Open the Crown",
      "artist": "Arrington de Dionyso&#39;s Malaikat dan Singa",
      "classification": "paid",
      "tags": [
        "Experimental",
        "K Records",
        "Trance-punk",
        "bass clarinet",
        "free jazz",
        "shamanic",
        "throatsinging",
        "Olympia"
      ],
      "item_id": 3928673971,
      "datePublished": "20 Apr 2013 00:00:00 GMT",
      "about": "ALBUM IS AVAILABLE ON VINYL, CD, CASSETTE at www.krecs.com!!!!!\n\nrecorded by Arrington de Dionyso with Malaikat dan Singa at Dub Narcotic OLYMPIA in August/September 2012\n\nmixed with Arrington and Ben Hargett in October 2012 at Dub Narcotic\n\nmastered by Ephriam Nagler in November 2012 at Dub Narcotic",
      "credits": "released April 20, 2013\n            \n            Arrington de Dionyso- voice, bass clarinet, shenai, five string and twelve string guitars, tape echo\n\nNehemiah St. Danger- bass and organ\n\nMarkly Morrison- organ and keyboards\n\nBen Kapp= drums\n\nAngelo Spencer- quarter tone guitar, echoplex\n\n\n\nall compositions c. 2012 Arrington de Dionyso",
      "license": "some rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a2120357199_0",
      "trackinfo": [
        {
          "title": "I Feel the Quickening",
          "duration": "03:39",
          "lyrics": "Voice and vision in collision\nall my senses boundless\nall my senses disorganized\nsaya membulan dari merokok\nI make a moon from smoke\nI carved your initials on the face of the sun\n\nblazing rainbows all around\nmake a saint of the holy sound\nI am thunder, I discover\neternal energy is my own brother\n\nflowing flower\nenergy without end\n\nI feel the quickening in everything that lives\nin this life I see everything that lives\nI feel the quickening through everything that lives\nin this lifetime I see everything that lives\n\nI see completion in every constellation\nI see completion in every variation\n\nI feel the quickening in everything that lives\nin this lifetime I see everything that lives"
        },
        {
          "title": "I Create in the Face of Destruction",
          "duration": "03:13",
          "lyrics": null
        },
        {
          "title": "There Will Be No Survivors",
          "duration": "05:16",
          "lyrics": null
        },
        {
          "title": "Tak Terbatas (versi Iblis)",
          "duration": "08:16",
          "lyrics": null
        },
        {
          "title": "Open The Crown",
          "duration": "05:20",
          "lyrics": "Skull shaking thunder\nthe blood and the milk flowing through me\nswelling up from down the root of me\nto the crown\noh! the sun and the moon of me!\nOpen the crown! Open the crown!\n\nI am the shape shifter shifting under\na crown of ravens! a crown of trees!\nOpen every atom, open all desire!\nCasting trickster vision vast, \nI am a song of psychic fire!\nI teach by example, ten thousand tigers in my temple- \nno cage can hold us!\nI am wilderness unfettered, intuition is my science, \nimagination is my savior!\n\nOpen the crown!\nOpen the crown!\n\nUnlock all the gates, unlock all creation!\nQuicksilver, gold and salt unbound\nIn the darkness of the night, in the brightness of the day- \nThere! In the raven's throat! The coloring will be found!\nOpen the crown!\nOpen the crown!\n\nDo not wait, break the vessels!\nOpen your heart!\nOpen your lips!\nOpen the crown!\n\nOpen the crown, remove the veil, purge all pathways swirling form!\nOpen the spiral fractal howling raining sound!\nAtomic sound!\nTouching sound!\nThunder sound!\nCrystal sound!\nDreaming sound!\nFerocious sound!\nLightning sound!\nEternal sound!\nCreation sound!\nOpen every burial mound!\nOpen the crown!\nOpen the crown!\nOpen the crown!\nOpen the crown!"
        },
        {
          "title": "Jiwa dari Jiwaku (Soul of My Soul)",
          "duration": "03:42",
          "lyrics": null
        },
        {
          "title": "The Akedah (The Moon is Full)",
          "duration": "05:40",
          "lyrics": "The moon is full, up in the sky\nhere on the ground, I walk through night\nsome might say that I am lost\nbut I have no destination\n\nThe moon is full, in surrounding night\nfeet on the ground, I gaze through space\nsome might say that I am lost\nbut I have no destination\n\nI heard the strange instructions!\n\"Gather up your firstborn- take one day's journey to a high place- \nbring a measurement of strongest binding! Prepare the wood, prepare the fire, the lamb will be provided!\"\n\nPrepare the wood?\nPrepare the fire?\nPrepare the wood?\nThe lamb will be provided!\n\nThe moon is full..."
        },
        {
          "title": "Halilintar (versi Jatilan)",
          "duration": "07:00",
          "lyrics": null
        },
        {
          "title": "(BONUS TRACK) I Manipulate the Form'd and the Formless",
          "duration": "03:42",
          "lyrics": "I manipulate the form'd and the formless\nharness the hyper-dimensional plane\ntransgress the fundamental physical constraints\n of realities divided by a liquid membrane\nImpossibility? I don't know it- \nI can catch a meteor, and then I throw it\nback into the flow of multiverse awareness\nall my followers click \"like\" and share this- !\n\nI manipulate the form'd and the formless\nbouncing back in time five hours before this\npowerful beams of light my cosmic chariot\ndark matter wave forms are my constant\nthe physical equivalent to vacuum energy\nthe absolute magnitude of space time infinity\nacceleration- hypothetical- envision the bridge\nto a world invisible- \nfractal emanations from inside my skull- \nI don't know what to call it, I'm just making it up\nI pulled a tarot card and I got the Queen of Cups\n\nI manipulate the form'd and the formless\nmy craziness is a mind gyration\nblazing and brilliant ecstatic awareness\na paradox of unthinkable proportions\nsubverting the verses of the authorized version\nradiation integration of the infernal\nmerging insightful of darkness and light\ninsight merging the left and the right\nUrge and urge and urge eternal now\n\"Rasa sentuh yang paling segera kembali ke kekal\"\n\nI manipulate the form'd and the formless\nthis is the shamanic science of intelligence\nI am the shape shifter shifting under-\nshifting above, below, shifting through- \ninfrared red orange yellow green and blue- \nyeah, I got colors in my mind that you ain't ever heard about\nEnchanting incantations, my voice in a shout\nengaging creation with a rage of elation\nflipping through the channels of deep discovery\nfrom the Ancient of Days- to the post-contemporary\n\nI manipulate the form'd and the formless\nI manipulate the form'd and the formless-"
        }
      ]
    },
    {
      "url": "https://arrington.bandcamp.com/album/suara-naga",
      "title": "Suara Naga",
      "artist": "Arrington de Dionyso&#39;s Malaikat dan Singa",
      "classification": "paid",
      "tags": [
        "Experimental",
        "Gamelan Fusion",
        "Indonesian Death Metal",
        "Trance-punk",
        "bass clarinet",
        "free jazz",
        "indonesian",
        "shamanic",
        "throatsinging",
        "Olympia"
      ],
      "item_id": 786366024,
      "datePublished": "22 Jan 2020 00:00:00 GMT",
      "about": "Originally released as K Records KLP 226 in 2011. \n\n\"Suara Naga\" is Indonesian for \"The Voice of the Dragon\" and this classic album was the second of the \"Malaikat dan Singa\" albums, which lead to helping me make many connections in Indonesia, with many invitations to organize tours and other performances and collaborations with local musicians. \n\n\n\nArrington de Dionyso's 2011 album Suara Naga [KLP226] is a pleasant balm for any creative spirit.\n\n\n\nBy \"pleasant\", I mean incendiary.\n\nBy \"balm\", I mean Cro-Magnon regressive.\n\nBy \"any\", I mean freaks only.\n\nBy creative\", I mean dangerous.\n\nAnd by \"spirit\" I mean the flames of Hell and the flowers of Eden entwined upon the nuptial sofas of pleasure.\n\nBy \"spirit\", I mean wearing grooves in the floor boards of your dirty mind.\n\nBy\"spirit\", I mean that part of you that either heeds the call or gets destroyed.\n\nBy\"spirit\", I mean this force coursing through your corporeal privates.\n\nBy \"spirit\", I mean a mystical draft.\n\nBy \"spirit\", I mean fermented juice.\n\nBy \"spirit\", I mean a sharpened stick rammed through an animal.\n\nBy \"spirit\", I mean you really don't need any more music, this one alone will do.\n\nBy \"spirit\", I mean a catalyst for your art.\n\nBy \"spirit\", I mean, SPIRIT!\n\nNow get out there and play this album at full volume while doing something good.\n\n\n\nThe Facts:\n\n\n\nThis is the second Arrington de Dionyso's Malaikat dan Singa album, the first is entitled simply Malaikat dan Singa [KLP215] and was released in 2009.\n\n\"Malaikat dan Singa\" means \"Angels and Lions\", \"Suara Naga\" means \"The Dragon's Voice\".\n\nAll of the lyrics on both records are in Indonesian, which Arrington taught himself specifically for this project.\n\nThe album was recorded at Dub Narcotic Studio in Olympia, with an all-star cast including members of LAKE and Angelo Spencer et les Hauts Sommets. The record was produced by Karl \"The Genius\" Blau.\n\nYou know how in the 1950s the press and parents and such talked about how rock'n'roll had some evil, sexual, tribal force that was going to possess the youth? Arrington de Dionyso's Malaikat dan Singa is really that. Trance-punk dancehall explosion gonna knock you up! 2011! \n\nPress\n\n\n\n\"With a name like Arrington de Dionyso, you can only expect something extremely exotic, and the man always knows how to dish it up.\" – Tiny Mix Tapes\n\n\n\n\"You could call it chaos, but (Arrington de Dionyso) seems to know exactly what's going on at all times.\" - The Washington Post",
      "credits": "released January 22, 2020\n            \n            Arrington de Dionyso- voice, guitar, bass clarinet, bromiophone, saxophone, other sounds\n\nfeaturing performances by:\n\nAngelo Spencer\n\nAndrew Dorsett\n\nMarkly Morrison\n\nGordon Baker\n\nBen Kapp\n\nStephie Cristol\n\nKarl Blau\n\nbackground vocals on \"Aku di Penjara\" by Sarah and Alex\n\n\n\nRecorded in 2010 at DUB NARCOTIC in Olympia, produced by Karl Blau and Arrington de Dionyso",
      "license": "some rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a1018818725_0",
      "trackinfo": [
        {
          "title": "Kerasukan",
          "duration": "03:21",
          "lyrics": "KERASUKAN (Possessed by Spirits)\t\n\ntabrakan dari visi dan suara\nmengalir itu dari muara\n melebur kiri kanan\n saya pasang surut (flux and flow)\nsaya menghutani dari mulut\nsaya membuaya dari sulur\nkebinalan bianglala batin\nkemuluran dari dewa kelamin\n\nsuaraku tiba di tenggorok\nsaya membulan dari merokok\nmembuat semesta khayalan\npembakaran dari persepsi\nkerasukan rasi\ntenaga tak terbatas\nbuta ke totalitas\nbunga mengalir\nengkau tak terbatas\n\ndari akar aku, saya mengawan\nAku mabuk dari madu dewa\njiwa tulang dan jiwa arwah\nTulang dari tulangku\nkerangka dari kepala\n\nKerakusan aku kerasukan\nTerbuat binatang yang membuat binasa\nmerasakan aku! aku yang mengalir kenikmatan-\nPenciptaan terbuat segala\nnafas kehidupan gelombang\nnafas kehidupan berdebar\nnafas kehidupan manis\nnafas kehidupan bergetar\ngetaran kehidupan manis\nkemanisan kehidupan segala\n\nhal ini maksud sudah diberikan.\n\n\nENGLISHHHHHHHH\n\n(The tree of life turned upside down)\nVoice and Vision in collision\nflowing out of the mouth of the river\n fusing left and right\n  I flux and flow\nI create forests through my mouth\nMake crocodiles from vines\nDisobedience is the inner rainbow-\nstretching out the sex god- \nElongation of the sound- \n\nMy voice comes through the throat\nI make the moon from smoke\nand a universe of imagination\na combustion of perception\nconstellations in possession  \nunlimited power\nblind to the totality\neternal energy\nyou are without limit, eternal energy\n\nFrom the root of me, I climb into the sky\nI was drunk from god-honey\nbone and soul\nBone of my bones\nCrown of the skull of the head\n\nI am possessed with appetite\nMade of animals that destroy\nFeel me! I am pleasure-flowing\nCreation is made complete,\nBy cresting waves of the breath of life,\npounding waves of the breath of life,\nsweet breath of life,\nvibrating breath of life,\nvibration sweet life\nall the sweetness of life\n\nThis intention has been given-\nby white fire on black fire on white fire \nwe chew the meat through darkness of night."
        },
        {
          "title": "Baru Limunan",
          "duration": "03:42",
          "lyrics": null
        },
        {
          "title": "Aku di Penjara",
          "duration": "04:05",
          "lyrics": null
        },
        {
          "title": "Bianglala",
          "duration": "04:55",
          "lyrics": "BIANGLALA (Rainbow of Fire)\n\n berombak gelombang\n  cahaya perubahan perempuan.\nEngkau malaikat?\nTeriak terik pembakaran suaraku\n suaraku tenggorokku\nteriak terik terang teramat\n otot dan urat dan tulang\nteramat terik, terang benderang\nseribu juta miliar pecahan matahari\npercikannya cahaya\npecahannya cahaya\n mengejawantahkan diri sebagai dewa di tulang\ndilahap oleh api bianglala yang membersih sucikan.\naku dikonsumsi oleh api, api api api bianglala\n Di dunia yang fana dari bayang\nkurasakan cinta\nSiapa rasakan cinta?\nNada tambahan merupakan kecintaan terang.\n Suaraku pembakaran segera selama lamanya.\nrasul dari bisikan rasi.\nBerdasarkan baru limunan...\npurbakala ke segera\n\n\nVibrating waves\n pulsating bright emanation of intuition-\nYou are an angel?\nI shout with a blazing flame- \n my voice my throat on fire\nRoaring resonance\nthe blazing lights\n muscles and tendons and bones\nextremely hot, bright-\na thousand million billion floating suns-\nsparks of light-\nsubtle light fractions-\n manifest themselves as gods in the bone-\ndevoured by the fire that cleans, a purifying rainbow.of fire.\nI was consumed by fire, fire fire fire rainbow-\n In the dark fleeting world of shadows\nI feel the love\nWho feels the love?\nOvertones making love with the light- \n Cosmic voices blaze eternal- \nMessengers from the whisperings of constellations-\nFoundation firm in the Invisible New-\nFrom antiquity to the immediate to the eternal- \nI am a rainbow on fire."
        },
        {
          "title": "Bianglala Batin (instrumental)",
          "duration": "02:58",
          "lyrics": null
        },
        {
          "title": "Iblis Atas Iblis",
          "duration": "03:35",
          "lyrics": "IBLIS ATAS IBLIS (Demons upon Demons)\n\nSetiap malaikat dan iblis menciptakan badan batin tanpa bergerak.\nSatu yang bodoh, seseorang tanpa kesadaran,\nmeniup nafas kehidupan di mukanya...\nTubuhnya bangun dari lempung diam.\nGerakan menambah kekuatan, itu yang merupakan terang.\nPerluasan kekal yang terik terang.\nSiapa adalah penggoda?\nHanya mencicipi buah.\nSudah diberikan dari Tuhan\nkelamin dan rohani.\n\n\nHal ini sudah diberikan.\nsudah milik Engkau.\nHal ini sudah menjadi milik engkau.\nDapat merasakannya.\nDIBERIKAN dari malaikat dan singa\n\n\n\nEach angel and the devil created the inner body without moving.\nOne is stupid, someone without consciousness,\nblew the breath of life in the face ...\nHis body was built from silent clay-\nAdding strength to the movement, it is bright.\nExpansion of the blazing light of eternity.\nWho is the tempter?\nJust taste the fruit-\ngiven from the God\nof sex and Spirit.\n\nThis is already provided,\nit already belongs to you.\nThis already belongs to you.\nGiven to you by angels and lions, \nyou can feel it."
        },
        {
          "title": "Madu Mahadasyat",
          "duration": "02:26",
          "lyrics": null
        },
        {
          "title": "Susu Naga",
          "duration": "03:12",
          "lyrics": "MINUM SUSU INI DARI BUAH DADA NAGA"
        },
        {
          "title": "Wadah Rohani",
          "duration": "04:53",
          "lyrics": null
        },
        {
          "title": "Perawan Berawan",
          "duration": "03:58",
          "lyrics": null
        },
        {
          "title": "Halilintar (original version)",
          "duration": "03:25",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://arrington.bandcamp.com/album/honey-and-poison-2019-malaikat-dan-singa",
      "title": "Honey and Poison (2019) MALAIKAT DAN SINGA",
      "artist": "Arrington de Dionyso",
      "classification": "paid",
      "tags": [
        "Experimental",
        "K Records",
        "Olympia underground",
        "Trance-punk",
        "bass clarinet",
        "cumbia",
        "free jazz",
        "indonesian",
        "javanese",
        "post-punk",
        "shamanic",
        "throatsinging",
        "Olympia"
      ],
      "item_id": 3529151725,
      "datePublished": "04 Jan 2019 00:00:00 GMT",
      "about": "This is the long-awaited follow up to 2013's \"Arrington de Dionyso's Malaikat dan Singa: OPEN THE CROWN\". \n\n\n\nThe online release of this album is a bittersweet admission of defeat and a triumphant if temporary return to songcraft. Recording began at Dub Narcotic Studio towards the end of 2013 and continued in spurts throughout 2014. Final mixes were made in 2017 but the recordings were not mastered until late in 2018. In many ways I have thought of \"Honey and Poison\" as both my \"Lost Album\" and perhaps my \"Last Album\" as I have seen the sad decay and transformation of my longstanding record label and the closing and sale of the recording studio that I had worked with for over twenty years. I had plans to press a vinyl version of this album but in the months leading up the 2016 presidential election my hopes for that happening greatly diminished. There is no room for this music in the \"music industry\" and no room for this music in the era of Trump and Fascism. This is trance world Trans-Utopian music, it is made for a world of imagination, a celebration of Life and a conversation with Death. I don't think I have ever recorded an album of \"songs\" so immediately meaningful and personally \"important\" to me. No record label is interested in releasing this, no publicist is interested in promoting this. It is up to YOU, the person reading this, to listen, to share, to say whatever it is you might like to say about the music contained in this virtual package \"Honey and Poison\". Thank you for listening. \n\n\n\nanimated music video:  www.youtube.com/watch?v=0U5rASZnV14\n\n some great live footage:  www.youtube.com/watch?v=gt-yd3HJAW4",
      "credits": "released January 4, 2019\n            \n            Recorded by Arrington de Dionyso and Malaikat dan Singa\n\nArrington de Dionyso- voice, guitar, bass clarinets, saxophones, other sounds\n\nNehemiah St Danger- bass guitar, organ\n\nJake Jones- drums, guitar on \"Todas Las Fiestas de Mañana\"\n\nBen Kapp- drums\n\nPatrick Semple- bass on the Jathilan Madhu and Honey and Poison (full band reprise version) plus bonus track\n\nAngelo Spencer- guitar and echoplex on Jathilan Madhu and Honey and Poison (full band reprise version) plus bonus track\n\n\n\nRecorded at Dub Narcotic Studio, Olympia 2013-2018\n\nmixed with Ben Hargett\n\nmastered with Pual Krogh",
      "license": "some rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a2867727889_0",
      "trackinfo": [
        {
          "title": "Broken Vessels",
          "duration": "05:10",
          "lyrics": null
        },
        {
          "title": "There Is No Reason",
          "duration": "03:42",
          "lyrics": "My mother died giving birth to the new sun\nBlazing bright I touch the fire\nthe Cosmic Dust, the Blinding Light\nI feel alright, I feel all right\nI stand in the light!\n\nMany different trees all growing in your garden\nFlowers I've never seen before\nPetals unfolding brilliant, a sweet nectar in the air!\n\nThere is no reason to do what you don't love\nthe only Reason is to do what you Do love- \nponder the mystery!\n\nThe temple of my birth is no more\nMany brothers go to war\nSoldiers die for your decorum\nChildren drown for your decorum\nBuildings rubble for your decorum\nWilderness bare for our decorum\nMountains flat for our decorum\nUnfillable hunger for our decorum\n\nThere is no reason to do what you don't love\nThe only Reason is to do what you do love!\nPonder the mystery? Ponder the mystery!\nI have no answer to the question!"
        },
        {
          "title": "Oh! Spark of Impulse",
          "duration": "03:28",
          "lyrics": null
        },
        {
          "title": "Honey and Poison",
          "duration": "03:03",
          "lyrics": null
        },
        {
          "title": "Mingkar Mingkur",
          "duration": "03:11",
          "lyrics": null
        },
        {
          "title": "Swimming In The Spirit World",
          "duration": "02:56",
          "lyrics": null
        },
        {
          "title": "One Black Hole Consumes Another",
          "duration": "02:51",
          "lyrics": null
        },
        {
          "title": "Jathilan Madhu",
          "duration": "08:33",
          "lyrics": null
        },
        {
          "title": "Todas Las Fiestas de Mañana",
          "duration": "05:20",
          "lyrics": null
        },
        {
          "title": "Honey and Poison (full band reprise)",
          "duration": "05:13",
          "lyrics": null
        },
        {
          "title": "BONUS All The Signs Are Alive",
          "duration": "04:40",
          "lyrics": null
        },
        {
          "title": "BONUS Broken Glass (Instrumental)",
          "duration": "04:44",
          "lyrics": null
        },
        {
          "title": "BONUS Spooky Instrumental",
          "duration": "05:18",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://arrington.bandcamp.com/album/raw-honey-and-a-shot-of-poison-the-honey-and-poison-sessions",
      "title": "Raw Honey and a Shot of Poison: The Honey and Poison Sessions",
      "artist": "Arrington de Dionyso&#39;s Malaikat dan Singa",
      "classification": "paid",
      "tags": [
        "Experimental",
        "Indonesian Death Metal",
        "Olympia Punk",
        "Olympia WA",
        "Trance-punk",
        "bass clarinet",
        "dub",
        "free jazz",
        "javanese",
        "psilocybin",
        "shamanic",
        "shamanism",
        "throatsinging",
        "trance music",
        "Olympia"
      ],
      "item_id": 2289739711,
      "datePublished": "05 Feb 2021 00:00:00 GMT",
      "about": "For me, HONEY AND POISON represents the peak of my mid-2010s songwriting craft with the ensemble known as Malaikat dan Singa (Angels and Lions). The album was recorded on a Tascam 388 eight track at the Dub Narcotic Studio in Olympia, Washington throughout 2014 until 2017 and was finally mixed, mastered and released through Bandcamp in 2018. We very recently made the discovery of the original in-board \"rough\" mixes that were made before the songs were mixed digitally. There are no out-board effects of any kind used in these mixes, all EQ was achieved directly in the Tascam 388 which imparts a very unique sound quality that I like to call the RAW HONEY MIX. There is a very different spatial feeling communicated in these mixes, yes, it's raw but also extremely focused with no filler audio \"trickery\". \n\n\n\nI know a lot of you have already paid good money to get a download of the \"Honey and Poison\" album. You should feel completely empowered to help yourself to a free download of this version so that you can compare them back to back, and hopefully let me know which you prefer. We're hoping to FINALLY get this issued as a vinyl LP sometime in 2021 or early 2022, and we have the opportunity to choose from which version of the album we would prefer to master the laquers. So...let me know what you think, ok?\n\n\n\nAs an extra bonus, I've added a couple instrumental tunes from the same sessions that were not available before, and when you download the full album you also get a bonus live album recorded at the Hobbit House sometime in 2018 in Olympia, Washington.",
      "credits": "released February 5, 2021\n            \n            Arrington de Dionyso- voice, guitar, bass clarinet, lalove flute\n\nNehemiah St. Danger- bass and organ\n\nPatrick Semple- bass\n\nAngelo Spencer- second guitar and echoplex\n\nBen Kapp- drums\n\nJake Jones- drums and 12 string guitar on Todas Las Fiestas de Mañana\n\nChina Faith Star- soprano sax (on the live recordings at the Hobbit House).",
      "license": "some rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a1043428882_0",
      "trackinfo": [
        {
          "title": "Broken Glass RAW HONEY MIX",
          "duration": "05:11",
          "lyrics": null
        },
        {
          "title": "There Is No Reason RAW HONEY MIX",
          "duration": "03:40",
          "lyrics": null
        },
        {
          "title": "Oh! Spark of Impulse RAW HONEY MIX",
          "duration": "03:29",
          "lyrics": null
        },
        {
          "title": "Honey and Poison RAW HONEY MIX",
          "duration": "03:00",
          "lyrics": null
        },
        {
          "title": "Mingkar Mingkur RAW HONEY MIX",
          "duration": "03:09",
          "lyrics": null
        },
        {
          "title": "Swimming in the Spirit World RAW HONEY MIX",
          "duration": "02:50",
          "lyrics": null
        },
        {
          "title": "One Black Hole Consumes Another RAW HONEY MIX",
          "duration": "02:50",
          "lyrics": null
        },
        {
          "title": "Jathilan Madhu RAW HONEY MIX",
          "duration": "08:31",
          "lyrics": null
        },
        {
          "title": "Thunder of the Perfect Mind RAW HONEY MIX",
          "duration": "04:40",
          "lyrics": null
        },
        {
          "title": "Honey and Poison Reprise RAW HONEY MIX",
          "duration": "05:03",
          "lyrics": null
        },
        {
          "title": "Todas Las Fiestas de Mañana RAW HONEY MIX",
          "duration": "05:15",
          "lyrics": null
        },
        {
          "title": "International Espionage RAW HONEY MIX",
          "duration": "04:58",
          "lyrics": null
        },
        {
          "title": "Broken Glass Instrumental RAW HONEY MIX",
          "duration": "04:33",
          "lyrics": null
        },
        {
          "title": "Live at the Hobbit House part 1",
          "duration": "13:17",
          "lyrics": null
        },
        {
          "title": "Live at the Hobbit House part 2",
          "duration": "07:06",
          "lyrics": null
        },
        {
          "title": "Live at the Hobbit House part 3",
          "duration": "10:28",
          "lyrics": null
        },
        {
          "title": "Live at the Hobbit House part 4",
          "duration": "19:36",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://arrington.bandcamp.com/album/voice-mask-luna",
      "title": "Voice Mask Luna",
      "artist": "Arrington de Dionyso",
      "classification": "paid",
      "tags": [
        "Ethnographic",
        "Experimental",
        "Trance-punk",
        "bass clarinet",
        "ecstatic",
        "free jazz",
        "kargyraa",
        "kazoo",
        "shamanic",
        "shamanic music",
        "throatsinging",
        "trance punk",
        "tribal",
        "Olympia"
      ],
      "item_id": 3737212633,
      "datePublished": "04 Jan 2024 00:00:00 GMT",
      "about": "The Voice Mask as performed on November 8 2023 at CaTMA (Contemporary and Trans-Modern Arts) in downtown Olympia. \n\nThe Voice Mask amplifies the natural voice through a steel casing with moveable membranes and resonators- the second half of the performance moves to bass clarinet. \n\n\n\nFor this album, the Voice Mask performance has been paired with a rediscovered \"lost\" recording made at Yes Yes Gallery in Olympia sometime in 2005. We don't remember who the other musicians are but it's a pretty incendiary improvisation well worth your while.",
      "credits": "released January 4, 2024",
      "license": "some rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a1167770010_0",
      "trackinfo": [
        {
          "title": "The Voice Mask Live at CaTMA Gallery",
          "duration": "20:42",
          "lyrics": null
        },
        {
          "title": "LUNA section one",
          "duration": "01:50",
          "lyrics": null
        },
        {
          "title": "LUNA section two",
          "duration": "06:30",
          "lyrics": null
        },
        {
          "title": "LUNA section three",
          "duration": "06:51",
          "lyrics": null
        },
        {
          "title": "LUNA section four",
          "duration": "05:51",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://arrington.bandcamp.com/album/live-in-beijing-raw-material-lab-august-1st-2024",
      "title": "Live in Beijing: Raw Material Lab August 1st 2024",
      "artist": "Arrington de Dionyso, Deng Boyu and Li Jianhong",
      "classification": "paid",
      "tags": [
        "Experimental",
        "Trance-punk",
        "bass clarinet",
        "free jazz",
        "shamanic",
        "throatsinging",
        "Olympia"
      ],
      "item_id": 3531393237,
      "datePublished": "05 Sep 2024 23:14:29 GMT",
      "about": "A WILD improvisation session recorded at Raw Material in Chaoyang, Beijing with Deng Boyu (drums) and Li Jianhong (guitar). Arrington de Dionyso performs on Voice Mask, Lalove flute, and bass clarinet. \n\n\n\nDeng Boyu and Li Jianhong are both longtime pillars of China's improvised music and noise scenes, please visit their pages too! \n\n\n\notoroku.bandcamp.com/album/inertion\n\n  lijianhong.org\n\n  cfimusic.bandcamp.com/album/here-is-it",
      "credits": "released September 5, 2024",
      "license": "some rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a0696787583_0",
      "trackinfo": [
        {
          "title": "Raw Material Lab",
          "duration": "36:44",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://arrington.bandcamp.com/album/piano-trance-2-holy-ghost-tones-benefit-for-tas-haitian-art-school",
      "title": "Piano Trance 2: Holy Ghost Tones: Benefit for TAS Haitian Art School",
      "artist": "Arrington de Dionyso",
      "classification": "paid",
      "tags": [
        "Experimental",
        "Haiti",
        "Haiti relief",
        "RaRa",
        "Trance-punk",
        "bass clarinet",
        "free jazz",
        "improvised music",
        "piano",
        "piano jazz",
        "piano solo",
        "psilocybin",
        "shamanic",
        "shamanic music",
        "throatsinging",
        "trance music",
        "Olympia"
      ],
      "item_id": 900069220,
      "datePublished": "29 May 2023 01:29:39 GMT",
      "about": "Part two of the \"Piano Trance\" series is dedicated to the benefit of Timouns Art School in Port-au-Prince, Haiti. ALL funds raised from downloads of this music will go directly to the art school which struggles to exist under extremely difficult and violent circumstances due to the political instability and gang warfare which makes normal life impossible in Haiti. The poorest country in the Western Hemisphere was once the richest land in the entire world, exploited endlessly since the very beginning of the colonial era and the slave trade that ensued. \n\n\n\nThe recording was made on May 23, 2023 after consuming a handful of Psilocybe ovoideocystidiata that I had harvested a year after inoculating the mycelium underneath a hundred year old black walnut tree. I felt the medicine start to kick in gently at first as I walked along the forest path from the Organic Farm to the Communications Building at the Evergreen State College, where I like to go to use the piano rehearsal rooms as often as I can. I saw the breathtaking beauty of the golden sun shine its beams through the translucent green tree leaves, reminding me of an experience I had almost thirty years ago in this same forest that taught me how to completely reconsider the ways I had been listening to and working with sound. I sang along with the birds and the gentle breeze as I walked, receiving heart affirmations from the ground I walked upon. \n\n\n\nEntering the private piano room and closing the door with the lights down low, this album dictated itself to me in its entirety as I played without pause for the 43 minute duration of this recording. \"Piano Kebyar\" is dedicated to the fierce Barong spirits of Java and Bali in gratitude for both the protection and abundant mischief they provide to their communities. \"Slit the Throat of the Slavemaster\" is dedicated to the heartbreaking struggle of the Haitian people to gain enduring freedom from the shackles of slavery, colonialism, and the ongoing exploitation both from other nations and from those who spread evil within their own society. May Haiti be FREE!\n\n\n\nThe album as a whole is especially dedicated to my dear brother Love Leonce, who runs the Timouns Art School in the shantytowns of Port-au-Prince. He works with the belief that providing young people with the transformative experience of art-making will help deter them from the temptation to join the violent gangs that cause only robbery and death in their own communities. \n\n\n\nIf you wish you can also donate directly through his GoFundMe as well.  \n\ngofund.me/cac97be4\n\n\n\n We also have a limited number of original paintings for sale created by Love Leonce and his students at TAS. We will be showing some of the paintings and also have prints available for selected works at CaTMA Gallery in Olympia in August 2023. Please message me directly with any questions. \n\n\n\nAYIBOBO",
      "credits": "released May 29, 2023",
      "license": "some rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a4250566745_0",
      "trackinfo": [
        {
          "title": "Piano Kebyar",
          "duration": "13:57",
          "lyrics": null
        },
        {
          "title": "Slit the Throat of the Slavemaster",
          "duration": "29:19",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://arrington.bandcamp.com/album/piano-trance-3-beyonc-stagehand-new-moon-ritual-magic",
      "title": "Piano Trance 3: Beyoncé Stagehand New Moon Ritual Magic",
      "artist": "Arrington de Dionyso",
      "classification": "paid",
      "tags": [
        "Experimental",
        "Trance-punk",
        "arrington de dionyso",
        "bass clarinet",
        "free jazz",
        "piano",
        "piano improvisation",
        "piano solo",
        "piano trance",
        "shamanic",
        "shamanic music",
        "throatsinging",
        "Olympia"
      ],
      "item_id": 3923566956,
      "datePublished": "16 Sep 2023 00:00:00 GMT",
      "about": "On September 14th, 2023 I did a brief New Moon ritual at the correct time, then went to Lumen Field to work overnight as a stagehand dismantling the lighting system at the Beyoncé concert. It was great! Very hard, fast paced work with lots of heavy lifting. I enjoyed myself immensely. I came home around 6am, slept a few hours and ran to the studio to create this album as a conclusion to my magical ritual, this is some of my best piano work to date. There is also a bass clarinet song dedicated to brother Charles Gayle who left us recently.",
      "credits": "released September 16, 2023",
      "license": "Some rights reserved. Please refer to individual track pages for license info.",
      "coverUrl_0": "https://f4.bcbits.com/img/a2290458804_0",
      "trackinfo": [
        {
          "title": "Gift From Virgo",
          "duration": "04:18",
          "lyrics": null
        },
        {
          "title": "Energy",
          "duration": "01:28",
          "lyrics": null
        },
        {
          "title": "Heated",
          "duration": "11:15",
          "lyrics": null
        },
        {
          "title": "Renaissance",
          "duration": "08:41",
          "lyrics": null
        },
        {
          "title": "America Has a Problem",
          "duration": "15:51",
          "lyrics": null
        },
        {
          "title": "Brother Charles Gayle Blues",
          "duration": "07:25",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://arrington.bandcamp.com/album/emergency-ritual-to-avert-nuclear-war",
      "title": "Emergency Ritual to Avert Nuclear War",
      "artist": "Arrington de Dionyso",
      "classification": "nyp",
      "tags": [
        "Experimental",
        "Trance-punk",
        "bass clarinet",
        "free jazz",
        "shamanic",
        "throatsinging",
        "Olympia"
      ],
      "item_id": 3373682503,
      "datePublished": "15 Jul 2022 06:12:39 GMT",
      "about": null,
      "credits": "released July 15, 2022",
      "license": "some rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a2661263560_0",
      "trackinfo": [
        {
          "title": "Emergency Ritual to Avert Nuclear War",
          "duration": "09:49",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://arrington.bandcamp.com/album/rites-of-possession-in-scandinavia",
      "title": "Rites of Possession in Scandinavia",
      "artist": "Arrington de Dionyso with Lee Noyes",
      "classification": "paid",
      "tags": [
        "Ethnographic",
        "Experimental",
        "Indonesia",
        "Trance-punk",
        "bass clarinet",
        "free jazz",
        "jathilan",
        "shamanic",
        "shamanism",
        "siberia",
        "throatsinging",
        "trance music",
        "Olympia"
      ],
      "item_id": 801306006,
      "datePublished": "02 Jun 2022 00:00:00 GMT",
      "about": "Rites of Possession in Scandinavia was recorded late at night on April 23rd 2022 in Gothenburg, Sweden at the beginning of Arrington's tour of Scandinavia including dates in Sweden, Denmark, and Norway.",
      "credits": "released June 2, 2022\n            \n            Arrington de Dionyso- voice, bass clarinet, silbado de jaguar\n\nLee Noyes- drums and percussion\n\n\n\nLee Noyes arranged for in-studio recording production and engineered the tracking for the session. \n\nArrington de Dionyso mixed and mastered the end result. \n\n\n\ncover photo by Chip Rountree",
      "license": "some rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a0794528493_0",
      "trackinfo": [
        {
          "title": "The Shimmering Skull",
          "duration": "08:47",
          "lyrics": null
        },
        {
          "title": "Spinal Cord of the Rainbow Serpent",
          "duration": "12:19",
          "lyrics": null
        },
        {
          "title": "A Curse and A Prayer",
          "duration": "15:11",
          "lyrics": null
        },
        {
          "title": "Damballah Blues",
          "duration": "09:35",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://arrington.bandcamp.com/album/malaikat-dan-singa-live-at-the-crypt-3-8-2024",
      "title": "Malaikat dan Singa: Live at the Crypt 3/8/2024",
      "artist": "Arrington de Dionyso&#39;s Malaikat dan Singa",
      "classification": "nyp",
      "tags": [
        "Experimental",
        "Trance-punk",
        "bass clarinet",
        "free jazz",
        "jathilan",
        "kargyraa",
        "post-punk",
        "shamanic",
        "shamanic rock",
        "throatsinging",
        "trance music",
        "Olympia"
      ],
      "item_id": 1014922721,
      "datePublished": "23 Mar 2024 00:00:00 GMT",
      "about": "Every now and then we get a live recording that is so wild and raw we figure it probably won't cause any damage, rather in fact, it will probably cause incredible healing for the world, restore damaged waterways, plant trees in the rainforest, create lasting peace between warring bloodthirsty regimes- if we just upload the tracks and share them with the world! BEHOLD- a recent concert by Arrington de Dionyso's Malaikat dan Singa- recorded live at Cryptatropa in Olympia Washington during the Free Radio Olympia benefit concert on March 8, 2024. \n\n\n\nArrington de Dionyso- vocals, guitar, bass clarinet\n\nKofi Adjepong- bass\n\nBenjamin Kapp- drums\n\nChina Faith Star- soprano saxophone, bells, background vocals",
      "credits": "released March 23, 2024",
      "license": "some rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a1414241471_0",
      "trackinfo": [
        {
          "title": "Giving Birth to the New Sun/Swimming in the Spirit World",
          "duration": "13:50",
          "lyrics": null
        },
        {
          "title": "Broken Vessels",
          "duration": "09:56",
          "lyrics": null
        },
        {
          "title": "Mani Malaikat/Kerasukan/Rasa Sentuh/Tak Terbatas",
          "duration": "21:06",
          "lyrics": null
        },
        {
          "title": "Honey and Poison and Jam",
          "duration": "06:36",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://arrington.bandcamp.com/album/shouting-over-deep-water-blues",
      "title": "Shouting Over Deep Water Blues",
      "artist": "Arrington de Dionyso",
      "classification": "paid",
      "tags": [
        "Experimental",
        "Trance-punk",
        "Tuvan Throat Singing",
        "asmr",
        "asmrcore",
        "bass clarinet",
        "blues",
        "bromiophone",
        "contrabass clarinet",
        "free jazz",
        "icaros",
        "sea shanty",
        "shamanic",
        "throatsinging",
        "Olympia"
      ],
      "item_id": 986128318,
      "datePublished": "04 Mar 2019 00:00:00 GMT",
      "about": "Recorded by Henrik Lofgren in a boat in the ocean near a small island in Sweden on July 23 2012. \n\n\n\nArrington de Dionyso performs on various Bromiophones and voice using modulations and resonances from the sonic idiosyncrasies of the small rowboat on the waves and various metallic objects used for echoing effects.\n\n\n\n\"A highly psychedelically charged sonic depth charge focused on Bromiophone and multiphonic voice, recorded with Henrik Lofgren in July of 2012 on an actual boat off the coast of Sweden (as seen in the photos!).\n\nThere is a weirdly ASMR vibe to some of these tracks, and a blues meets icaro tinge to others. I encourage you all to listen/download for free/pay what you want.\"",
      "credits": "released March 4, 2019",
      "license": "some rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a1365365325_0",
      "trackinfo": [
        {
          "title": "Bromiophone Over Deep Water",
          "duration": "04:40",
          "lyrics": null
        },
        {
          "title": "Icaros and Blues",
          "duration": "18:12",
          "lyrics": null
        },
        {
          "title": "Sea Monster Solstice Blues",
          "duration": "06:07",
          "lyrics": null
        },
        {
          "title": "Metallic Mantra Blues",
          "duration": "03:35",
          "lyrics": null
        },
        {
          "title": "Whispers and Hollers",
          "duration": "11:44",
          "lyrics": null
        },
        {
          "title": "Icaro and Buzz",
          "duration": "06:35",
          "lyrics": null
        },
        {
          "title": "Overtone ASMR",
          "duration": "06:08",
          "lyrics": null
        },
        {
          "title": "Hollerin' Over the Motor",
          "duration": "02:10",
          "lyrics": null
        },
        {
          "title": "Ultraviolet Icaro Blues",
          "duration": "03:53",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://arrington.bandcamp.com/album/uranium-jupiter-junction-tiger-poems",
      "title": "Uranium Jupiter Junction (Tiger Poems)",
      "artist": "Arrington de Dionyso, Gust Burns and Noel Kennon",
      "classification": "nyp",
      "tags": [
        "Experimental",
        "Trance-punk",
        "bass clarinet",
        "free improvisation",
        "free jazz",
        "piano",
        "shamanic",
        "shamanic music",
        "shamanism",
        "throatsinging",
        "trance music",
        "Olympia"
      ],
      "item_id": 4237597148,
      "datePublished": "01 May 2024 00:00:00 GMT",
      "about": "An incendiary (when is it not?) trio set recorded at Gallery 1412 in Seattle on April 19th 2024 during the historic Jupiter conjunction with Uranus in Taurus. May there be peace in this world. \n\n\n\nArrington de Dionyso- bass clarinet, throat, voice mask\n\nGust Burns- piano forte\n\nNoel Kennon- percussions and sound sculptures\n\n\n\nWe would like to dedicate this album to the memory of poet Jerome Rothenberg 1931-2024 (d. April 21 2024)",
      "credits": "released May 1, 2024",
      "license": "some rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a0297265253_0",
      "trackinfo": [
        {
          "title": "Tiger Poems (Uranium Jupiter Junction)",
          "duration": "45:12",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://arrington.bandcamp.com/album/piano-trance-series-vol-1-saturn-in-pisces",
      "title": "Piano Trance series vol. 1: Saturn in Pisces",
      "artist": "Arrington de Dionyso",
      "classification": "paid",
      "tags": [
        "Experimental",
        "Gospel",
        "Trance-punk",
        "bass clarinet",
        "free improvisation",
        "free jazz",
        "improvisation",
        "piano",
        "piano solo",
        "piano trance",
        "shamanic",
        "shamanic music",
        "throatsinging",
        "Olympia"
      ],
      "item_id": 3799401168,
      "datePublished": "09 Mar 2023 00:00:00 GMT",
      "about": "This album is an act of Magick!\n\nRecorded, mixed, mastered and released within one day to mark the auspicious entry of Saturn into Pisces, to ward off evil influence and exorcise demons!\n\n\n\nThis my first EVER album release showcasing my work with that most Western Canon of instruments, the illustrious Piano Forte. Let the powerful dream magic of Pisces dissolve whatever stale structures need to be broken down and digested, let the wisdom of Saturn give structure and lay foundation for our wildest spell-work!\n\n\n\nWhat do you think? I felt absolutely possessed while making this and it's been an enormous joy listening back to it. Is it compelling or interesting to anyone else out there to hear what I'm doing on the piano? I would be open to doing more of this in a \"proper\" studio and maybe a piano-only concert now and then if there is interest. Totally cool if it's not your thing though. \n\n\n\nA little background on this record for those who wish to read further: very few people know this, but piano was actually the first instrument I ever played. I would sneak up to the piano after church and pound the keys until a responsible adult would remove me from the holy milieu. Maybe they only heard a child making noise, but I could hear rich symphonies of dancing dragons, rain storms, circus performers and talking trees. For a short time I was \"forced\" to take lessons which I hated, because it was mind numbingly boring and only about learning the names of notes on the paper, not about unleashing torrents of ecstatic, all-consuming sheets of sound with the massive power of 88 tuned drums. \n\n\n\nAs I think more upon this theme of \"Saturn in Pisces\" I remember how I set out early in my musical career to offer the world what I envisioned as a complete and total rejection of all the norms and traditions of \"Western Civilization\" as I saw it- and how musically speaking at least, a piano in some ways represents the epitome of everything I sought to tear down. The spacing and division of the notes the way they are on a piano isn't \"natural\" in terms of creating purely intuitive music, as there is a structure determined by the instrument itself that is impossible to completely break away from without significantly altering the instrument itself. \n\n\n\nOf course at the same time maybe that is all total nonsense: I've had countless life-changing experiences listening to and even playing with some of the greatest piano players alive, who seem to effortlessly imbue this instrument of \"Saturnine structure\" with life-affirming creativity and imagination (Pisces). The LIMITATIONS (Saturn) of the instrument as it is handed down to us by Western tradition and world-view determining how sounds should be sounded, played by some hands at least, have the potential of delivering the listener into higher realms of boundless wonder and emotional catharsis. Total freedom? idk\n\n\n\nSO what then is the piano repertoire of Arrington de Dionyso? Here I attempt to work within the limitations of the instrument (no special avant-garde \"preparations\") as well as my own limitations in ability to play it. I touch the piano as a life-force conductor and conjure up some Hoodoo that hearkens a little bit to Stravinsky and Don Van Vliet, along with all those ancient planets of blues, jazz, classical, post-classical and the far-flung moons of post free 60's minimalist potentialities...I also bring in the rich years of experience that delivered me to the center of the horse-trance dances of East Java, the blaring pipes and pounding drums of Jajouka, down the raspy throats of the fire-breathing shamans of Tuva...like those famous mycelial threads on the forest floor, structures are built by connecting points between fragile cells, sometimes falling apart, sometimes changing directions, sometimes making a mess and picking up the blood-stained pieces out of the mud. \n\n\n\nMan, I hope you dig it!",
      "credits": "released March 9, 2023",
      "license": "some rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a1132009341_0",
      "trackinfo": [
        {
          "title": "Invocation",
          "duration": "01:37",
          "lyrics": null
        },
        {
          "title": "The Old Walnut Tree",
          "duration": "04:21",
          "lyrics": null
        },
        {
          "title": "Spinal Cord of the Rainbow Serpent Blues",
          "duration": "02:47",
          "lyrics": null
        },
        {
          "title": "Everybody Knows When the Volcano's Gonna Blow",
          "duration": "03:06",
          "lyrics": null
        },
        {
          "title": "Dragon Tax",
          "duration": "02:37",
          "lyrics": null
        },
        {
          "title": "My Bones Are Made of Something Mighty",
          "duration": "03:36",
          "lyrics": null
        },
        {
          "title": "Juniper Smoke and Vodka, Panther Juice and Rum",
          "duration": "08:36",
          "lyrics": null
        },
        {
          "title": "A Sketch on a Scrap of Paper",
          "duration": "00:20",
          "lyrics": null
        },
        {
          "title": "Still Cold In Springtime Blues",
          "duration": "02:22",
          "lyrics": null
        },
        {
          "title": "Dimitri Says",
          "duration": "00:35",
          "lyrics": null
        },
        {
          "title": "The Embrace of the Sudden Storm",
          "duration": "02:35",
          "lyrics": null
        },
        {
          "title": "She Carries the Weight of the Moon",
          "duration": "04:41",
          "lyrics": null
        },
        {
          "title": "The Divine Horsemen",
          "duration": "01:18",
          "lyrics": null
        },
        {
          "title": "Drop it Like it's Hot",
          "duration": "01:02",
          "lyrics": null
        },
        {
          "title": "The Mystery of Bou Jeloud and the Four Thousand Year Old Rock and Roll Band",
          "duration": "13:27",
          "lyrics": null
        },
        {
          "title": "My Bones Are Made of Falling Towers",
          "duration": "03:22",
          "lyrics": null
        },
        {
          "title": "From the Hills What Thunder Comes",
          "duration": "02:27",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://arrington.bandcamp.com/album/ayahuasca-tasting-room",
      "title": "Ayahuasca Tasting Room",
      "artist": "Ayahuasca Tasting Room",
      "classification": "paid",
      "tags": [
        "Drum & Bass",
        "Experimental",
        "Trance-punk",
        "ayahuasca",
        "ayahuasca ceremony",
        "ayahuasca music",
        "bass clarinet",
        "dubstep",
        "experimental electronic",
        "free jazz",
        "glitch",
        "sample-based",
        "shamanic",
        "throatsinging",
        "trance",
        "Olympia"
      ],
      "item_id": 2300942530,
      "datePublished": "20 Mar 2020 00:00:00 GMT",
      "about": "This album is a \"PREVIEW\" of more to come. Track 1 is available for streaming but the other tracks can only be heard after purchase is made. \n\n\n\nPlease be careful with how you use this music. Best with eyes closed. Headphones may be appropriate for most situations. If high-quality monitors are available listen at a relatively loud volume but beware that low end frequencies may cause damage to poorly equipped systems.",
      "credits": "released March 20, 2020",
      "license": "some rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a0221352198_0",
      "trackinfo": [
        {
          "title": "Ayahuasca Tasting Room - Stick in Mouth",
          "duration": "08:30",
          "lyrics": null
        },
        {
          "title": "DMT Factory",
          "duration": "10:09",
          "lyrics": null
        },
        {
          "title": "Glissando with Gongs",
          "duration": "03:04",
          "lyrics": null
        },
        {
          "title": "Gong Monster Insect",
          "duration": "01:12",
          "lyrics": null
        },
        {
          "title": "Secondo Coro dei Cantanti Difonici",
          "duration": "07:29",
          "lyrics": null
        },
        {
          "title": "Drone Dance in a Haunted Hive",
          "duration": "02:52",
          "lyrics": null
        },
        {
          "title": "Rattles and Red Wings",
          "duration": "04:59",
          "lyrics": null
        },
        {
          "title": "Gongs Two Deep w Sea Bird",
          "duration": "02:33",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://arrington.bandcamp.com/album/alkisah-senyawa-dan-singo-remix-benefit-for-palu-indonesia",
      "title": "ALKISAH (Senyawa dan Singo REMIX) Benefit For Palu, Indonesia",
      "artist": "Senyawa remixed by Arrington de Dionyso",
      "classification": "nyp",
      "tags": [
        "Experimental",
        "Future Music",
        "Indonesia",
        "Trance-punk",
        "Yogyakarta",
        "bass clarinet",
        "free jazz",
        "ritual trance",
        "shamanic",
        "throatsinging",
        "Olympia"
      ],
      "item_id": 3678866669,
      "datePublished": "05 Mar 2021 02:20:03 GMT",
      "about": "Indonesian band SENYAWA has made history with the release of \"Alkisah\" which will definitively be remembered among the best albums of 2021. By allowing the album to be released and remixed by almost 50 different labels they are completely undermining and revolutionizing the way that music is shared in the trans-modern landscape.\n\n\n\n I have been an active collaborator with Rully and Wukir since 2011- working together with them on our earliest multi-city tour of Indonesia as part of the Malaikat dan Singa \"Suara Bahaya Tour\" organized by Yes No Wave Music. We have performed and recorded together on many other occasions including my bandcamp release \"Unheard Indonesia Vol. 5\" and at our residency at Pioneer Works in NYC in 2016 after I organized the band's first ever concerts in the United States.\n\n\n\n I am overjoyed to bring you my own personal \"remix\" of ALKISAH made with the band's blessing. It is temporarily set to \"pay what you want\" download so that our friends in Indonesia will be able to enjoy, but please donate $10-20 if you can afford it, this is a fundraiser for our community of artists and musicians in Palu, Sulawesi to help them preserve endangered traditions and bring vibrancy to a community devastated by recent earthquakes, tsunamis and mudslides. A \"physical\" CDR version is also available. \n\n\n\nSee also the parallel release today of \"Elo Progo Improvisations\" which was recorded with Rully in 2013. These improvisations were recorded in the same location as where the band built their studio to make \"Alkisah\"- at the Tempuran Elo Progo near Borobodur. It is the meeting point of the mighty Elo and Progo Rivers in Central Java and a very potent sacred location. It is said that in early Buddhist history Lama Atisha travelled from Bengal to this exact area of Central Java where he meditated for twelve years before returning to the continent to become a founder of Yellow Hat Buddhism in Tibet.",
      "credits": "released March 5, 2021\n            \n            Rully Shabara- voice\n\nWukir- instruments\n\nArrington de Dionyso- additional overdubs and remix of original tracks",
      "license": "some rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a2903612059_0",
      "trackinfo": [
        {
          "title": "Kekuasaan REMIXED",
          "duration": "00:40",
          "lyrics": null
        },
        {
          "title": "Alkisah I REMIXED",
          "duration": "08:46",
          "lyrics": null
        },
        {
          "title": "Menuju Muara REMIXED",
          "duration": "03:06",
          "lyrics": null
        },
        {
          "title": "Istana REMIXED",
          "duration": "06:47",
          "lyrics": null
        },
        {
          "title": "Kabau REMIXED",
          "duration": "05:52",
          "lyrics": null
        },
        {
          "title": "Fasih REMIXED",
          "duration": "04:34",
          "lyrics": null
        },
        {
          "title": "Alkisah II REMIXED",
          "duration": "06:04",
          "lyrics": null
        },
        {
          "title": "Kiamat REMIXED",
          "duration": "02:29",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://arrington.bandcamp.com/album/through-the-lions-gate",
      "title": "Through the Lion&#39;s Gate",
      "artist": "Arrington de Dionyso, Michael Moore and McCloud Zicmuse",
      "classification": "nyp",
      "tags": [
        "Experimental",
        "Trance-punk",
        "bass clarinet",
        "free jazz",
        "shamanic",
        "throatsinging",
        "Olympia"
      ],
      "item_id": 3203946909,
      "datePublished": "01 Sep 2023 03:00:49 GMT",
      "about": "A LOST ALBUM! We don't know if this session is 2002, 2003, or 2004, but it's somewhere within that range. We don't remember exactly where the recording took place but it was either at Michael Moore's or Bert Wilson's house...and for about the first thirty minutes of listening back to this I couldn't for the life of me figure out who the other clarinet player was- but now we know beyond a doubt it's McCloud Zicmuse!\n\n\n\nMichael Moore- piano and toy piano\n\nArrington de Dionyso- bass clarinet, contra-alto clarinet\n\nMcCloud Zicmuse- alto clarinet, recorder, and just a tiny bit of singing at the end of track 12!\n\n\n\n\n\nA note from Tom Dyer of Green Monkey Records. \n\n\n\nI first encountered Michael Moore while putting a jazz combo together to play on “Jazz In Olympia” on my “Olympia: A True Story” album last year. I wanted to tell the story of the Oly jazz scene and put together a band made of former members of Obrador and Bert Wilson’s band, two of the most important groups in the Oly Jazz history. Michael was a founding member of Obrador; their piano player. Unfortunately, Michael’s health was too poor to play on the album, so we had no piano player.\n\n\n\nIn the ensuing year I have gotten to know Michael, who started feeding me unreleased Obrador recordings for my FreeForm Northwest radio show on KAOS 89.3 FM Olympia, including a great recording of them live at McNeil Island federal prison in 1977. I realized there is a wealth of great pre-internet Olympia jazz that is becoming rapidly forgotten as these great players age and I decided to give some of it a public life out in the modern streaming internet world, on a little download/streaming label, OlyJazz. The first release was a previously unreleased Obrador studio album San Francisco, CA 1983.\n\n\n\nRecently, Michael gave me a CD from an improv session in the early 2000’s with Arrington de Dionyso and Mr. X. Delightful. And of course, it was the only known copy. I immediately put it on the air. Of course. \n\n\n\nI got the music to Arrington - it was his session - and said what do you think? Now we are making this music available to the world for the first time, through Arrington’s bandcamp page and through all major streaming services. This is ephemeral music that existed once in the atmosphere and was captured and now, finally, makes its way to you. Enjoy this little sliver of the world!",
      "credits": "released September 1, 2023",
      "license": "some rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a2873347812_0",
      "trackinfo": [
        {
          "title": "The Doctor's Search",
          "duration": "13:08",
          "lyrics": null
        },
        {
          "title": "Many Wandering Roads",
          "duration": "00:47",
          "lyrics": null
        },
        {
          "title": "Arc Symphony",
          "duration": "01:02",
          "lyrics": null
        },
        {
          "title": "Linguistics",
          "duration": "01:10",
          "lyrics": null
        },
        {
          "title": "A Simple SOL-ution",
          "duration": "02:01",
          "lyrics": null
        },
        {
          "title": "A Short One",
          "duration": "01:46",
          "lyrics": null
        },
        {
          "title": "Something About Nothing",
          "duration": "01:30",
          "lyrics": null
        },
        {
          "title": "Ridiculous Hovering",
          "duration": "01:37",
          "lyrics": null
        },
        {
          "title": "Ask Me Another Question",
          "duration": "02:28",
          "lyrics": null
        },
        {
          "title": "Swan Song",
          "duration": "03:33",
          "lyrics": null
        },
        {
          "title": "I Feel Strange",
          "duration": "03:52",
          "lyrics": null
        },
        {
          "title": "Yonder Is My Love",
          "duration": "08:41",
          "lyrics": null
        },
        {
          "title": "Quasimodo",
          "duration": "03:30",
          "lyrics": null
        },
        {
          "title": "Land Of The Giants",
          "duration": "00:53",
          "lyrics": null
        },
        {
          "title": "External Evidence",
          "duration": "03:20",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://arrington.bandcamp.com/album/the-dragon-raga-songs-of-psychic-fire-2020",
      "title": "The Dragon Raga (Songs of Psychic Fire 2020)",
      "artist": "Arrington de Dionyso",
      "classification": "paid",
      "tags": [
        "Experimental",
        "Shamanistic Jazz",
        "Trance-punk",
        "ayahuasca",
        "bass clarinet",
        "ceremonial",
        "dub",
        "free jazz",
        "kargyraa",
        "psilocybin",
        "raga",
        "rock chamánico",
        "shamanic",
        "shamanism",
        "throatsinging",
        "Olympia"
      ],
      "item_id": 350031698,
      "datePublished": "03 Nov 2020 00:00:00 GMT",
      "about": "This album is a follow-up to a record I made in 2008 called \"I See Beyond the Black Sun\". There was a presidential election that year as well. Pluto was just beginning his entry into the sign of Capricorn. That will mean something to some people, to others it will not. \n\n\n\nSometimes we are faced with such a vision of doom that the end of the entire world seems right up in view and we are but like a deer or a raccoon or a possum staring blankly at two ever brightening disks of light rapidly increasing in size. \n\n\n\nIF Doom is approaching, it's been working its way towards us for at least five thousand years. This isn't to say that I am not alarmed or in any way free of the sense of dread and panic that most sensible people are feeling right now. I am however, willing to accept that we are indeed dangling over a precipice where everything we think we know is about to change. We really don't know exactly what comes next. \n\n\n\nEver since the end of February my mantra has been pretty consistent- \"We are never going 'back to normal' because whatever it was we were letting ourselves call 'NORMAL' was the very problem to begin with. So I welcome and embrace a total change, but it has been painful! It is GOING to be painful! We need to do what we can to keep each other alive and resist the monstrous powers that try to force us into despair, cynicism, giving up. \n\n\n\nI don't believe that artists or musicians have ever really occupied their rightful place in any society- as keepers of wisdom and continuity, and also as healers, dreamers, visionaries to guide us into being enveloped by and embracing whatever it is that comes next. \n\n\n\nI also have no idea if listening to this music that I have created is going to make any difference to you in your life right now in this particular moment. I don't know if anyone will look back in ten or twenty or a hundred years and consider this or anything else I have ever done as a legitimate or appropriate response to the turmoils of the early 21st Century. That part isn't up to me. I do believe trying to present you with some kind of \"ecstatic rock and roll\" explosive type music, designed for performance in compact spaces full of sweaty dancing people, feels a little out of touch in this particular moment. I haven't really been drawn to listen to anything in that category for a while. \n\n\n\nYears ago I had a conversation with an older gentleman that I met after a concert in a small basement gallery space in Paris, France that left a big impression on me. It was a wild show of the kind of free improvisational gymnastics I'm sometimes notorious for. He was complimenting the performance, but he also said something that struck me deeply- \"It seems to me you wish to use your music to talk to spirits, but somehow you hold back a little because you're also giving a 'performance'- I think you should stop worrying about 'performing' altogether, and just talk to the spirits.\"\n\n\n\nThat was more than ten years ago, and I think about those words nearly every time I make music. I strive to talk to spirits with my breath, and hopefully allow them to speak back through the sounds I channel. I know when I miss the mark or lose focus, but if I'm giving space for the improvisation to be authentically guided from a place of BREATH I always know when I'm at least headed in the right direction. \n\n\n\nWith this album, and really with any music or art that you truly enjoy and appreciate, please consider sharing in some way. I have left a couple tracks open to downloaded for \"free\" and a few more that you can only listen to if you pay for the download. If you're absolutely broke please let me know and I'll give you a free download, maybe I can even help you out with a little cash. Making and sharing a post about some new music you're enjoying on your social media channels is a PRICELESS GIFT to an independent artist, it goes much much further than you might imagine.",
      "credits": "released November 3, 2020\n            \n            Arrington de Dionyso- bass clarinet, voice, shruti boxes, lalove (Sulawesi flute), tape echo, electronic manipulations.",
      "license": "some rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a3370847434_0",
      "trackinfo": [
        {
          "title": "The Dragon Raga",
          "duration": "13:28",
          "lyrics": null
        },
        {
          "title": "Retrograde Radiation",
          "duration": "02:11",
          "lyrics": null
        },
        {
          "title": "The Sun is My Blood",
          "duration": "05:52",
          "lyrics": null
        },
        {
          "title": "Ourobouric Echoes pt 1",
          "duration": "02:06",
          "lyrics": null
        },
        {
          "title": "Ourobouric Echoes pt 2",
          "duration": "02:41",
          "lyrics": null
        },
        {
          "title": "Bass Blood Jaranan Doom",
          "duration": "05:00",
          "lyrics": null
        },
        {
          "title": "Pluto in Aquarius pt 1",
          "duration": "12:17",
          "lyrics": null
        },
        {
          "title": "Pluto in Aquarius pt 2",
          "duration": "07:10",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://arrington.bandcamp.com/album/lungs",
      "title": "LUNGS",
      "artist": "Arrington de Dionyso",
      "classification": "paid",
      "tags": [
        "Experimental",
        "Trance-punk",
        "bass clarinet",
        "free jazz",
        "shamanic",
        "throatsinging",
        "Olympia"
      ],
      "item_id": 2445897665,
      "datePublished": "03 Apr 2020 00:00:00 GMT",
      "about": null,
      "credits": "released April 3, 2020",
      "license": "some rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a2111233137_0",
      "trackinfo": [
        {
          "title": "The Mani Malaikat Awakening",
          "duration": "06:36",
          "lyrics": null
        },
        {
          "title": "LUNGS: The Exorcism",
          "duration": "29:12",
          "lyrics": null
        },
        {
          "title": "The Overtone Cleansing",
          "duration": "07:10",
          "lyrics": null
        },
        {
          "title": "Building the New Body of Light",
          "duration": "04:25",
          "lyrics": null
        },
        {
          "title": "The Voice is the Bell",
          "duration": "02:22",
          "lyrics": null
        },
        {
          "title": "Doom Samba of Banyuwangi",
          "duration": "08:14",
          "lyrics": null
        },
        {
          "title": "The View From the Yurt",
          "duration": "05:19",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://arrington.bandcamp.com/album/trance-music-for-crows-samhain",
      "title": "Trance Music For Crows: Samhain",
      "artist": "Arrington de Dionyso",
      "classification": "paid",
      "tags": [
        "Experimental",
        "Trance-punk",
        "bass clarinet",
        "free jazz",
        "psilocybin",
        "psychedelic",
        "ritual",
        "shamanic",
        "shamanic music",
        "throatsinging",
        "trance music",
        "Olympia"
      ],
      "item_id": 3640280410,
      "datePublished": "31 Oct 2020 00:00:00 GMT",
      "about": "This edition of Trance Music For Crows arrives just in time for your very special Covid/Corvid inspired Halloween celebration. This is from a \"lost\" recording session at Dub Narcotic Studio made some time in 2018. Arrington de Dionyso plays tenor and baritone saxophones and voice. Patrick Semple and Kofi Adjepong play the \"dueling basses\" and Amelia joins us on electric viola.",
      "credits": "released October 31, 2020",
      "license": "some rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a3612556456_0",
      "trackinfo": [
        {
          "title": "Trance Music For Crows- Samhain",
          "duration": "38:35",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://arrington.bandcamp.com/album/trust-the-drum",
      "title": "Trust the Drum",
      "artist": "Arrington de Dionyso",
      "classification": "paid",
      "tags": [
        "Experimental",
        "Trance-punk",
        "bass clarinet",
        "free jazz",
        "shamanic",
        "shamanic drumming",
        "shamanism",
        "throatsinging",
        "Olympia"
      ],
      "item_id": 2894208242,
      "datePublished": "22 Jun 2021 00:00:00 GMT",
      "about": "“TRUST THE DRUM full album now available. This album presents my perspective on the idea of \"Shamanic Drumming\" as a worthy listening experience. This music is going to be more energizing than relaxing. There are hypnotic qualities that will allow you to go as deep into a trance state as you are willing to go while listening. I recommend listening through good speakers if possible rather than headphones, the reason being is that headphones have a way of \"hacking\" your neurological response to sound waves by only running those waves through your ear drum. Try to listen with the whole body, particularly paying attention to how the low frequencies affect your breathing, digestion, heart rate and circulation.\n\nThe drum used is a 22 inch frame drum custom built for me by the Tuvan master Ayas Irgit. I highly recommend his drums and would be happy to put you in touch if you would like to order an instrument of your own.”",
      "credits": "released June 22, 2021",
      "license": "some rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a0881513071_0",
      "trackinfo": [
        {
          "title": "Chanson du Sorcier des Trois Frères",
          "duration": "12:59",
          "lyrics": null
        },
        {
          "title": "Echoes of Dimitri",
          "duration": "20:35",
          "lyrics": null
        },
        {
          "title": "The Oldest Relijun",
          "duration": "03:38",
          "lyrics": null
        },
        {
          "title": "Trust the Drum Until You Reach the Light",
          "duration": "19:36",
          "lyrics": null
        },
        {
          "title": "The Amanita Pantherina Raga",
          "duration": "20:00",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://arrington.bandcamp.com/album/elo-progo-improvisations",
      "title": "Elo Progo Improvisations",
      "artist": "Arrington de Dionyso and Rully Shabara",
      "classification": "nyp",
      "tags": [
        "Experimental",
        "Indonesian Death Metal",
        "Trance-punk",
        "Yogyakarta",
        "bass clarinet",
        "extended vocal technique",
        "free improvisation",
        "free jazz",
        "indonesian music",
        "shamanic",
        "throatsinging",
        "trance music",
        "Olympia"
      ],
      "item_id": 1299960208,
      "datePublished": "05 Mar 2021 00:00:00 GMT",
      "about": "In celebration of the release of Senyawa's new album ALKISAH through a mycelial network of nearly 50 different labels and remixers worldwide, we also offer \"Elo Progo Improvisations\" recorded by Arrington de Dionyso and Rully Shabara (vocalist of Senyawa) in 2013. These recordings were made near the same site where Alkisah was made- but outside under the trees, not inside a studio- at Tempuran Elo Progo- where the Elo and the Progo River meet in Central Java, very close to the ancient site of Borobodur. It is said that Lama Atisha travelled from Bengal to Elo Progo where he meditated for many years before returning to the continent to become a founder of Yellow Hat Buddhism in Tibet. \n\n\n\nIn these improvisations for voices, bromiophone, rubber bands and mirlitons, we tap into the sounds of wind and flowing water and harness those powers as an energetic strength. Some video was also recorded of this riverside session! \n\nwww.youtube.com/watch?v=cXY-CA08xPI&t=130s\n\n\n\n As an act of Sacred Reciprocity, this album is offered as a \"pay any amount\" release so that our friends in Indonesia may enjoy our work together without having to pay for the download. If you live in the United States, Canada, or Europe, etc and have the benefit of a PayPal account with funds, you are requested to offer an amount you feel comfortable with but at least $10 would be ideal. There is also a \"physical\" CDR release available as a double album that includes my \"Senyawa dan Singo\" remix of ALKISAH. \n\n\n\nHalf of the funds raised from this album will be directed to the benefit of our community of artists and musicians in Palu, Sulawesi, to assist in the preservation of traditional music and the sustaining of life in a community affected greatly by recent natural disasters (earthquake, tsunami, mudslides) that happened even before the Covid-19 pandemic even began.",
      "credits": "released March 5, 2021\n            \n            Rully Shabara- voice\n\nArrington de Dionyso- voice, bromiophone, rubber bands, membrane mirliton",
      "license": "some rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a2041574076_0",
      "trackinfo": [
        {
          "title": "Elo Progo Improvisation 1",
          "duration": "04:33",
          "lyrics": null
        },
        {
          "title": "Elo Progo Improvisation 2",
          "duration": "03:23",
          "lyrics": null
        },
        {
          "title": "Elo Progo Improvisation 3",
          "duration": "02:41",
          "lyrics": null
        },
        {
          "title": "Elo Progo Improvisation 4",
          "duration": "02:47",
          "lyrics": null
        },
        {
          "title": "Elo Progo Improvisation 5",
          "duration": "09:05",
          "lyrics": null
        },
        {
          "title": "Elo Progo Improvisation 6",
          "duration": "02:21",
          "lyrics": null
        },
        {
          "title": "Elo Progo Improvisation 7",
          "duration": "11:17",
          "lyrics": null
        },
        {
          "title": "Elo Progo Improvisation 8",
          "duration": "04:20",
          "lyrics": null
        },
        {
          "title": "Elo Progo Improvisation 9",
          "duration": "04:42",
          "lyrics": null
        },
        {
          "title": "Elo Progo Improvisation 10",
          "duration": "06:07",
          "lyrics": null
        },
        {
          "title": "Elo Progo Improvisation 11",
          "duration": "04:35",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://arrington.bandcamp.com/album/this-mouth-drum-is-my-dragon",
      "title": "This Mouth Drum is my Dragon",
      "artist": "Arrington de Dionyso",
      "classification": "paid",
      "tags": [
        "DMT",
        "Experimental",
        "Trance-punk",
        "ayahuasca",
        "bass clarinet",
        "free jazz",
        "i-dosing",
        "mushrooms",
        "psilocybin",
        "psychedelic",
        "shamanic",
        "throatsinging",
        "Olympia"
      ],
      "item_id": 3069043072,
      "datePublished": "30 Apr 2020 00:00:00 GMT",
      "about": "A very special \"5G Quarantine Album\" in which the artist consumed 5G of psilocybin cubensis and pressed the record button, performing on a variety of Siberian khomus (mouth-harps) and voice. The recordings were later effected and mixed stereophonically for playback with personal headphones to emphasize the trance-inducing frequencies of the music. Please listen loudly in a calm setting with dim lighting or total darkness to induce a safe but potent psychedelic experience accessible to all regardless of ability to directly consume plant/fungi medicines. NOT recommended for listening while operating a motor vehicle.",
      "credits": "released April 30, 2020",
      "license": "some rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a1268581275_0",
      "trackinfo": [
        {
          "title": "This Mouth Drum is my Dragon 1",
          "duration": "15:54",
          "lyrics": null
        },
        {
          "title": "This Mouth Drum is my Dragon 2",
          "duration": "19:36",
          "lyrics": null
        },
        {
          "title": "This Mouth Drum is my Dragon 3",
          "duration": "22:21",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://arrington.bandcamp.com/album/bobcat-flamethroat-1993",
      "title": "Bobcat Flamethroat (1993)",
      "artist": "Arrington de Dionyso",
      "classification": "paid",
      "tags": [
        "Experimental",
        "Olympia underground",
        "Trance-punk",
        "bass clarinet",
        "children's music",
        "free jazz",
        "shamanic",
        "throatsinging",
        "Olympia"
      ],
      "item_id": 3960006297,
      "datePublished": "03 Jul 2020 00:00:00 GMT",
      "about": "\"Bobcatflamethroat\" was originally released as \"Pine Cone Alley Cassette #9\" in August of 1993. The songs were recorded on a Tascam Porta-One 4 Track cassette studio inside a secret area in the basement of the College Activities Building at the Evergreen State College, known as \"Happyland\". This album has never before seen a digital release of any kind, however there is one song \"Everything is Broken\" which later became part of the original \"canon\" of Old Time Relijun after that band was formed in 1995. That song was re-recorded on the first Old Time Relijun album \"Songbook Vol. I\" released in 1997. \n\n\n\nI still dig most of the tunes on this one- these were all written and recorded while preparing to welcome a new young life into the world (my daughter Lucinda, born August 22, 1993). So while not specifically \"Children's Music\" per se, the tunes are wild, hopeful, optimistic yawps of playful abandon for all ages. There are a number of \"inside jokes\" that only would have made sense to the very tight knit inner circle hat I considered my \"core\" group of friends at that point in my life. I also think there are more than a few \"hits\" on here. I was 18 years old! \n\n\n\nAnyone who has followed the last thirty years of my musical career should find something of interest and delight on this album. For some reason I chose to record most of the guitar and bass parts \"direct\" without an amplifier- I'm not sure why I did that but it's a unique sound in retrospect. There's a decent dose of throatsinging and other odd vocal techniques, proving that I dove deep into this territory of vocal exploration at a very young age. Also plenty of mouth harps, flutes, kazoos, and clarinet, although this was just BEFORE I bought my first bass clarinet. The song \"Kite Dragon Hypnosis\" showcases the very first time I EVER recorded anything with a saxophone! \n\n\n\n The lyrics are reflective of my interests in the theories of \"Ethnopoetics\" as put forth by Jerome Rothenberg in many of his books such as \"Shaking the Pumpkin\" and \"Technicians of the Sacred\", as pathways to understanding the universality of myth and shamanism as connective threads through human poetic expression. And yes, if you know something about the Evergreen State College, I did indeed receive 16 credits for working on this album.",
      "credits": "released July 3, 2020",
      "license": "some rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a4289484233_0",
      "trackinfo": [
        {
          "title": "Wildcat",
          "duration": "02:29",
          "lyrics": null
        },
        {
          "title": "Elevator Shaft",
          "duration": "02:21",
          "lyrics": null
        },
        {
          "title": "Salal Harvest",
          "duration": "01:44",
          "lyrics": null
        },
        {
          "title": "Everything is Broken (Original Version)",
          "duration": "02:31",
          "lyrics": null
        },
        {
          "title": "My Nest is Best",
          "duration": "02:30",
          "lyrics": null
        },
        {
          "title": "I'm Crowded",
          "duration": "01:02",
          "lyrics": null
        },
        {
          "title": "Blue Ears",
          "duration": "01:41",
          "lyrics": null
        },
        {
          "title": "Baked Potato",
          "duration": "01:33",
          "lyrics": null
        },
        {
          "title": "Kite Dragon Hypnosis",
          "duration": "02:28",
          "lyrics": null
        },
        {
          "title": "Clumsy Uncle Stupid",
          "duration": "02:33",
          "lyrics": null
        },
        {
          "title": "Possum Pie and Apricot Wine",
          "duration": "02:15",
          "lyrics": null
        },
        {
          "title": "Rubber Band in the Stairwell of the Library Building",
          "duration": "01:15",
          "lyrics": null
        },
        {
          "title": "Lucifer Peacock Raven",
          "duration": "02:02",
          "lyrics": null
        },
        {
          "title": "The Fortune Jar",
          "duration": "02:03",
          "lyrics": null
        },
        {
          "title": "Under Shadows Tender Things Take Root and Grow",
          "duration": "01:57",
          "lyrics": null
        },
        {
          "title": "Oyster Mushrooms",
          "duration": "01:40",
          "lyrics": null
        },
        {
          "title": "Tukwila Joe",
          "duration": "02:16",
          "lyrics": null
        },
        {
          "title": "That Big Thing Wants to Eat You",
          "duration": "02:03",
          "lyrics": null
        },
        {
          "title": "Diogenes Like A Dog",
          "duration": "02:15",
          "lyrics": null
        },
        {
          "title": "Honey Dripping Leathery Orange Peel",
          "duration": "01:37",
          "lyrics": null
        },
        {
          "title": "Blue Rasputin",
          "duration": "01:43",
          "lyrics": null
        },
        {
          "title": "Silver Moon Duck",
          "duration": "01:53",
          "lyrics": null
        },
        {
          "title": "Crazy Bobcat in a Bag",
          "duration": "01:55",
          "lyrics": null
        },
        {
          "title": "Ocean Shores",
          "duration": "02:18",
          "lyrics": null
        },
        {
          "title": "The Prison Cell",
          "duration": "02:23",
          "lyrics": null
        },
        {
          "title": "Old Grey Farmer Railroad Maypole",
          "duration": "01:45",
          "lyrics": null
        },
        {
          "title": "Chase the Badger Around the Table",
          "duration": "01:35",
          "lyrics": null
        },
        {
          "title": "That Polecat That",
          "duration": "01:40",
          "lyrics": null
        },
        {
          "title": "Captain Clark",
          "duration": "02:18",
          "lyrics": null
        },
        {
          "title": "Under Shadows Tender Things Take Root and Grow (Reprise)",
          "duration": "03:47",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://arrington.bandcamp.com/album/live-at-china-cloud-1-12-2018",
      "title": "Live at China Cloud 1/12/2018",
      "artist": "Arrington de Dionyso and Ben Bennett",
      "classification": "paid",
      "tags": [
        "Experimental",
        "Trance-punk",
        "bass clarinet",
        "drumming",
        "free improvisation",
        "free jazz",
        "jazz",
        "saxophone",
        "shamanic",
        "throatsinging",
        "trance music",
        "tribal",
        "Olympia"
      ],
      "item_id": 1525517531,
      "datePublished": "01 Mar 2019 22:37:29 GMT",
      "about": "Live concert recording from January 12 2018 at the China Cloud, Vancouver BC CANADA\n\n\n\nArrington de Dionyso- tenor saxophone, voice, bass clarinet, bromiophone\n\nBen Bennett- drums and homemade instruments",
      "credits": "released March 1, 2019",
      "license": "some rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a4262547750_0",
      "trackinfo": [
        {
          "title": "part one",
          "duration": "29:19",
          "lyrics": null
        },
        {
          "title": "part two",
          "duration": "15:03",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://arrington.bandcamp.com/album/kurdish-rhythms-and-free-improvisation-live-at-the-chapel-performance-space",
      "title": "Kurdish Rhythms and Free Improvisation: Live at the Chapel Performance Space",
      "artist": "Ahmad Yousefbeigi, Arrington de Dionyso and special guest Amy Denio",
      "classification": "nyp",
      "tags": [
        "Experimental",
        "Indonesia",
        "Trance-punk",
        "bass clarinet",
        "clarinet",
        "daf",
        "free jazz",
        "kurdish",
        "kurdistan",
        "percussion",
        "shamanic",
        "throatsinging",
        "Olympia"
      ],
      "item_id": 883725215,
      "datePublished": "01 Mar 2019 07:00:28 GMT",
      "about": "This concert was recorded at The Chapel Performance Space at the Good Shepherd Center in Seattle on February 22, 2019. \n\n\n\nThe recording showcases the unique duo language developed between bass clarinetist (also playing Lalove, the sacred flute of Central Sulawesi) Arrington de Dionyso, with Ahmad Yousefbeigi, a master of traditional Kurdish percussion instruments such as the Daf, and also a seasoned improvisor. For the last third of the concert we are joined by Amy Denio on vocals and clarinet. \n\n\n\nAhmad ends the show with a solo performance of a traditional Kurdish song, dedicated to the memory of his brother.",
      "credits": "released March 1, 2019",
      "license": "some rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a2105766959_0",
      "trackinfo": [
        {
          "title": "Ahmad and Arrington Duo, section one",
          "duration": "13:16",
          "lyrics": null
        },
        {
          "title": "Ahmad and Arrington Duo, section two",
          "duration": "30:50",
          "lyrics": null
        },
        {
          "title": "Ahmad and Arrington joined by Amy Denio",
          "duration": "12:15",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://arrington.bandcamp.com/album/malaikat-dan-singa-live-at-octapas-cafe-4-12-2019",
      "title": "Malaikat dan Singa LIVE at Octapas Cafe 4/12/2019",
      "artist": "Arrington de Dionyso&#39;s Malaikat dan Singa",
      "classification": "paid",
      "tags": [
        "Experimental",
        "Olympia WA",
        "Olympia underground",
        "Trance-punk",
        "bass clarinet",
        "free jazz",
        "shamanic",
        "throatsinging",
        "Olympia"
      ],
      "item_id": 839260416,
      "datePublished": "19 Apr 2019 00:00:00 GMT",
      "about": "Recorded live at Octapas Cafe in Olympia, Washington on April 12th, 2019. \n\n\n\nMixed from ZOOM recording by Arrington de Dionyso\n\nArrington de Dionyso- voice, guitar, bass clarinet\n\nAngelo Spencer- guitar\n\nKofi Adjepong- bass\n\nBen Kapp- drums\n\nChina Faith Star- soprano saxophone\n\n\n\nthanks to Pual Krogh for live sound, thanks to Octapas Cafe\n\nspecial thanks to MDOU MOCTAR and his band!\n\n\n\nSONGS- \n\n1. Broken Vessels\n\n2. There is No Reason\n\n3. Swimming in the Spirit World\n\n4. Oh! Spark of Impulse\n\n5. Honey and Poison/Halilintar\n\n\n\nAll songs except \"Halilintar\" appear on the official release \"Honey and Poison\" by Arrington de Dionyso's Malaikat dan Singa, available ONLY through  arrington.bandcamp.com",
      "credits": "released April 19, 2019",
      "license": "some rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a2827370629_0",
      "trackinfo": [
        {
          "title": "Malaikat dan Singa LIVE at Octapas Cafe 4.12.2019",
          "duration": "34:43",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://arrington.bandcamp.com/album/unheard-indonesia-vol-15-trance-music-of-east-java-jathilan-gondowangi",
      "title": "Unheard Indonesia vol. 15- Trance Music of East Java: Jathilan Gondowangi",
      "artist": "Kuda Lumping Bantengan Jati Kusuma with Arrington de Dionyso",
      "classification": "nyp",
      "tags": [
        "Experimental",
        "Malang",
        "Trance-punk",
        "bass clarinet",
        "free jazz",
        "indo",
        "indonesian",
        "javanese",
        "shamanic",
        "throatsinging",
        "Olympia"
      ],
      "item_id": 3298319913,
      "datePublished": "11 Apr 2019 00:05:10 GMT",
      "about": "This recording documents part of a trance ritual held in collaboration between Arrington de Dionyso and the artists of Kuda Lumping Jati Kusuma in Gondowangi, East Java (near Mount Bromo). The ritual was also filmed for Narasi TV and the short documentary they produced gives greater explanation-  youtu.be/hOxDJkIlJ7I",
      "credits": "released April 11, 2019",
      "license": "some rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a2374138754_0",
      "trackinfo": [
        {
          "title": "Kuda Lumping Bantengan Jati Kusuma with Arrington de Dionyso part 1",
          "duration": "27:49",
          "lyrics": null
        },
        {
          "title": "Kuda Lumping Bantengan Jati Kusuma with Arrington de Dionyso part 2",
          "duration": "17:44",
          "lyrics": null
        },
        {
          "title": "Kuda Lumping Bantengan Jati Kusuma with Arrington de Dionyso part 3",
          "duration": "27:56",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://arrington.bandcamp.com/album/unheard-indonesia-vol-16-return-to-mojowarno-jaranan-tung-dor-2015",
      "title": "UNHEARD INDONESIA vol. 16 : Return to Mojowarno- Jaranan Tung Dor 2015",
      "artist": "Arrington de Dionyso and Jaranan Tung Dor of Mojowarno, East Java",
      "classification": "nyp",
      "tags": [
        "East Java",
        "Experimental",
        "Trance-punk",
        "World",
        "bass clarinet",
        "free jazz",
        "indonesian",
        "jathilan",
        "javanese",
        "percussion",
        "shamanic",
        "throatsinging",
        "trance music",
        "Olympia"
      ],
      "item_id": 1046853004,
      "datePublished": "15 May 2020 04:36:38 GMT",
      "about": "Volume 16 in the \"Unheard Indonesia\" series which documents the various types of collaborative settings in which I have been invited to perform while traveling throughout Indonesia. This recording was made in 2015 and is a follow up to Volume 4 of the series, as both editions document recordings made with the same community of Jaranan musicians in Mojowarno, East Java. \"Jaranan Tung Dor\" is believed (at least according to what I am told by musicians in East Java) to be the oldest style of Jaranan- you'll notice there are no gongs of any kind in this performance- only drums. Normally the only melodic element would be the vocalist- as this is a collaboration between myself and the community you will hear that I provide my services with the bass clarinet.",
      "credits": "released May 15, 2020\n            \n            Very special thanks to Riris for the invitation to return to Jombang/Mojowarno and the very memorable tour of the Majapahit/Singosari museum! \n\nen.wikipedia.org/wiki/Trowulan_Museum",
      "license": "some rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a3379361552_0",
      "trackinfo": [
        {
          "title": "Part One",
          "duration": "38:33",
          "lyrics": null
        },
        {
          "title": "Arrington de Dionyso with Jaranan Tung Dor of Mojowarno East Java - Part Two",
          "duration": "30:41",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://arrington.bandcamp.com/album/abraxasaxophonic-smooth-jazz-vagina",
      "title": "Abraxasaxophonic Smooth Jazz Vagina",
      "artist": "Arrington de Dionyso",
      "classification": "paid",
      "tags": [
        "Experimental",
        "Trance-punk",
        "bass clarinet",
        "free jazz",
        "shamanic",
        "throatsinging",
        "Olympia"
      ],
      "item_id": 561943059,
      "datePublished": "01 Jan 2001 00:00:00 GMT",
      "about": "VIDEO HERE:  www.youtube.com/watch?v=qH-hOug9fFU\n\n Arrington de Dionyso (Old Time Relijun and Malaikat Dan Singa) offers a solid 20 minutes of abrasive and bizarre free form saxophone work over the distorted reception of a smooth jazz radio station. Confusing yet strangely honest feeling. The first half of the flip side features several short pieces recorded in the same era (some sounding like fragments of Old Time Relijun pieces, some more in-line with Arrington's solo work), with the second half pulled from his masterpiece, \"Slow Dancin' Under the Moon Tonight\", about which he said: \"...was recorded sometime in 2010 using \"Songsmith\" software. It is one of the most unlistenable and abrasively grating albums ever made by Arrington de Dionyso\". Enjoy!",
      "credits": "released January 1, 2001\n            \n            From the original liner notes 2-25-2000\n\n\n\nABRAXASAXOPHONIC SMOOTH JAZZ VAGINA\n\nautomatic gematria of the dada-kabbalah revelation, \n\na blight on the hothouse clones\n\nancient awkward bleating dithyrambs unfurled, \n\n\n\na thunderous molten mass of honey \n\nundug from the pharoah's sepulchre-\n\nputid, mite-infested, but laced with gold-\n\na spark of light, sneaky dreaming in the rotten \n\ncore of the rabid radio plastic. \n\n\n\nTo the thunder of the perfect tidal mind, \n\na broken be-bop mirror, intensity enslaved\n\nin density of clumsy lead- \n\nthe primordial antiphony of natural protest, \n\na sparkling jewel lodged deep in the gargling\n\nthroat of the behemoth, lapis lazuli leaking \n\nfrom the cracks of the crocodile's jawbone unhinged, \n\nslipping come-soaked fingers\n\nthrough the underbrush of sacred cunt. \n\n\n\nA mutiny of clashing forms, \n\na relijun of gigantomachia in the triple circus, \n\nfrom coloseum to catacomb, a crawling of culture into the sea. \n\n\n\nWe are the post-shamans of the blackest rage. \n\nThe ripped-apart, unrendered god is ONE in MANY\n\nscattered, shattered, torn-apart pieces. \n\n\n\nThis work is the beginning of a twenty-two volume set, \n\nan extraction of the fermented chunks of god-flesh\n\nburied deep within the commodity culture. \n\nThis is a work of intimacy and archaeology, fixing glue\n\nto the scattered shards, mending the hole\n\nin the mirror of the world dream.",
      "license": "some rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a3278351492_0",
      "trackinfo": [
        {
          "title": "Smooth",
          "duration": "06:38",
          "lyrics": null
        },
        {
          "title": "Smoother",
          "duration": "15:12",
          "lyrics": null
        },
        {
          "title": "Dry Bones Drum 'n Bass",
          "duration": "01:45",
          "lyrics": null
        },
        {
          "title": "Rawk- Mermaids in the Android Brothel",
          "duration": "01:48",
          "lyrics": null
        },
        {
          "title": "Arthur Doyle is Behind You",
          "duration": "01:26",
          "lyrics": null
        },
        {
          "title": "Squaxaphonic AF",
          "duration": "02:03",
          "lyrics": null
        },
        {
          "title": "Gargle Horn Exposé",
          "duration": "02:07",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://arrington.bandcamp.com/album/big-ears-on-the-lookout-benefit-for-raices-texas",
      "title": "Big Ears on the Lookout- Benefit for RAICES Texas",
      "artist": "This Saxophone Kills Fascists with Greg Saunier",
      "classification": "nyp",
      "tags": [
        "Deerhoof",
        "Experimental",
        "Steve Gigante",
        "This Machine Kills Fascists",
        "Trance-punk",
        "arrington de dionyso",
        "bass clarinet",
        "free jazz",
        "greg saunier",
        "improvisation",
        "old time relijun",
        "shamanic",
        "throatsinging",
        "Olympia"
      ],
      "item_id": 1292096182,
      "datePublished": "04 Jul 2019 00:00:00 GMT",
      "about": "note: ALL funds raised by donations (minus the percentage deducted by bandcamp) are towards the benefit of RAICES Texas  www.raicestexas.org\n\n\n\n END CONCENTRATION CAMPS IN THE US AND EVERYWHERE ELSE\n\n\n\nTHIS SAXOPHONE KILLS FASCISTS \n\nArrington de Dionyso uses the transcendent power of tenor and baritone saxophones and the bass clarinet to surround hatred with the harmonic vibrations necessary to neutralize it and spread a message of liberation for all oppressed people. \n\n\n\n\n\nThese recordings document an ongoing collaboration between This Saxophone Kills Fascists and DEERHOOF drummer Greg Saunier. The first track on the album is a live concert at BIG EARS MUSIC FESTIVAL in Knoxville, Tennessee in May 2017. The concert features Steve Gigante (of Old Man Fuck You, Dark Inside the Sun, W-S Burn, Fork in the Blender Music) on bass. \n\n\n\nTrack two and three were recorded during an artist residency at the Lookout Arts Quarry in Skagit County, Washington.",
      "credits": "released July 4, 2019\n            \n            Arrington de Dionyso- tenor saxophone, baritone saxophone, bass clarinet\n\nGreg Saunier- drums\n\nSteve Gigante- bass on track 1",
      "license": "some rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a2050189268_0",
      "trackinfo": [
        {
          "title": "Arrington de Dionyso with Greg Saunier and Steve Gigante - Live at Big Ears Music Festival 2017",
          "duration": "33:04",
          "lyrics": null
        },
        {
          "title": "Lookout Arts Quarry 2018 part one",
          "duration": "24:49",
          "lyrics": null
        },
        {
          "title": "Lookout Arts Quarry 2018 part two",
          "duration": "10:53",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://arrington.bandcamp.com/album/orga-ar-1994",
      "title": "Orga Ar (1994)",
      "artist": "Arrington de Dionyso",
      "classification": "paid",
      "tags": [
        "Experimental",
        "Trance-punk",
        "bass clarinet",
        "free jazz",
        "shamanic",
        "throatsinging",
        "Olympia"
      ],
      "item_id": 229575678,
      "datePublished": "03 Jul 2020 00:00:00 GMT",
      "about": null,
      "credits": "released July 3, 2020",
      "license": "some rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a4052268479_0",
      "trackinfo": [
        {
          "title": "Earthquake",
          "duration": "01:54",
          "lyrics": null
        },
        {
          "title": "King of Nothing (original version)",
          "duration": "01:39",
          "lyrics": null
        },
        {
          "title": "Armadillos",
          "duration": "01:34",
          "lyrics": null
        },
        {
          "title": "Pterodactyl",
          "duration": "00:34",
          "lyrics": null
        },
        {
          "title": "Wine and Milk",
          "duration": "01:38",
          "lyrics": null
        },
        {
          "title": "Cooking",
          "duration": "01:27",
          "lyrics": null
        },
        {
          "title": "Morchella Elata",
          "duration": "01:45",
          "lyrics": null
        },
        {
          "title": "Cantharellus Cibarius",
          "duration": "02:38",
          "lyrics": null
        },
        {
          "title": "Sparassis Radica",
          "duration": "01:35",
          "lyrics": null
        },
        {
          "title": "Five Golden Keys",
          "duration": "02:41",
          "lyrics": null
        },
        {
          "title": "Qiyamat (Original Version)",
          "duration": "01:27",
          "lyrics": null
        },
        {
          "title": "Coprinus Comatus",
          "duration": "02:43",
          "lyrics": null
        },
        {
          "title": "Last Winter (The Berries Are Rotten)",
          "duration": "02:02",
          "lyrics": null
        },
        {
          "title": "Venerate Decay",
          "duration": "03:58",
          "lyrics": null
        },
        {
          "title": "Boletus Edulis",
          "duration": "02:50",
          "lyrics": null
        },
        {
          "title": "Theogeny",
          "duration": "02:03",
          "lyrics": null
        },
        {
          "title": "Happyland",
          "duration": "02:23",
          "lyrics": null
        },
        {
          "title": "Marasmius Oreades",
          "duration": "02:08",
          "lyrics": null
        },
        {
          "title": "Black Cat",
          "duration": "02:50",
          "lyrics": null
        },
        {
          "title": "Muff Eating Dinosaur Crocodile",
          "duration": "02:05",
          "lyrics": null
        },
        {
          "title": "The Assassins",
          "duration": "02:09",
          "lyrics": null
        },
        {
          "title": "Electric Mouth Harp",
          "duration": "01:05",
          "lyrics": null
        },
        {
          "title": "Little Red Riding Hood",
          "duration": "02:03",
          "lyrics": null
        },
        {
          "title": "The Deep Lake",
          "duration": "01:21",
          "lyrics": null
        },
        {
          "title": "Pirate Radio (Thunder Lightning Tidal Wave)",
          "duration": "02:33",
          "lyrics": null
        },
        {
          "title": "Amanita Muscaria",
          "duration": "01:41",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://arrington.bandcamp.com/album/unheard-indonesia-archival-kaset-series-1-jathilan-ojo-sembrono",
      "title": "Unheard Indonesia Archival Kaset Series #1 JATHILAN Ojo Sembrono",
      "artist": "Kudho Praneso",
      "classification": "nyp",
      "tags": [
        "Experimental",
        "Indonesian",
        "Javanese",
        "Trance-punk",
        "Yogyakarta",
        "bass clarinet",
        "free jazz",
        "jaranan",
        "jathilan",
        "kuda lumping",
        "shamanic",
        "throatsinging",
        "Olympia"
      ],
      "item_id": 3519970883,
      "datePublished": "19 Jun 2019 22:21:46 GMT",
      "about": "In 2011 I began the \"Unheard Indonesia\" series to document the different types of collaborations I engage in with the incredible musicians I meet and work with throughout Indonesia. Over the years, I've often received requests to share some of the rare cassette treasures I find on my travels. Dare I say, this is the one cassette that literally started it all. Before ever going to Indonesia for the first time, I was looking for the incredible trance-inducing sounds of \"Kuda Lumping\", also known as \"Jathilan\" or \"Jaranan\" and a host of other names. I initially found this recording on Madrotter's blog and so I knew what I would be setting out to look for upon my first arrival to Java. I bought dozens of Jathilan cassette tapes at Popeye Music in West Yogyakarta, and to my surprise, one of the first tapes I played upon returning home was the very same tape I had first heard on the Madrotter blog. \n\n\n\nThis is a \"campursari\" or \"mixed\" style of Jathilan- you'll notice the propulsive backbeat provided by a Western style \"rock\" drum kit, and some of the lyrics are taken from popular radio hits of the time. That doesn't diminish one iota (I feel it rather enhances over all) the power of the trance-inducing and ultimately sacred nature of the music itself. \n\n\n\nI hooked up a cassette player to a CDR burner and later did my own EQ and mix & master of the music you hear. In fact, this might be one of the most \"hi-fi\" versions of this cassette that has ever been heard!\n\n\n\nThis music is NOT for profit of any kind and I make no claims of ownership. I only share these cassettes because this music is so important to me, and it is basically next to impossible to find this cassette today, so even many music lovers within Indonesia are unable to enjoy this music unless it is shared through an accessible online platform such as bandcamp.",
      "credits": "released June 19, 2019\n            \n            Jathilan Sleman: KUDHO PRANESO\n\nPimpinan: AGUS SUMBIYANTO\n\nSinden: MARIKEM\n\nWiraswara: BARDI, BUDIWIJOYO, MURSENO, PURWANTO\n\n\n\noriginally released on Fajar Records, year unknown, but estimating early to mid 90's?",
      "license": "some rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a0521713229_0",
      "trackinfo": [
        {
          "title": "Cassette Side One",
          "duration": "29:07",
          "lyrics": null
        },
        {
          "title": "Cassette Side Two",
          "duration": "29:07",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://arrington.bandcamp.com/album/trance-music-for-crows-live-at-le-voyeur-3-15-2018",
      "title": "Trance Music For Crows, Live at Le Voyeur 3/15/2018",
      "artist": "Trance Music For Crows",
      "classification": "paid",
      "tags": [
        "Death Metal",
        "Experimental",
        "Life-metal",
        "Olympia underground",
        "Trance-punk",
        "bass clarinet",
        "drone",
        "free jazz",
        "minimalism",
        "no wave",
        "shamanic",
        "shamanic music",
        "throatsinging",
        "trance music",
        "yes wave",
        "Olympia"
      ],
      "item_id": 1076913558,
      "datePublished": "02 Mar 2019 00:00:00 GMT",
      "about": null,
      "credits": "released March 2, 2019\n            \n            Arrington de Dionyso- tenor saxophone\n\nKofi Adjepong- bass\n\nPatrick Lorenzo- bass\n\nChina Faith Star- soprano saxophone\n\nHathor Vergotis- alto saxophone\n\nAmelia- amplified viola",
      "license": "some rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a3024867857_0",
      "trackinfo": [
        {
          "title": "Live at Le Voyeur 3/15/2018",
          "duration": "46:23",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://arrington.bandcamp.com/album/minneapolis-to-malang",
      "title": "Minneapolis to Malang",
      "artist": "Arrington de Dionyso with International Novelty Gamelan",
      "classification": "nyp",
      "tags": [
        "Experimental",
        "Trance-punk",
        "World",
        "balinese",
        "bass clarinet",
        "free jazz",
        "gamelan",
        "indonesian",
        "javanese",
        "shamanic",
        "throatsinging",
        "Olympia"
      ],
      "item_id": 900576457,
      "datePublished": "26 Sep 2018 20:55:26 GMT",
      "about": "The first section of this album documents a live collaboration between saxophonist Arrington de Dionyso and International Novelty Gamelan that took place on 4/21/17 in Minneapolis during Arrington's THIS SAXOPHONE KILLS FASCISTS national US tour. \n\n\n\nArrington de Dionyso plays baritone and tenor sax, bass clarinet, and bromiophones. \n\nChina Faith Star joins on soprano saxophone for a portion of the show. \n\n\n\nINTERNATIONAL NOVELTY GAMELAN IS:\n\nKevin Cosgrove\n\nElaine Evans\n\nDavid Morrison\n\nChris Parker\n\nKathy Knight\n\nRyan Billig\n\n\n\nvisit their website at  internationalnoveltygamelan.bandcamp.com\n\n\n\n As an interesting contrast, for the second half of the album I have added a live recording made in September 2015 in Malang, East Java with the artists of SINGO BUDOYO joined by Arrington de Dionyso on bass clarinet and a short section with throat-singing and bromiophone on part three.",
      "credits": "released September 26, 2018\n            \n            I'd like to dedicate this album to my friend Munir Khar who came to the United States seeking amnesty from political persecution in his home city of Malang, East Java. He was jailed for many months while waiting for his hearings and his story of finally being able to settle in Minneapolis as an artist is a truly extraordinary tale...as are all tales of people who seek refuge and safety from oppression anywhere in the world. I joked with him that maybe someday I will be forced to seek amnesty in Malang. So it's in that spirit that this album features Javanese-inspired trance music meets free jazz improvisations recorded with residents of both Minneapolis and Malang. Does that make sense?",
      "license": "some rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a2920753768_0",
      "trackinfo": [
        {
          "title": "Live in Minneapolis 4/21/2017",
          "duration": "32:11",
          "lyrics": null
        },
        {
          "title": "Arrington de Dionyso and Singo Budoyo - Singo Budoyo part one",
          "duration": "09:01",
          "lyrics": null
        },
        {
          "title": "Arrington de Dionyso and Singo Budoyo - Singo Budoyo part two",
          "duration": "08:37",
          "lyrics": null
        },
        {
          "title": "Arrington de Dionyso and Singo Budoyo - Singo Budoyo part three",
          "duration": "16:13",
          "lyrics": null
        },
        {
          "title": "Arrington de Dionyso and Singo Budoyo - Singo Budoyo part four",
          "duration": "11:12",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://arrington.bandcamp.com/album/gamelan-suara-baru-and-arrington-de-dionyso-live-at-pskaufman-gallery",
      "title": "Gamelan Suara Baru and Arrington de Dionyso: Live at PSKaufman Gallery",
      "artist": "Arrington de Dionyso and Gamelan Suara Baru",
      "classification": "nyp",
      "tags": [
        "Experimental",
        "Gamelan Fusion",
        "Javanese Gamelan",
        "Trance-punk",
        "bass clarinet",
        "free jazz",
        "gamelan",
        "indonesian",
        "shamanic",
        "throatsinging",
        "trancepunk",
        "Olympia"
      ],
      "item_id": 3289878299,
      "datePublished": "13 Feb 2019 00:00:00 GMT",
      "about": "ALL SALES/DONATIONS RAISED WILL BENEFIT ART AND MUSIC COMMUNITIES RECOVERING FROM THE EARTHQUAKE AND TSUNAMI IN PALU, INDONESIA\n\n\n\nWe are very pleased to be able to share this live recording made at PSKaufman Gallery in Downtown Los Angeles on January 20th, 2019. This recording documents a unique collaboration between musician and painter Arrington de Dionyso (playing bass clarinet and saxophone on this session) and the members of Gamelan Suara Baru. \n\n\n\nGamelan Suara Baru is an experimental Javanese gamelan collective based out of California Institute of the Arts. The brainchild of composer/performer, Sean Hayward, the group is known for its far-reaching collaborations. Recent projects include a full length album of original compositions for gamelan and metal music (to be released in April 2019), and an evening length performance of Lou Harrison’s gamelan works at REDCAT.\n\n\n\nIn the spirit of forging closer ties between students and lovers of Indonesian music in the US and communities of artists in need living in Indonesia, we offer the music contained herein in a spirit of peace and friendship to our peers in Palu, Sulawesi who are rebuilding their lives after suffering from a devastating earthquake and tsunami on September 30 2018. Any and all funds raised by downloading this recording will be directed to one of several different musicians in a position of community leadership in Palu.",
      "credits": "released February 13, 2019\n            \n            Arrington de Dionyso plays bass clarinet on tracks 1-5, tenor saxophone on track 6. \n\n\n\nGamelan Suara Baru members featured on this recording:\n\n\n\nBrandon Carson\n\nKayle Khanmohamed\n\nKomang Pande Wisnu Negara\n\nKanoa Ichiyanagi\n\nBjorn Gustafsson\n\nIsaac Rohr\n\nOtto Stuparitz\n\nSean Hayward\n\nNathan Ho\n\n\n\nvery special thanks to Paul and Taylor at PSKaufman Gallery. Go visit them when you have a chance!  www.pskaufman.com/collections/gallery-shop",
      "license": "some rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a2307029297_0",
      "trackinfo": [
        {
          "title": "Luncheon Loaf (Hayward)",
          "duration": "08:43",
          "lyrics": null
        },
        {
          "title": "Suara Suling / Gulo Klopo (Ki Nartosabdho/trad)",
          "duration": "07:55",
          "lyrics": null
        },
        {
          "title": "Do Your Fuckin' Dishes (Hayward)",
          "duration": "14:15",
          "lyrics": null
        },
        {
          "title": "Pakurmatan Suite (trad)",
          "duration": "12:20",
          "lyrics": null
        },
        {
          "title": "Coyote in Quiznos (Ho)",
          "duration": "06:57",
          "lyrics": null
        },
        {
          "title": "Eling Eling (trad)",
          "duration": "06:03",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://arrington.bandcamp.com/album/unheard-indonesia-vol-13-kampung-bali-banyuwangi",
      "title": "Unheard Indonesia Vol. 13: Kampung Bali Banyuwangi",
      "artist": "Arrington de Dionyso and the artists of Kampung Bali, Banyuwangi East Java",
      "classification": "nyp",
      "tags": [
        "Banyuwangi",
        "East Java",
        "Experimental",
        "Trance-punk",
        "balinese gamelan",
        "bass clarinet",
        "free jazz",
        "gamelan",
        "indonesian",
        "shamanic",
        "throatsinging",
        "Olympia"
      ],
      "item_id": 1589762203,
      "datePublished": "27 Sep 2018 05:09:29 GMT",
      "about": "A wild night in Banyuwangi, East Java- in Kampung Bali with full Balinese style gamelan orchestra (and vocal gamelan) joined by American energy musician Arrington de Dionyso on bass clarinet. If you like your gamelan loud and fast it will be hard to find it more extreme than this.\n\n\n\nThis event was organized in partnership with HIDORA, which promotes cultural and economic sustainability and self-determination for traditional village communities across Indonesia, with special focus on East Java.",
      "credits": "released September 27, 2018",
      "license": "some rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a1565468152_0",
      "trackinfo": [
        {
          "title": "Kampung Bali part one",
          "duration": "09:00",
          "lyrics": null
        },
        {
          "title": "Kampung Bali part two",
          "duration": "16:34",
          "lyrics": null
        },
        {
          "title": "Kampung Bali part three \"vocal gamelan\"",
          "duration": "12:38",
          "lyrics": null
        },
        {
          "title": "Kampung Bali part four",
          "duration": "07:36",
          "lyrics": null
        },
        {
          "title": "Kampung Bali part five",
          "duration": "10:05",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://arrington.bandcamp.com/album/unheard-indonesia-12-madura-saronen-irama-putra",
      "title": "Unheard Indonesia 12: Madura: Saronen Irama Putra",
      "artist": "Arrington de Dionyso and Saronen Irama Putra",
      "classification": "nyp",
      "tags": [
        "Experimental",
        "Indonesia",
        "Trance-punk",
        "World",
        "bass clarinet",
        "free jazz",
        "java",
        "shamanic",
        "throatsinging",
        "trance",
        "tribal",
        "Olympia"
      ],
      "item_id": 418072938,
      "datePublished": "02 Aug 2018 22:53:02 GMT",
      "about": "This documents a collaboration that took place in the village of Sumenep on Madura Island, Indonesia between Arrington de Dionyso on tenor sax and the artists of Saronen Irama Putra. Singing by Bapak Pusa'e terima kasih!\n\nrecorded September 2017\n\nspecial thanks to Redy Eko Prastyo and the community of Sumenep",
      "credits": "released August 2, 2018",
      "license": "some rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a3957329501_0",
      "trackinfo": [
        {
          "title": "Saronen Irama Putra 1",
          "duration": "16:31",
          "lyrics": null
        },
        {
          "title": "Saronen Irama Putra 2",
          "duration": "25:38",
          "lyrics": null
        },
        {
          "title": "Saronen Irama Putra 3",
          "duration": "23:55",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://arrington.bandcamp.com/album/osing-trance-banyuwangi-unheard-indonesia-volume-8",
      "title": "Osing Trance Banyuwangi (UNHEARD INDONESIA Volume 8)",
      "artist": "Banyuwangi Putra with Arrington de Dionyso",
      "classification": "nyp",
      "tags": [
        "Banyuwangi",
        "Experimental",
        "Indonesia",
        "Trance-punk",
        "bali",
        "bamboo",
        "bass clarinet",
        "free jazz",
        "gamelan",
        "java",
        "shamanic",
        "throatsinging",
        "Olympia"
      ],
      "item_id": 638583118,
      "datePublished": "23 Feb 2016 00:00:00 GMT",
      "about": "OSING TRANCE, recorded in Temenggungan Village, Banyuwangi, East Java Indonesia in December 2015. \"Musik Patrol\" is a style of bamboo gamelan ensemble. As you can hear, the rhythms are played at a breakneck speed with fascinating shifts in phasing. \n\n\n\nThe region around Banyuwangi is particularly fascinating from a cultural perspective. As Islam spread across Java, Banyuwangi was the last major enclave of Hinduism before the island of Bali, which is only a few miles across the sea. Even though the region became \"officially\" Muslim there has always been a continuation of certain practices and beliefs from the pre-Islamic days, and that continuity remains dramatically in the musical styles still performed there. The rapid rhythms and phasing are definitely more in line with what you might expect from a Balinese gamelan, but there is still a kind of Javanese \"roughness\" in the attack and accents. The overall feel is quite different. The people of this region are Osing, a different ethnic identity than either Javanese or Balinese, with their own language and cultural traditions. \n\n\n\nThe group \"Banyuwangi Putra\" is considered a regional favorite. I'm told they have won many contests in Java and are often in demand to perform at many different kinds of cultural festivals and other events. \n\n\n\nOSING TRANCE is one of my favorites in the \"UNHEARD INDONESIA\" series documenting my collaborations with Indonesian musicians during my travels. If you download the full album you will also get to hear a few recordings of a children's gamelan that performed earlier the same day. I would like any Indonesian listener to be able to download the album for free. If you're living outside Indonesia and make more than $500 in one month please consider making a donation for the download as I've invested a considerable amount of my own money to finance both my travels and the editing of these recordings.",
      "credits": "released February 23, 2016\n            \n            Banyuwangi Putra performs on bamboo \"patrol\" instruments\n\nArrington de Dionyso on bass clarinet\n\nRedy Eko Prastyo performs on his modified flying fish sape.",
      "license": "some rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a0812139260_0",
      "trackinfo": [
        {
          "title": "Bamboo Patrol part 1",
          "duration": "27:20",
          "lyrics": null
        },
        {
          "title": "Bamboo Patrol Part 2",
          "duration": "12:22",
          "lyrics": null
        },
        {
          "title": "Bamboo Patrol Part 3",
          "duration": "11:59",
          "lyrics": null
        },
        {
          "title": "Banyuwangi children's gamelan part 1",
          "duration": "14:04",
          "lyrics": null
        },
        {
          "title": "Banyuwangi children's gamelan part 2",
          "duration": "06:18",
          "lyrics": null
        },
        {
          "title": "Banyuwangi children's gamelan part 3",
          "duration": "06:55",
          "lyrics": null
        },
        {
          "title": "Banyuwangi children's gamelan part 4",
          "duration": "14:08",
          "lyrics": null
        },
        {
          "title": "Banyuwangi children's gamelan part 5",
          "duration": "14:29",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://arrington.bandcamp.com/album/tsunami-benefit-unheard-indonesia-vol-14-serang-dakko-and-friends-in-makassar",
      "title": "TSUNAMI BENEFIT Unheard Indonesia vol. 14: Serang Dakko and Friends in Makassar",
      "artist": "Serang Dakko, Hamrin Samad, and Arrington de Dionyso",
      "classification": "nyp",
      "tags": [
        "Experimental",
        "Indonesia",
        "Makassar",
        "Palu",
        "Sulawesi",
        "Trance-punk",
        "bass clarinet",
        "ethnic",
        "free jazz",
        "percussion",
        "shamanic",
        "throatsinging",
        "tsunami relief",
        "Olympia"
      ],
      "item_id": 3117668029,
      "datePublished": "01 Oct 2018 06:22:27 GMT",
      "about": "SPECIAL NOTE: The musicians involved would like to dedicate this release to the healing and recovery of all those affected by the earthquake and tsunami in Palu, Central Sulawesi. ALL funds raised from this recording will go directly towards the benefit of recovery efforts. These recordings were made in August of 2018 in Makassar, Sulawesi INDONESIA (note of clarification: a different region of Sulawesi, not affected directly by the recent tsunami) with Daeng Serang Dakko, Daeng Hamrin Samad, and their students playing both traditional percussion and pui pui (traditional reed) along with some \"experimental\" wind instruments built by Hamrin. Arrington de Dionyso plays bass clarinet, bromiophone, and lalove (traditional Kaili flute from Central Sulawesi). \n\n\n\nThe last track is a free open improvisation ensemble featuring: Hamrin Samad, Basri B. Sila, Khaeruddin, Ancu Batara, Ochang, Serang Dakko, Bram, Arrington de Dionyso and Siswa SMK somba opu.",
      "credits": "released October 1, 2018\n            \n            Hamrin Samad, Basri B. Sila, Khaeruddin, Ancu Batara, Ochang, Serang Dakko, Bram, Arrington de Dionyso and Siswa SMK somba opu.",
      "license": "some rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a0394093795_0",
      "trackinfo": [
        {
          "title": "Serang Dakko with Arrington de Dionyso (Lalove)",
          "duration": "05:01",
          "lyrics": null
        },
        {
          "title": "Serang Dakko with Arrington de Dionyso (bass clarinet 1)",
          "duration": "15:05",
          "lyrics": null
        },
        {
          "title": "Serang Dakko with Arrington de Dionyso (bass clarinet 2)",
          "duration": "12:24",
          "lyrics": null
        },
        {
          "title": "Free Ensemble at the River",
          "duration": "38:47",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://arrington.bandcamp.com/album/low-clarinet-duos-2009",
      "title": "Low Clarinet Duos 2009",
      "artist": "Paul Hoskin and Arrington de Dionyso",
      "classification": "nyp",
      "tags": [
        "Experimental",
        "Trance-punk",
        "bass clarinet",
        "contra-bass clarinet",
        "contrabass clarinet",
        "free improvisation",
        "free jazz",
        "seattle",
        "shamanic",
        "throatsinging",
        "Olympia"
      ],
      "item_id": 2555071617,
      "datePublished": "11 Dec 2018 00:00:00 GMT",
      "about": "Paul Hoskin you will be missed my friend. \n\nRest in Peace\n\n1959-2018\n\n\n\nEveryone close to him was aware that his health was in decline, so I wasn't really \"surprised\" to learn we had lost Paul...but as the days have passed by the impact of that loss has dug into me deeper. \n\n\n\nWhen I first met Paul Hoskin in 1995, I was only twenty, and he was the first person I had ever met who shared such enthusiasm for the powerful sounds of the bass and contrabass clarinet family. I had only been playing for a few years, so meeting him through the Olympia Experimental Music Festival and later at the Seattle Improvised Music Festival was a profound encounter for me. Paul had dedicated his musical life to the fervent explorations of the uncharted outer limits of free improvisation through his instruments, for which he had developed uniquely unparalleled voicings and multiphonic techniques through which he tapped into a raw, unbridled expression bringing the listener directly in physical touch with PRIMORDIAL SOUND. \n\n\n\nIn his absence I would like to dedicate to his memory and to his many friends and musical co-collaborators the publishing of these duo sessions from 2009. Paul performs exclusively on contrabass clarinet, while I am on bass clarinet and contra-alto clarinet. Tracks 7 and 8 features some vocals through the body of the instrument, which in certain moments is modified by aluminum foil and a snare drum placed next to the bell. \n\n\n\nThe final track appears to have been recorded at an art gallery in Astoria, Oregon, I'm uncertain of the exact date in 2008 or 2009.\n\n\n\nUPDATED: Obituary written by Steve Peters\n\nPaul Hoskin 1958-2018\n\nBy Steve Peters\n\nPaul Hoskin, a key figure in Seattle’s history of freely improvised music, passed away in his Seattle apartment on November 17.\n\nWhile attending Oberlin College in the late ‘70s, Hoskin hung out with musicians and listened voraciously, especially to free jazz and European improvisation. In 1980 his brother gave him a battered C-melody saxophone salvaged from a friend’s attic and admonished him to start playing. Essentially self-taught, Hoskin worked his way through the reed family, eventually settling on contrabass clarinet and baritone sax, on which he developed a highly idiosyncratic voice that never ceased to evolve.\n\nIn the ‘80s and ‘90s Hoskin bounced between the coasts and toured around the US and Europe. He improvised relentlessly, playing in countless ad hoc groupings, as well as ongoing projects like Audio Letter and the sprawling New Art Orchestra in Seattle, and NYC groups The Same and Trigger. He also collaborated extensively with dancers, especially Linda Austin and Margit Galanter. He returned to the Northwest in the late ‘90s, moving around from the Olympic Peninsula to Astoria, Oregon, until finally settling down in Seattle in 2009.\n\nHoskin was a tireless catalyst in the improvised music community, always seeking out new players and venues and curating shows. In 1985 he organized a weekend gathering of locals and friends from New York to create the first Seattle Improvised Music Festival, now entering its 34th year. He continued to be involved with it sporadically, returning as co-curator in 2015 and 2016. He also booked shows at the Collins Pub, and was involved with Gallery 1412 and Spite House.\n\nSince 2016, Hoskin stepped back from music, attending the occasional gig but mostly laying low. No stranger to hard luck and hard living, his health deteriorated in the last few years, resulting in several brushes with mortality followed by astonishing recoveries, of which he was quite proud; he relished defying everyone’s worst expectations. But in recent months he resumed practicing, and spoke optimistically of returning to performing next year. He also privately expressed profound gratitude to the community that had helped nurture and support him through his various crises.\n\nPaul Hoskin touched a lot of lives and was beloved by many, even though loving him could be a challenge. He was full of contradictions: endearing, exasperating, brilliant, feral, loyal, stubborn, dedicated, self-deprecating, grandiose, gentle, dismissive, meticulous, chaotic, self-destructive, resilient. He might expound eloquently on Spinoza, Heidegger, and Wittgenstein, or recall a long, factually questionable story from 30 years ago. He lived on his own terms, made a deep impression on the music scene in Seattle and elsewhere, and leaves an equally large void in his absence. Quite simply, there was no one like him.",
      "credits": "released December 11, 2018\n            \n            Tracks 1-8 recorded at Dub Narcotic Studio in Olympia, circa 2009. \n\nTrack 9 live concert recording at the Chapel at The Good Shepherd Center, Seattle. Date unknown but presumed 2008 or 2009.",
      "license": "some rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a2048665888_0",
      "trackinfo": [
        {
          "title": "first",
          "duration": "07:55",
          "lyrics": null
        },
        {
          "title": "second",
          "duration": "04:27",
          "lyrics": null
        },
        {
          "title": "third",
          "duration": "07:51",
          "lyrics": null
        },
        {
          "title": "fourth",
          "duration": "08:25",
          "lyrics": null
        },
        {
          "title": "fifth",
          "duration": "01:17",
          "lyrics": null
        },
        {
          "title": "sixth",
          "duration": "12:14",
          "lyrics": null
        },
        {
          "title": "seventh",
          "duration": "13:12",
          "lyrics": null
        },
        {
          "title": "eighth",
          "duration": "04:18",
          "lyrics": null
        },
        {
          "title": "live at the chapel or astoria?",
          "duration": "24:25",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://arrington.bandcamp.com/album/unheard-indonesia-vol-11-jaranan-kampung-dokar",
      "title": "UNHEARD INDONESIA vol. 11 Jaranan Kampung Dokar",
      "artist": "Arrington de Dionyso with Jaranan Kampung Dokkar",
      "classification": "nyp",
      "tags": [
        "East Java",
        "Experimental",
        "Indonesia",
        "Malang",
        "Trance-punk",
        "World",
        "bass clarinet",
        "free jazz",
        "java",
        "javanese",
        "shamanic",
        "throatsinging",
        "trance music",
        "Olympia"
      ],
      "item_id": 3363763414,
      "datePublished": "27 Jun 2018 00:45:31 GMT",
      "about": "recorded August 30 2017 at Kampung Dokar Banjar Tengah Dau Kab. MALANG, East Java INDONESIA.\n\nArrington de Dionyso performs on tenor saxophone with the artists of Jaranan Kampung Dokkar. Special thanks to Redy Eko Prastyo for helping to organize this incredible event. \n\n\n\nThis recording was edited from a Jaranan trance music event that lasted roughly 3-4 hours. \n\n\n\nThe download is presented free of charge, any donation helps to fund the recording and promotion of traditional culture communities in Indonesia.",
      "credits": "released June 27, 2018\n            \n            terima kasih banyak: Redy Eko Prastyo, Hasan Asyari & Jaranan Kampung Dokar!\n\n\n\nfrom Halo Malang website:\n\nKolaborasi apik tersaji kala tiga basis kesenian berada dalam satu ruang bernama 'Dokar Berbunyi', Rabu (30/08/2017) di Kec. Dau, Kab. Malang.\n\n\n\nTarian Jaran Kepang atau Reog Ponorogo adalah hal yang sudah lazim kita lihat, dibawa ke level berbeda dengan iringan Trance Music Arrington De Dionyso dan gerak dinamis video mapping Etnicholic Project. Sebuah rumah di tengah permukiman Dusun Banjartengah dijadikan media proyeksi. Nuansa surealis semakin hidup kala aroma kemenyan berbaur di antara ratusan warga yang melingkari arena utama pertunjukan. Suara cambuk memecah dinginnya malam, para penari mulai kesurupan.\n\n\n\n\"Bisa jadi, ini kolaborasi pertama di Malang ketika Jaranan digabung dengan teknologi mapping video. Kita juga kehadiran tamu dari Washington USA, mas Arrington,\" ujar Redy Eko Prastyo seniman asal Malang pegiat di Etnicholic Project.\n\n\n\nKehadiran Arrington dan Etnicholic kali ini dalam giat pra-event Festival Kampung Dokar #2 yang akan digelar pada bulan Oktober 2017. Arrington adalah musisi eksperimental pendiri Olympia Experimental Music Festival yang sangat tertarik dengan musik-musik tradisional yang berhubungan dengan 'kerasukan/kesurupan'. Musik dalam seni jaranan adalah salah satunya. Malaikat dan Singa adalah grup musik baru yang Arrington bentuk. Sedangkan Redy, adalah musisi etnik yang juga pegiat di Jaringan Kampung Nusantara. Kolaborasi keduanya memang tak asing. Sebelumnya mereka pernah satu panggung di Festival Kampung Cempluk 2013. Arrington kala itu membawa nama Malaikat dan Singa Indonesia Journey#2.\n\n\n\n\"Masyarakat Dusun Banjartengah harus berbangga dengan event ini. Karena ini tak hanya kolaborasi lintas benua, juga lintas budaya,\" sambung Redy.\n\n\n\nKesenian Jaranan/Reog lokal yang menjadi gerak utama adalah Turonggo Sekar Remaja, Dau. Satu yang menjadi perhatian selain tiupan Saxophone Arrington adalah gerak lincah Azam (siwa TK 0 Besar) asal Pujon yang menjadi Bujang Ganong sebelum atraksi reog. Seniman cilik ini belajar otodidak sejak usia 3 tahun. Musisi karinding 'Unen-unen' asal Tuban juga meramaikan Dokar Berbunyi.\n\n\n\n\"Kampung Dokar kini juga dikenal di luar negeri. Dengan Kampung Dokar, ini menjadi bukti kalau persaudaraan tidak dibatasi oleh, desa, kampung atau negara. Semoga ini menjadi semangat baru untuk warga Banjartengah ini,\" ujar Hasan Asyari, Kepala Desa Sumbersekar.\n\n\n\nMeski singkat, Arrington rupanya cukup fasih mengucapkan salam perkenalan dalam bahasa Jawa. \"Kulo Arrington, matur nuwun untuk semua warga di sini. Saya senang di Kampung Dokar,\"",
      "license": "some rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a0212882805_0",
      "trackinfo": [
        {
          "title": "SIDE ONE",
          "duration": "30:48",
          "lyrics": null
        },
        {
          "title": "SIDE TWO",
          "duration": "28:15",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://arrington.bandcamp.com/album/songs-of-psychic-fire-vol-3",
      "title": "Songs of Psychic Fire, Vol. 3",
      "artist": "Arrington de Dionyso",
      "classification": "paid",
      "tags": [
        "Experimental",
        "Trance-punk",
        "bass clarinet",
        "experimental electronic",
        "free jazz",
        "noise",
        "shamanic",
        "throatsinging",
        "trance",
        "Olympia"
      ],
      "item_id": 1749521413,
      "datePublished": "21 Mar 2012 00:00:00 GMT",
      "about": "Recorded during the Spring Equinox 2012, using voice, bass clarinet, modified Marantz tape recorder and echoplex, at Dub Narcotic OLYMPIA.\n\n This music is inspired in part by an extraordinary experience I had on a recent tour in Sweden. I performed far away from any city in the ruins of an ancient fortress, feeling the call of the spirits through the rocks and burning branches. Video footage from that performance can be seen HERE=  www.youtube.com/watch?v=LVpMB2Ezjts\n\n  www.youtube.com/watch?v=ialvkZTzm8o",
      "credits": "released March 21, 2012",
      "license": "some rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a3626670389_0",
      "trackinfo": [
        {
          "title": "O Thunder, Perfect Mind",
          "duration": "04:52",
          "lyrics": "I was sent forth from the power,\nand I have come to those who reflect upon me,\nand I have been found among those who seek after me.\nLook upon me, you who reflect upon me,\nand you hearers, hear me.\nYou who are waiting for me, take me to yourselves.\nAnd do not banish me from your sight.\nAnd do not make your voice hate me, nor your hearing.\nDo not be ignorant of me anywhere or any time. Be on your guard!\nDo not be ignorant of me.\n\nFor I am the first and the last.\nI am the honored one and the scorned one.\nI am the whore and the holy one.\nI am the wife and the virgin.\nI am <the mother> and the daughter.\nI am the members of my mother.\nI am the barren one\nand many are her sons.\nI am she whose wedding is great,\nand I have not taken a husband.\nI am the midwife and she who does not bear.\nI am the solace of my labor pains.\nI am the bride and the bridegroom,\nand it is my husband who begot me.\nI am the mother of my father\nand the sister of my husband\nand he is my offspring.\nI am the slave of him who prepared me.\nI am the ruler of my offspring.\nBut he is the one who begot me before the time on a birthday.\nAnd he is my offspring in (due) time,\nand my power is from him.\nI am the staff of his power in his youth,\nand he is the rod of my old age.\nAnd whatever he wills happens to me.\nI am the silence that is incomprehensible\nand the idea whose remembrance is frequent.\nI am the voice whose sound is manifold\nand the word whose appearance is multiple.\nI am the utterance of my name.\n\nWhy, you who hate me, do you love me,\nand hate those who love me?\nYou who deny me, confess me,\nand you who confess me, deny me.\nYou who tell the truth about me, lie about me,\nand you who have lied about me, tell the truth about me.\nYou who know me, be ignorant of me,\nand those who have not known me, let them know me.\n\nFor I am knowledge and ignorance.\nI am shame and boldness.\nI am shameless; I am ashamed.\nI am strength and I am fear.\nI am war and peace.\nGive heed to me.\n\nI am the one who is disgraced and the great one.\nGive heed to my poverty and my wealth.\nDo not be arrogant to me when I am cast out upon the earth,\nand you will find me in those that are to come.\nAnd do not look upon me on the dung-heap\nnor go and leave me cast out,\nand you will find me in the kingdoms.\nAnd do not look upon me when I am cast out among those who\nare disgraced and in the least places,\nnor laugh at me.\nAnd do not cast me out among those who are slain in violence.\n\nBut I, I am compassionate and I am cruel.\nBe on your guard!\n\nDo not hate my obedience\nand do not love my self-control.\nIn my weakness, do not forsake me,\nand do not be afraid of my power.\n\nFor why do you despise my fear\nand curse my pride?\nBut I am she who exists in all fears\nand strength in trembling.\nI am she who is weak,\nand I am well in a pleasant place.\nI am senseless and I am wise.\n\nWhy have you hated me in your counsels?\nFor I shall be silent among those who are silent,\nand I shall appear and speak,\n\nWhy then have you hated me, you Greeks?\nBecause I am a barbarian among the barbarians?\nFor I am the wisdom of the Greeks\nand the knowledge of the barbarians.\nI am the judgement of the Greeks and of the barbarians.\nI am the one whose image is great in Egypt\nand the one who has no image among the barbarians.\nI am the one who has been hated everywhere\nand who has been loved everywhere.\nI am the one whom they call Life,\nand you have called Death.\nI am the one whom they call Law,\nand you have called Lawlessness.\nI am the one whom you have pursued,\nand I am the one whom you have seized.\nI am the one whom you have scattered,\nand you have gathered me together.\nI am the one before whom you have been ashamed,\nand you have been shameless to me.\nI am she who does not keep festival,\nand I am she whose festivals are many.\n\nI, I am godless,\nand I am the one whose God is great.\nI am the one whom you have reflected upon,\nand you have scorned me.\nI am unlearned,\nand they learn from me.\nI am the one that you have despised,\nand you reflect upon me.\nI am the one whom you have hidden from,\nand you appear to me.\nBut whenever you hide yourselves,\nI myself will appear.\nFor whenever you appear,\nI myself will hide from you.\n\nThose who have [...] to it [...] senselessly [...].\nTake me [... understanding] from grief.\nand take me to yourselves from understanding and grief.\nAnd take me to yourselves from places that are ugly and in ruin,\nand rob from those which are good even though in ugliness.\nOut of shame, take me to yourselves shamelessly;\nand out of shamelessness and shame,\nupbraid my members in yourselves.\nAnd come forward to me, you who know me\nand you who know my members,\nand establish the great ones among the small first creatures.\nCome forward to childhood,\nand do not despise it because it is small and it is little.\nAnd do not turn away greatnesses in some parts from the smallnesses,\nfor the smallnesses are known from the greatnesses.\n\nWhy do you curse me and honor me?\nYou have wounded and you have had mercy.\nDo not separate me from the first ones whom you have known.\nAnd do not cast anyone out nor turn anyone away\n[...] turn you away and [... know] him not.\n[...].\nWhat is mine [...].\nI know the first ones and those after them know me.\nBut I am the mind of [...] and the rest of [...].\nI am the knowledge of my inquiry,\nand the finding of those who seek after me,\nand the command of those who ask of me,\nand the power of the powers in my knowledge\nof the angels, who have been sent at my word,\nand of gods in their seasons by my counsel,\nand of spirits of every man who exists with me,\nand of women who dwell within me.\nI am the one who is honored, and who is praised,\nand who is despised scornfully.\nI am peace,\nand war has come because of me.\nAnd I am an alien and a citizen.\n\nI am the substance and the one who has no substance.\nThose who are without association with me are ignorant of me,\nand those who are in my substance are the ones who know me.\nThose who are close to me have been ignorant of me,\nand those who are far away from me are the ones who have known me.\nOn the day when I am close to you, you are far away from me,\nand on the day when I am far away from you, I am close to you.\n\n[I am ...] within.\n[I am ...] of the natures.\nI am [...] of the creation of the spirits.\n[...] request of the souls.\nI am control and the uncontrollable.\nI am the union and the dissolution.\nI am the abiding and I am the dissolution.\nI am the one below,\nand they come up to me.\nI am the judgment and the acquittal.\nI, I am sinless,\nand the root of sin derives from me.\nI am lust in (outward) appearance,\nand interior self-control exists within me.\nI am the hearing which is attainable to everyone\nand the speech which cannot be grasped.\nI am a mute who does not speak,\nand great is my multitude of words.\nHear me in gentleness, and learn of me in roughness.\nI am she who cries out,\nand I am cast forth upon the face of the earth.\nI prepare the bread and my mind within.\nI am the knowledge of my name.\nI am the one who cries out,\nand I listen.\nI appear and [...] walk in [...] seal of my [...].\nI am [...] the defense [...].\nI am the one who is called Truth\nand iniquity [...].\n\nYou honor me [...] and you whisper against me.\nYou who are vanquished, judge them (who vanquish you)\nbefore they give judgment against you,\nbecause the judge and partiality exist in you.\nIf you are condemned by this one, who will acquit you?\nOr, if you are acquitted by him, who will be able to detain you?\nFor what is inside of you is what is outside of you,\nand the one who fashions you on the outside\nis the one who shaped the inside of you.\nAnd what you see outside of you, you see inside of you;\nit is visible and it is your garment.\nHear me, you hearers\nand learn of my words, you who know me.\nI am the hearing that is attainable to everything;\nI am the speech that cannot be grasped.\nI am the name of the sound\nand the sound of the name.\nI am the sign of the letter\nand the designation of the division.\nAnd I [...].\n(3 lines missing)\n[...] light [...].\n[...] hearers [...] to you\n[...] the great power.\nAnd [...] will not move the name.\n[...] to the one who created me.\nAnd I will speak his name.\n\nLook then at his words\nand all the writings which have been completed.\nGive heed then, you hearers\nand you also, the angels and those who have been sent,\nand you spirits who have arisen from the dead.\nFor I am the one who alone exists,\nand I have no one who will judge me.\nFor many are the pleasant forms which exist in numerous sins,\nand incontinencies,\nand disgraceful passions,\nand fleeting pleasures,\nwhich (men) embrace until they become sober\nand go up to their resting place.\nAnd they will find me there,\nand they will live,\nand they will not die again."
        },
        {
          "title": "Face of Abraxas",
          "duration": "05:34",
          "lyrics": null
        },
        {
          "title": "Pearl of Sophia",
          "duration": "06:27",
          "lyrics": null
        },
        {
          "title": "Fever Dreams in the Empty Void",
          "duration": "06:04",
          "lyrics": null
        },
        {
          "title": "You Will Not Die",
          "duration": "14:28",
          "lyrics": null
        },
        {
          "title": "BONUS TRACK: Mirrors and Windows",
          "duration": "03:15",
          "lyrics": null
        },
        {
          "title": "BONUS TRACK: Crown of Tendrils",
          "duration": "13:05",
          "lyrics": null
        },
        {
          "title": "BONUS TRACK: Form Stripped Away",
          "duration": "09:02",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://arrington.bandcamp.com/album/yama-neko-improvisations-w-tori-kudo-2007",
      "title": "Yama Neko Improvisations (w/Tori Kudo) 2007",
      "artist": "Arrington de Dionyso and Tori Kudo",
      "classification": "paid",
      "tags": [
        "Experimental",
        "Japan",
        "Kudo",
        "Matsuyama",
        "Trance-punk",
        "bass clarinet",
        "free jazz",
        "maher shalal hash baz",
        "shamanic",
        "throatsinging",
        "Olympia"
      ],
      "item_id": 80290778,
      "datePublished": "23 Sep 2018 00:00:00 GMT",
      "about": "Recorded in February 2007 at Tsuru's home studio in Matsuyama Japan during the Maher Shalal Hash Baz/Arrington de Dionyso/Karl Blau joint tour organized by 7ep and K Records to celebrate the release of the KLP/7ep album \"L'Autre Cap\" by Maher Shalal Hash Baz, produced by Arrington de Dionyso. These pieces were improvised by Arrington and Tori with a very old pump organ that had a wonderful sound.",
      "credits": "released September 23, 2018\n            \n            Tori Kudo- pump organ\n\nArrington de Dionyso- bass clarinet, some voice, membrane horns",
      "license": "some rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a2613108522_0",
      "trackinfo": [
        {
          "title": "Ichi",
          "duration": "09:18",
          "lyrics": null
        },
        {
          "title": "Ni",
          "duration": "05:41",
          "lyrics": null
        },
        {
          "title": "San",
          "duration": "00:52",
          "lyrics": null
        },
        {
          "title": "Shi",
          "duration": "02:55",
          "lyrics": null
        },
        {
          "title": "Go",
          "duration": "05:02",
          "lyrics": null
        },
        {
          "title": "Roku",
          "duration": "04:55",
          "lyrics": null
        },
        {
          "title": "Sichi",
          "duration": "06:59",
          "lyrics": null
        },
        {
          "title": "Hachi",
          "duration": "03:51",
          "lyrics": null
        },
        {
          "title": "The Dogs of Matsuyama",
          "duration": "03:59",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://arrington.bandcamp.com/album/sound-is-the-medicine",
      "title": "Sound is the Medicine",
      "artist": "Arrington de Dionyso",
      "classification": "nyp",
      "tags": [
        "Experimental",
        "Indonesia",
        "Trance-punk",
        "World",
        "bass clarinet",
        "experimental folk",
        "free improvisation",
        "free jazz",
        "khomuz",
        "shamanic",
        "throat singing",
        "throatsinging",
        "Olympia"
      ],
      "item_id": 4137539065,
      "datePublished": "07 Jul 2015 00:00:00 GMT",
      "about": "This album was recorded to magnetic cassette using a modified Marantz tape recorder and a Neumann U-67 ribbon microphone on January 2nd, 2015. \"Side One\" features the Lalove, an end blown bamboo flute made in Central Sulawesi. \"Side Two\" features several different khomuz, or Siberian jew's harps, and some voice. The Sound Is The Medicine.",
      "credits": "released July 7, 2015",
      "license": "some rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a2308361893_0",
      "trackinfo": [
        {
          "title": "Lalove Circular Breathing",
          "duration": "31:45",
          "lyrics": null
        },
        {
          "title": "Khomuz Medicine",
          "duration": "33:15",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://arrington.bandcamp.com/album/psicolomagicolo-2005",
      "title": "Psicolomagicolo (2005)",
      "artist": "Arrington de Dionyso and Nusch Werchowska",
      "classification": "paid",
      "tags": [
        "Experimental",
        "Rennes",
        "Trance-punk",
        "bass clarinet",
        "free jazz",
        "musique actuelle",
        "musique improvisée",
        "piano",
        "shamanic",
        "throatsinging",
        "Olympia"
      ],
      "item_id": 2352224956,
      "datePublished": "11 Nov 2017 00:00:00 GMT",
      "about": "recorded in Rennes, France in...was it 2005?\n\nArrington de Dionyso on bass clarinet and voice\n\nNusch Werchowska on piano and modifications",
      "credits": "released November 11, 2017",
      "license": "some rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a1628958804_0",
      "trackinfo": [
        {
          "title": "One",
          "duration": "07:36",
          "lyrics": null
        },
        {
          "title": "Two",
          "duration": "06:48",
          "lyrics": null
        },
        {
          "title": "Three",
          "duration": "03:10",
          "lyrics": null
        },
        {
          "title": "Four",
          "duration": "04:02",
          "lyrics": null
        },
        {
          "title": "Five",
          "duration": "02:35",
          "lyrics": null
        },
        {
          "title": "Six",
          "duration": "05:31",
          "lyrics": null
        },
        {
          "title": "Seven",
          "duration": "04:29",
          "lyrics": null
        },
        {
          "title": "Eight",
          "duration": "06:18",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://arrington.bandcamp.com/album/naga-linglung-unheard-indonesia-vol-9-no-wave-gospel-from-semarang",
      "title": "Naga Linglung (Unheard Indonesia Vol. 9: No Wave Gospel from Semarang)",
      "artist": "HMMM with Arrington de Dionyso",
      "classification": "nyp",
      "tags": [
        "Beat Indonesia",
        "Experimental",
        "Indonesia",
        "Semarang",
        "Trance-punk",
        "bass clarinet",
        "free jazz",
        "indonesia rock",
        "javanese",
        "shamanic",
        "throatsinging",
        "trance",
        "Olympia"
      ],
      "item_id": 1870038014,
      "datePublished": "04 May 2016 00:40:54 GMT",
      "about": "Recorded in Semarang, Java, Indonesia in November 2015\n\n\n\nHMMM is a fantastic avant-music trio from Semarang. They are influenced equally by traditional Javanese trance music, No Wave, and Gospel. The guitarist Fredian Bintar reports being a huge Derek Bailey fan, and in some of singer Jane's vocal work I wonder if there isn't a bit of a Yoko Ono influence as well, but the music they make together with Riskia on drums is all their own and unlike anything else I have ever heard happening in contemporary Indonesian music.",
      "credits": "released May 4, 2016\n            \n            Fredian- guitar\n\nJane- vocal\n\nRiskia- drums\n\nArrington de Dionyso- bass clarinet, alat guntur, throatsinging, lalove, toleat",
      "license": "some rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a3264524953_0",
      "trackinfo": [
        {
          "title": "hmm",
          "duration": "08:29",
          "lyrics": null
        },
        {
          "title": "hmmmm",
          "duration": "18:36",
          "lyrics": null
        },
        {
          "title": "hmmmmm",
          "duration": "10:50",
          "lyrics": null
        },
        {
          "title": "hmmm",
          "duration": "06:04",
          "lyrics": null
        },
        {
          "title": "hm jungle",
          "duration": "12:39",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://arrington.bandcamp.com/album/blood-moon-raga",
      "title": "Blood Moon Raga",
      "artist": "Arrington de Dionyso",
      "classification": "paid",
      "tags": [
        "Experimental",
        "Trance-punk",
        "bass clarinet",
        "free jazz",
        "shamanic",
        "throatsinging",
        "Olympia"
      ],
      "item_id": 1530546249,
      "datePublished": "31 Oct 2015 00:00:00 GMT",
      "about": "Arrington de Dionyso with Oomung Varma on tabla, recorded by Nathan Gibson with additional synthesizer tracks by Nathan Gibson",
      "credits": "released October 31, 2015",
      "license": "some rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a2501735918_0",
      "trackinfo": [
        {
          "title": "Summer Turns to Fall",
          "duration": "15:18",
          "lyrics": null
        },
        {
          "title": "The Descent of the Sun",
          "duration": "09:19",
          "lyrics": null
        },
        {
          "title": "Pray for the End of Drought",
          "duration": "10:35",
          "lyrics": null
        },
        {
          "title": "Blood Moon Eclipse",
          "duration": "18:06",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://arrington.bandcamp.com/album/saturn-returns-2004",
      "title": "Saturn Returns (2004)",
      "artist": "Arrington de Dionyso and Thollem McDonas",
      "classification": "paid",
      "tags": [
        "Experimental",
        "Trance-punk",
        "bass clarinet",
        "free jazz",
        "freeform",
        "piano",
        "saxophone",
        "shamanic",
        "throatsinging",
        "Olympia"
      ],
      "item_id": 824963388,
      "datePublished": "23 Feb 2017 04:00:32 GMT",
      "about": "A lost recording rediscovered- Saturn Returns was recorded in June or July of 2004 at Gallery 1412 in Seattle, Washington, shortly after the 9th annual Olympia Experimental Music Festival. \n\n\n\nIt's really a special treat for me to be able to listen to this again after so long- Thollem and I have ended up collaborating on quite a few different projects over the years (please see TEN THOUSAND TIGERS, also available on this bandcamp account) and after all the permutations we've taken it's really exciting to find that some of our very first recordings together had that same wild intensity.",
      "credits": "released February 23, 2017\n            \n            Arrington de Dionyso - bass clarinet\n\nThollem McDonas- piano",
      "license": "some rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a1630030829_0",
      "trackinfo": [
        {
          "title": "Saturn Returns",
          "duration": "10:50",
          "lyrics": null
        },
        {
          "title": "Saturn Opposed Sun",
          "duration": "06:00",
          "lyrics": null
        },
        {
          "title": "In the Twelth House",
          "duration": "10:07",
          "lyrics": null
        },
        {
          "title": "Saturn Retrograde (Alto Saxophone Solo)",
          "duration": "14:15",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://arrington.bandcamp.com/album/trance-music-for-crows",
      "title": "Trance Music For Crows",
      "artist": "Trance Music For Crows",
      "classification": "paid",
      "tags": [
        "Experimental",
        "Olympia Death Metal",
        "Trance-punk",
        "bass clarinet",
        "dnb trance music drum and bass",
        "free jazz",
        "gamelan",
        "minimalist",
        "shamanic",
        "throatsinging",
        "trance",
        "Olympia"
      ],
      "item_id": 3388044770,
      "datePublished": "06 Mar 2018 00:00:00 GMT",
      "about": "recorded to ZOOM at Dub Narcotic Studio, Olympia Washington on February 27th 2018\n\nArrington de Dionyso- Tenor Saxophone, Voice, Amplifiers\n\nKofi Adjepong- bass guitar\n\nPatrick Semple- bass guitar\n\n\n\n\n\nmixed and mastered by Mark Buzard",
      "credits": "released March 6, 2018",
      "license": "some rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a3411385360_0",
      "trackinfo": [
        {
          "title": "Trance Music For Crows 2.27.2018",
          "duration": "37:44",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://arrington.bandcamp.com/album/return-to-satan-rock",
      "title": "Return to Satan Rock",
      "artist": "Arrington de Dionyso and Gust Burns",
      "classification": "paid",
      "tags": [
        "Experimental",
        "Trance-punk",
        "bass clarinet",
        "free jazz",
        "shamanic",
        "throatsinging",
        "Olympia"
      ],
      "item_id": 1300859066,
      "datePublished": "15 Jun 2016 00:00:00 GMT",
      "about": "Gust Burns and I have had an ongoing musical relationship since...2000? 2001? I don't even remember- \n\n\n\nbut we hadn't played together in almost five years until this recording made on June 8th 2016!\n\n\n\nRecorded at Gallery 1412 in Seattle- Gust Burns plays a grand piano, Arrington de Dionyso plays bass clarinet, baritone saxophone, and Balinese suling. \n\n\n\nThis is actually the very FIRST time I have recorded with my new baritone sax! So...enjoy that!",
      "credits": "released June 15, 2016",
      "license": "some rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a0314704268_0",
      "trackinfo": [
        {
          "title": "Return to Satan Rock",
          "duration": "39:30",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://arrington.bandcamp.com/album/lovers-and-dragons-2014",
      "title": "Lovers and Dragons (2014)",
      "artist": "Arrington de Dionyso with Gal Lazer Shiloach",
      "classification": "paid",
      "tags": [
        "Arrington de Dionyso",
        "Experimental",
        "Trance-punk",
        "bass clarinet",
        "contrabass",
        "free improvisation",
        "free jazz",
        "shamanic",
        "throatsinging",
        "Olympia"
      ],
      "item_id": 26373276,
      "datePublished": "04 Jan 2015 00:00:00 GMT",
      "about": "recorded at DUB NARCOTIC Olympia, August 2014\n\nYour download includes a PDF of the Lovers and Dragons BOOK of paintings by Arrington de Dionyso that came with the original tour-only CDR release.",
      "credits": "released January 4, 2015",
      "license": "some rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a1496219441_0",
      "trackinfo": [
        {
          "title": "Reog Doom",
          "duration": "03:01",
          "lyrics": null
        },
        {
          "title": "Kargyraa Raga",
          "duration": "07:10",
          "lyrics": null
        },
        {
          "title": "track 3",
          "duration": "02:17",
          "lyrics": null
        },
        {
          "title": "Contralto Clarinet  Raga",
          "duration": "08:37",
          "lyrics": null
        },
        {
          "title": "Arrington de Dionyso and Gal Shiloach - Danau Lindu",
          "duration": "04:00",
          "lyrics": null
        },
        {
          "title": "Second Vocal Raga",
          "duration": "08:06",
          "lyrics": null
        },
        {
          "title": "Barongan",
          "duration": "03:21",
          "lyrics": null
        },
        {
          "title": "Harp",
          "duration": "03:42",
          "lyrics": null
        },
        {
          "title": "Finale",
          "duration": "04:19",
          "lyrics": null
        },
        {
          "title": "BONUS track 1",
          "duration": "10:43",
          "lyrics": null
        },
        {
          "title": "Bonus Track 2",
          "duration": "04:45",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://arrington.bandcamp.com/album/aroma-kahayan",
      "title": "Aroma Kahayan",
      "artist": "Arrington de Dionyso and Theo Nugraha",
      "classification": "nyp",
      "tags": [
        "Borneo",
        "Experimental",
        "Indonesia",
        "Kalimantan",
        "Trance-punk",
        "bass clarinet",
        "free improvisation",
        "free jazz",
        "shamanic",
        "throatsinging",
        "Olympia"
      ],
      "item_id": 3590797509,
      "datePublished": "20 Oct 2017 03:00:23 GMT",
      "about": "Recorded in Palangkaraya, Kalimantan (Borneo) Indonesia in December 2015 with Theo Nugraha on homemade electronics and Arrington de Dionyso on bass clarinet, lalove, suling, and Alat Guntur (Bromiophone).",
      "credits": "released October 20, 2017",
      "license": "some rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a1757481658_0",
      "trackinfo": [
        {
          "title": "Aroma Kahayan",
          "duration": "31:38",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://arrington.bandcamp.com/album/unheard-indonesia-10-kolaborasi-sanggar-budaya-tunjung-nyaho",
      "title": "UNHEARD INDONESIA 10: Kolaborasi Sanggar Budaya Tunjung Nyaho",
      "artist": "Arrington de Dionyso",
      "classification": "nyp",
      "tags": [
        "Beat Indonesia",
        "Borneo",
        "Experimental",
        "Indonesia",
        "Kalimantan",
        "Palangkaraya",
        "Trance-punk",
        "bass clarinet",
        "free jazz",
        "shamanic",
        "throatsinging",
        "Olympia"
      ],
      "item_id": 1746238602,
      "datePublished": "20 Oct 2017 00:00:00 GMT",
      "about": "This album was recorded in December 2015 at Sanggar Seni dan Budaya Tunjung Nyaho, a cultural center for music and dance exploration in Palangkaraya, Kalimantan (Borneo, Indonesia) with Arrington de Dionyso collaborating with the students there on bass clarinet & bromiophone with traditional flutes and percussion instruments.",
      "credits": "released October 20, 2017",
      "license": "some rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a1471394134_0",
      "trackinfo": [
        {
          "title": "part one",
          "duration": "19:24",
          "lyrics": null
        },
        {
          "title": "part two",
          "duration": "34:57",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://arrington.bandcamp.com/album/unheard-indonesia-vol-6-jaranan-tung-dor",
      "title": "UNHEARD INDONESIA, vol. 6 Jaranan Tung Dor",
      "artist": "Arrington de Dionyso with Jaranan Tung Dor",
      "classification": "nyp",
      "tags": [
        "Experimental",
        "Indonesia",
        "Javanese",
        "Trance-punk",
        "bass clarinet",
        "free jazz",
        "jathilan",
        "kuda lumping",
        "shamanic",
        "throatsinging",
        "Olympia"
      ],
      "item_id": 556453538,
      "datePublished": "01 Apr 2014 00:00:00 GMT",
      "about": "WATCH THE VIDEO HERE-  www.youtube.com/watch?v=5nxU6sd8FoM\n\n Jaranan Tung Dor and Arrington de Dionyso- performing at Panitia Festival Prakarsa Rakyat in Mojowarno, Jombang, East Java, Indonesia on 18 November 2013. See also \"TRANCE MUSIC OF EAST JAVA\" at  arrington.bandcamp.com",
      "credits": "released April 1, 2014\n            \n            Arrington de Dionyso- bass clarinet and vocal\n\nwith the musicians of Jaranan Tung Dor\n\n\n\nrecorded November 2013, mastered by Shawn Parke",
      "license": "some rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a3518884549_0",
      "trackinfo": [
        {
          "title": "Jaranan Tung Dor part 1",
          "duration": "29:21",
          "lyrics": null
        },
        {
          "title": "Jaranan Tung Dor part 2",
          "duration": "38:14",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://arrington.bandcamp.com/album/unheard-indonesia-volume-4-singo-budoyo",
      "title": "UNHEARD INDONESIA VOLUME 4: Singo Budoyo",
      "artist": "Arrington de Dionyso and Singo Budoyo",
      "classification": "nyp",
      "tags": [
        "Experimental",
        "Indonesia",
        "Jaranan",
        "Jathilan",
        "Javanese",
        "Malaikat dan Singa",
        "Singo Budoyo",
        "Trance-punk",
        "bass clarinet",
        "free jazz",
        "shamanic",
        "throatsinging",
        "Olympia"
      ],
      "item_id": 1035013822,
      "datePublished": "20 Jan 2014 00:00:00 GMT",
      "about": "BONUS TRACKS ARE INCLUDED WHEN YOU MAKE A DONATION FOR DOWNLOAD! This is a concert recording from Arrington de Dionyso's collaboration with Singo Budoyo at Kamplung Cempluk, Malang, East Java Indonesia, November 2013. Very special thanks to Redy Eko Prastyo for his work in helping to organize these events, thank you to Tebo Aumbara for his dance performance that night!",
      "credits": "released January 20, 2014\n            \n            recorded by Arrington de Dionyso\n\nmixed and mastered by Nicholas Taplin",
      "license": "some rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a3533647384_0",
      "trackinfo": [
        {
          "title": "Arrington de Dionyso with Singo Budoyo - Singo Budoyo Part One",
          "duration": "44:14",
          "lyrics": null
        },
        {
          "title": "Singo Budoyo Part Two",
          "duration": "10:58",
          "lyrics": null
        },
        {
          "title": "Arrington de Dionyso with Mas Sutak's Group - Mas Sutak's Jaranan Group",
          "duration": "16:21",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://arrington.bandcamp.com/album/breath-of-fire-klp176",
      "title": "Breath of Fire (KLP176)",
      "artist": "Arrington de Dionyso",
      "classification": "paid",
      "tags": [
        "Experimental",
        "Trance-punk",
        "bass clarinet",
        "free jazz",
        "shamanic",
        "throatsinging",
        "Olympia"
      ],
      "item_id": 2936895024,
      "datePublished": "01 Jan 2006 00:00:00 GMT",
      "about": "Arrington de Dionyso is an energy conduit, driving through the territories held between surrealist automatism, shamanic séance, and the folk imagery of rock and roll. Breath of Fire is Arrington's first true solo album, and its sounds are hysterical, intellectual, magical, hilarious, sad, ecstatic and beautiful. \n\n\n\nWhile Arrington's work with Old Time Relijun has brought much in the way of both critical praise and notoriety for ecstatic-rock deconstructions and a frenzied performance on the edge of possession, Breath of Fire is a very different sort of beast. Recorded on Christmas Day in a nameless town in Southern Italy, the album uses voice, bass clarinet, and jaw harps to invoke the spirits in a mind-bending ritual of technical mastery and emotional freedom. Like field recordings from a lost continent, these short pieces conspire to present a completely mysterious sound universe, unlike anything you may have heard before. To be sure this voyage is not without its reference points- fans of Old Time Relijun's live performances have longtime been aware of Arrington's multiphonic vocal research, unearthing the missing links between Tuvan throat-singing and free improvisation. In Breath of Fire, this research is presented in its purest form- spontaneously, without overdubs or processing of any kind; an ethnography of intergalactic avant-primitive folk music, a dream diary without words, that enwraps in resonant sound. \n\n\n\nOld Time Relijun has released seven albums since 1995, building an ever-fanatic cult following in the USA, Canada, and Europe. Arrington de Dionyso tours constantly throughout the USA, Europe, and Israel giving performances and workshops on the voice in free improvised music",
      "credits": "released January 1, 2006",
      "license": "some rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a2552049034_0",
      "trackinfo": [
        {
          "title": "Emptyness and Void",
          "duration": "02:17",
          "lyrics": null
        },
        {
          "title": "Breath of Fire (Part One)",
          "duration": "01:32",
          "lyrics": null
        },
        {
          "title": "Solstice",
          "duration": "02:00",
          "lyrics": null
        },
        {
          "title": "Raining",
          "duration": "00:17",
          "lyrics": null
        },
        {
          "title": "Balam",
          "duration": "00:23",
          "lyrics": null
        },
        {
          "title": "Bird Shadow",
          "duration": "01:35",
          "lyrics": null
        },
        {
          "title": "Holotropic",
          "duration": "02:16",
          "lyrics": null
        },
        {
          "title": "Xibalba",
          "duration": "01:44",
          "lyrics": null
        },
        {
          "title": "Breath of Fire (Part Two)",
          "duration": "02:21",
          "lyrics": null
        },
        {
          "title": "Cacao Dance",
          "duration": "00:51",
          "lyrics": null
        },
        {
          "title": "White Fire On Black Fire",
          "duration": "05:17",
          "lyrics": null
        },
        {
          "title": "Khomuz 1 Rabbit Nutrient",
          "duration": "01:07",
          "lyrics": null
        },
        {
          "title": "Khomuz 2 Frog Nutrient",
          "duration": "01:33",
          "lyrics": null
        },
        {
          "title": "Khomuz Voice One",
          "duration": "00:45",
          "lyrics": null
        },
        {
          "title": "Khomuz Voice Two",
          "duration": "01:29",
          "lyrics": null
        },
        {
          "title": "Khomuz Voice Three",
          "duration": "01:17",
          "lyrics": null
        },
        {
          "title": "Khomuz 3 Winter",
          "duration": "01:23",
          "lyrics": null
        },
        {
          "title": "Khomuz 4 Traditional Variation",
          "duration": "01:34",
          "lyrics": null
        },
        {
          "title": "Tundra Moving Glacier",
          "duration": "04:42",
          "lyrics": null
        },
        {
          "title": "The Lion Lays Down With",
          "duration": "03:17",
          "lyrics": null
        },
        {
          "title": "Paper Fire Raven Baby",
          "duration": "02:33",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://arrington.bandcamp.com/album/varieties-of-religious-experience-klp149",
      "title": "Varieties of Religious Experience (KLP149)",
      "artist": "Arrington de Dionyso &amp; The Old Time Relijun",
      "classification": "nyp",
      "tags": [
        "Experimental",
        "Trance-punk",
        "bass clarinet",
        "free jazz",
        "shamanic",
        "throatsinging",
        "Olympia"
      ],
      "item_id": 779728574,
      "datePublished": "01 Jul 2003 00:00:00 GMT",
      "about": "Ever since Arrington de Dionyso cleared his throat and growled \"I ate a hole right through the mirror/ Spat out the shards, and I put it back together\" on the standout track \"Mirror\", his music has spoken to those lonely souls who have stared at themselves in the mirror and known that something lies on the other side, beyond their comprehension. The band Old Time Relijun formed in Olympia, Wash., in 1995 with bassist Aaron Hartman and drummer Bryce Panic, to take Arrington's four-track tapes that had been circulating and spooking people around Olympia, and to translate them into live performance. Since that time, the band has gone through various mutations, including a number of drummers (Phil Elvrum, currently of the Microphones, toured and recorded with Old time Relijun for several years after the departure of Bryce Panic), but the spirit of Arrington's musical explorations and creative expression have remained constant. \n\n\n\nUnlike most releases that attempt to summarize a band and an era, Varieties of Religious Experience is not a clear-the-vaults effort, and the multiple takes are not filler; nor is their inclusion the result of an unchecked ego, intoxicated by its own brilliance, unable to edit itself. It would be equally wrong to suggest that Arrington's four-track takes are \"originals\", the band's versions are \"alternates\", and one is necessarily better than the other. While four-track enabled Arrington to cram songs full of esoteric sounds and a sheer ear-popping lunacy that can turn two minutes into kaleidoscopic trips, Hartman and Panic helped loosen his grip on the drum sticks, change up the whack-a-mole tempos, and let a song's backbone slide. Calling the result Varieties of Religious Experience emphasizes Arrington's belief that it's all good - every song is its own spark of playful, in-the-moment creation, its own shard of experience - and the remarkable thing is that all is good on this CD.",
      "credits": "released July 1, 2003",
      "license": "some rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a3363866917_0",
      "trackinfo": [
        {
          "title": "Earthquake",
          "duration": "01:55",
          "lyrics": null
        },
        {
          "title": "Tyger",
          "duration": "02:16",
          "lyrics": null
        },
        {
          "title": "Manticore-Lion Tamer",
          "duration": "06:44",
          "lyrics": null
        },
        {
          "title": "Telephone Call",
          "duration": "04:21",
          "lyrics": null
        },
        {
          "title": "Casino",
          "duration": "02:11",
          "lyrics": null
        },
        {
          "title": "Telephone Call",
          "duration": "02:20",
          "lyrics": null
        },
        {
          "title": "Manticore",
          "duration": "02:35",
          "lyrics": null
        },
        {
          "title": "Lion Tamer",
          "duration": "02:06",
          "lyrics": null
        },
        {
          "title": "Siren",
          "duration": "03:53",
          "lyrics": null
        },
        {
          "title": "Siren",
          "duration": "02:14",
          "lyrics": null
        },
        {
          "title": "Mirror",
          "duration": "01:54",
          "lyrics": null
        },
        {
          "title": "Mirror",
          "duration": "01:31",
          "lyrics": null
        },
        {
          "title": "Creation Music",
          "duration": "02:40",
          "lyrics": null
        },
        {
          "title": "Happyland",
          "duration": "02:26",
          "lyrics": null
        },
        {
          "title": "Kettle",
          "duration": "01:21",
          "lyrics": null
        },
        {
          "title": "Trouble",
          "duration": "02:01",
          "lyrics": null
        },
        {
          "title": "Duo with Jacopo",
          "duration": "01:18",
          "lyrics": null
        },
        {
          "title": "Dry Bones Drum N Bass",
          "duration": "01:45",
          "lyrics": null
        },
        {
          "title": "Amphibian Factory",
          "duration": "01:41",
          "lyrics": null
        },
        {
          "title": "Snowstorm in Milano",
          "duration": "05:00",
          "lyrics": null
        },
        {
          "title": "Black Cat",
          "duration": "02:54",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://arrington.bandcamp.com/album/unheard-indonesia-volume-three-the-lalove-of-central-sulawesi",
      "title": "UNHEARD INDONESIA VOLUME THREE- The Lalove of Central Sulawesi",
      "artist": "Arrington de Dionyso",
      "classification": "nyp",
      "tags": [
        "Arrington de Dionyso",
        "Experimental",
        "Flutes",
        "Indonesia",
        "Lalove",
        "Sulawesi",
        "Trance-punk",
        "bamboos",
        "bass clarinet",
        "free jazz",
        "shamanic",
        "throatsinging",
        "Olympia"
      ],
      "item_id": 1755765252,
      "datePublished": "14 Feb 2014 00:00:00 GMT",
      "about": "These recordings were made late at night on the shore facing Lake Danau Lindu during the Sigi World Music Festival (November 2013). Prominently featured is the Lalove, the sacred bamboo flute of Central Sulawesi.",
      "credits": "released February 14, 2014\n            \n            recorded by Arrington de Dionyso using a ZOOM H1\n\nmastered by Nicholas Taplin",
      "license": "some rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a3178067889_0",
      "trackinfo": [
        {
          "title": "Lalove Solo",
          "duration": "03:12",
          "lyrics": null
        },
        {
          "title": "Lalove and Frog duo",
          "duration": "04:45",
          "lyrics": null
        },
        {
          "title": "Suaranya Nafas Kehidupan",
          "duration": "02:33",
          "lyrics": null
        },
        {
          "title": "Reading Phillip K. Dick in Central Sulawesi",
          "duration": "14:44",
          "lyrics": null
        },
        {
          "title": "Arrington de Dionyso, Anas, and Redy Eko Prastyo - Lalove, Voice, and Kalimantan Guitar",
          "duration": "11:29",
          "lyrics": null
        },
        {
          "title": "Arrington de Dionyso and Akbar - Lalove and Alat Guntur",
          "duration": "02:02",
          "lyrics": null
        },
        {
          "title": "Arrington de Dionyso and Akbar - Lalove and Alat Guntur 2",
          "duration": "07:13",
          "lyrics": null
        },
        {
          "title": "Arrington de Dionyso and Akbar - Lalove and Alat Guntur 3",
          "duration": "05:34",
          "lyrics": null
        },
        {
          "title": "Arrington de Dionyso and Anas - Lalove and Alat Guntur 4",
          "duration": "04:04",
          "lyrics": null
        },
        {
          "title": "Arrington de Dionyso, Anas, and Cium on guest vocal - Lalove, Alat Guntur and Voice 1",
          "duration": "03:41",
          "lyrics": null
        },
        {
          "title": "Arrington de Dionyso, Anas, and Cium - Lalove, Alat Guntur, and Voice 2",
          "duration": "04:51",
          "lyrics": null
        },
        {
          "title": "Insect Sounds in Central Sulawesi",
          "duration": "03:15",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://arrington.bandcamp.com/album/i-see-beyond-the-black-sun-klp200",
      "title": "I See Beyond The Black Sun (KLP200)",
      "artist": "Arrington de Dionyso",
      "classification": "paid",
      "tags": [
        "Experimental",
        "Trance-punk",
        "bass clarinet",
        "free jazz",
        "homemade instruments",
        "selfmade instruments",
        "shamanic",
        "throatsinging",
        "Olympia"
      ],
      "item_id": 1305760811,
      "datePublished": "01 Jan 2008 00:00:00 GMT",
      "about": "Light passes through a prism and fractures to create a rainbow effect; the color spectrum breaks off from every angle. It appears as if the colors divide themselves, but in reality they bleed in together – overlapping and mingling. It is within this closely inspected area of bleeding and mingling that Arrington de Dionyso creates his latest solo work I See Beyond the Black Sun [KLP200]. \n\n\n\nDe Dionyso explores tones in terms of specific individual sounds, much like each minute shift of color across the spectrum. Interchanging bass clarinet and throat-singing with homemade instruments used as vocal modifiers, I See Beyond the Black Sun is less the apocalyptic doom of his ramshackle post-punk group Old Time Relijun, but instead a raga influenced anthropological meditation. Locating the tones between tones and the overtones within overtones – seeing beyond the black sun. \n\n\n\nI See Beyond the Black Sun pushes de Dionyso's previous solo album Breath of Fire [KLP176] (2006) from a charcoal sketchbook into a Technicolor landscape with more clarity, shape and definition. The album is structured with two immense bookends \"AION\" and \"Pluto in Capricorn (I See Beyond the Black Sun).\" \"AION\" creates arhythmic drone that specifies the rules for movements of the melodies on the album in a convergent up and down scale – continuing to climb the color spectrum ever so slowly. The gradient shift is deceptively hidden before exploding into color on the parenthetical title track. \"Pluto in Capricorn (I See Beyond the Black Sun)\" – featuring a guest appearance by Old Time Relijun drummer Germaine Baca – is the culminating cathartic conclusion, a propulsive mythical beast that combines all the previous pieces into a new separate entity where sparks begin to rise. It is the crossing over and the release. \n\n\n\n\"This music winds like an infinite snake around the vine of a central note, probing hypnotically as Mr. de Dionyso … inexhaustibly exhales mandalas, spirals, unknowable cuneiforms and other beguiling shapes, while simultaneously driving the pulse and drone to advance, like a slow motion tsunami, towards a shocking climax of release … Crucial listening for those who want music and sound that reaches back into the center of your head.\" - Michael Gira, Angels of Light/Swans",
      "credits": "released January 1, 2008\n            \n            Lovingly recorded and mixed by Nicholas Taplin at the Silo in Portland, OR\n\n\n\nGermaine Baca plays drums on \"Pluto in Capricorn\"",
      "license": "some rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a1139353730_0",
      "trackinfo": [
        {
          "title": "All is On!",
          "duration": "01:36",
          "lyrics": null
        },
        {
          "title": "AION (Intuition And Science)",
          "duration": "16:53",
          "lyrics": null
        },
        {
          "title": "Imagination Ensnared",
          "duration": "02:23",
          "lyrics": null
        },
        {
          "title": "Into Gardens",
          "duration": "01:32",
          "lyrics": null
        },
        {
          "title": "Ten Thousand Year Vision",
          "duration": "02:49",
          "lyrics": null
        },
        {
          "title": "The Naked Future Part One",
          "duration": "01:05",
          "lyrics": null
        },
        {
          "title": "The Naked Future Part Two",
          "duration": "02:09",
          "lyrics": null
        },
        {
          "title": "Pluto in Capricorn",
          "duration": "11:32",
          "lyrics": null
        },
        {
          "title": "Les Grenouilles de Cherbourg",
          "duration": "18:53",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://arrington.bandcamp.com/album/unheard-indonesia-vol-7-pancak-silat-situbondo",
      "title": "UNHEARD INDONESIA Vol. 7 Pancak Silat Situbondo",
      "artist": "Arrington de Dionyso with Lima Jari Sakti Rasyit",
      "classification": "nyp",
      "tags": [
        "Experimental",
        "Indonesia",
        "Javanese",
        "Pancak Silat",
        "Trance-punk",
        "bass clarinet",
        "free jazz",
        "jathilan",
        "ritual",
        "shamanic",
        "throatsinging",
        "Olympia"
      ],
      "item_id": 3025660758,
      "datePublished": "23 Apr 2014 00:00:00 GMT",
      "about": "Recorded in November 2013 in Situbondo/Besuki East Java, Indonesia. The music in these recordings accompanied a festival of Pancak Silat, which is a form of Kung Fu as practiced in Java for many centuries. Part combat form and part dance performance, there is also an element of trance that is reinforced by the fast paced repetitive music. Of all of my experiences collaborating with traditional musicians in Indonesia, this was one of the most exhilarating!",
      "credits": "released April 23, 2014",
      "license": "some rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a2979453906_0",
      "trackinfo": [
        {
          "title": "Situbondo Part 1",
          "duration": "06:56",
          "lyrics": null
        },
        {
          "title": "Situbondo Part 2",
          "duration": "04:08",
          "lyrics": null
        },
        {
          "title": "Situbondo Part 3",
          "duration": "11:40",
          "lyrics": null
        },
        {
          "title": "Situbondo Part 4",
          "duration": "27:37",
          "lyrics": null
        },
        {
          "title": "Situbondo Part 5",
          "duration": "03:26",
          "lyrics": null
        },
        {
          "title": "Situbondo Part 6",
          "duration": "25:36",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://arrington.bandcamp.com/album/unheard-indonesia-vol-5-senyawa-with-arrington-de-dionyso-free-improvisation-in-yogyakarta",
      "title": "UNHEARD INDONESIA Vol. 5 SENYAWA with Arrington de Dionyso: Free Improvisation in Yogyakarta",
      "artist": "Arrington de Dionyso and SENYAWA",
      "classification": "nyp",
      "tags": [
        "Experimental",
        "Javanese",
        "Senyawa",
        "Trance-punk",
        "Yogyakarta",
        "bass clarinet",
        "free jazz",
        "handmade",
        "shamanic",
        "throatsinging",
        "Olympia"
      ],
      "item_id": 242836237,
      "datePublished": "16 Feb 2014 00:00:00 GMT",
      "about": "Recorded at Wukir's house in Yogyakarta in November 2014. \"Senyawa\" is Wukir and Rully, both based in Yogya but more and more they are touring the world. They've played in Australia, China, and much of Europe. I'm really hoping to get them to America some day. They're the best. \n\n\n\nOn these recordings Rully sings while Wukir plays a wide variety of his handmade sculptural instruments. Many of them are made from bamboo, strings, electronic pick-ups, found objects and farm equipment. I'm singing, playing the bass clarinet and the \"alat guntur\" which is a bass clarinet mouthpiece attached to various lengths of PVC tubing. \n\n\n\nRecorded and mixed by Joseph Lamont, mastered by Nicholas Taplin. \n\n\n\nPLEASE do yourself a favor and watch one of the countless videos on youtube of Senyawa's live performances! This documentary by Vincent Moon is an excellent introduction! \n\nvimeo.com/54891015\n\n\n\n There's also a great interview with them, conducted by Julian Bonequi, here-  www.auditionrecords.com/ar089.php",
      "credits": "released February 16, 2014",
      "license": "some rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a0038074434_0",
      "trackinfo": [
        {
          "title": "Improvisation 1",
          "duration": "08:01",
          "lyrics": null
        },
        {
          "title": "Improvisation 2",
          "duration": "06:49",
          "lyrics": null
        },
        {
          "title": "Improvisation 3",
          "duration": "04:53",
          "lyrics": null
        },
        {
          "title": "Improvisation 4",
          "duration": "10:38",
          "lyrics": null
        },
        {
          "title": "Improvisation 5",
          "duration": "04:43",
          "lyrics": null
        },
        {
          "title": "Improvisation 6",
          "duration": "08:58",
          "lyrics": null
        },
        {
          "title": "Improvisation 7",
          "duration": "05:25",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://arrington.bandcamp.com/album/the-book-of-angels",
      "title": "The Book of Angels",
      "artist": "Arrington de Dionyso with Graeme W. Smith",
      "classification": "paid",
      "tags": [
        "Experimental",
        "Shamanic",
        "Trance-punk",
        "bass clarinet",
        "free improvisation",
        "free jazz",
        "harp",
        "mantra",
        "shamanic",
        "throatsinging",
        "trance",
        "Olympia"
      ],
      "item_id": 4247058766,
      "datePublished": "03 Sep 2013 00:00:00 GMT",
      "about": "recorded on September 2nd 2013 at Dub Narcotic Studio in Olympia, Washington. \n\nArrington de Dionyso performs with voice, bass clarinet, marantz tape echo, echoplex. \n\nGraeme W. Smith performs on amplified full size classical pedal harp. \n\n\n\nrecorded using the Tascam 388, mixed to CD burner.",
      "credits": "released September 3, 2013\n            \n            artwork can be viewed in larger detail at  arringtondedionyso.tumblr.com\n\n The Book of Angels can be ordered at  www.arringtondedionyso.etsy.com",
      "license": "some rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a1368980365_0",
      "trackinfo": [
        {
          "title": "First Improvisation, voice and harp",
          "duration": "03:02",
          "lyrics": null
        },
        {
          "title": "Second Improvisation, harp and bass clarinet",
          "duration": "02:21",
          "lyrics": null
        },
        {
          "title": "Third Improvisation, voice and harp",
          "duration": "08:38",
          "lyrics": null
        },
        {
          "title": "Fourth Improvisation, voice and harp",
          "duration": "07:54",
          "lyrics": null
        },
        {
          "title": "Fifth Improvisation, things get intense",
          "duration": "14:28",
          "lyrics": null
        },
        {
          "title": "Sixth Improvisation, bass clarinet and harp",
          "duration": "09:54",
          "lyrics": null
        },
        {
          "title": "Seventh Improvisation, voice and harp",
          "duration": "04:38",
          "lyrics": null
        },
        {
          "title": "Eighth Improvisation, voice and harp",
          "duration": "06:03",
          "lyrics": null
        },
        {
          "title": "Ninth Improvisation, bass clarinet and harp",
          "duration": "08:04",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://arrington.bandcamp.com/album/unheard-indonesa-volume-two-lombok-island-improvisations",
      "title": "UNHEARD INDONESA VOLUME TWO: Lombok Island Improvisations",
      "artist": "Arrington de Dionyso, with Gombloh and Gamelan Gandrun Lombok",
      "classification": "nyp",
      "tags": [
        "Experimental",
        "Gamelan",
        "Indonesia",
        "Sasak",
        "Trance-punk",
        "bass clarinet",
        "free jazz",
        "shamanic",
        "throatsinging",
        "Olympia"
      ],
      "item_id": 2490959631,
      "datePublished": "01 Dec 2011 00:00:00 GMT",
      "about": "Recorded in September 2011 by Mantra in Mataram, Lombok Island, Indonesia. Arrington de Dionyso performs on the bass clarinet with traditional Sasak musician Gombloh playing preret, a double reeded instrument used in temple ceremonies. Also features two tracks of Arrington performing with a Sasak village Gamelan Gandrun. \n\n\n\nPLEASE LISTEN, DOWNLOAD, SHARE AS YOU LIKE. YOUR GENEROUS DONATION WILL HELP SUSTAIN DEVELOPMENT OF COLLABORATIONS SUCH AS THIS AND BENEFIT INDONESIAN MUSICIANS AS WELL.\n\n\n\nAlso! Enjoy footage from the original recording sessions! \n\nwww.youtube.com/watch?v=zIBnlx7AAiY\n\n  www.youtube.com/watch?v=uL4QYZ5hPLk",
      "credits": "released December 1, 2011",
      "license": "all rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a3334026220_0",
      "trackinfo": [
        {
          "title": "Arrington and Gombloh Take 1",
          "duration": "03:30",
          "lyrics": null
        },
        {
          "title": "Arrington de Dionyso and Gombloh - Arrington and Gombloh Take 2",
          "duration": "07:00",
          "lyrics": null
        },
        {
          "title": "Arrington and Gombloh Take 3",
          "duration": "08:39",
          "lyrics": null
        },
        {
          "title": "Arrington and Gombloh Take 5",
          "duration": "04:50",
          "lyrics": null
        },
        {
          "title": "Gamelan Gandrung",
          "duration": "07:58",
          "lyrics": null
        },
        {
          "title": "Gamelan Mandalika",
          "duration": "07:48",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://arrington.bandcamp.com/album/big-lung-samba-1993",
      "title": "Big Lung Samba (1993)",
      "artist": "Arrington de Dionyso",
      "classification": "paid",
      "tags": [
        "Arrington de Dionyso",
        "Experimental",
        "K Records",
        "Old Time Relijun",
        "Trance-punk",
        "bass clarinet",
        "free jazz",
        "shamanic",
        "throatsinging",
        "Olympia"
      ],
      "item_id": 3735084168,
      "datePublished": "09 Mar 1993 00:00:00 GMT",
      "about": "From the cassette archives of Arrington de Dionyso- recorded in Spokane and Olympia, Washington in 1992 and 1993 on a Tascam Porta One four track. Check out this interesting little interview at  www.doncampau.com/livingarchiveArringtonDeDionyso.htm\n\n ALL PROCEEDS FROM DOWNLOAD SALES WILL HELP FUND THE MALAIKAT DAN SINGA TOUR OF INDONESIA!",
      "credits": "released March 9, 1993\n            \n            Arrington de Dionyso plays everything on this album, except for Candyce Parks' background vocal on \"Do the Orangutan\".",
      "license": "all rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a3533285275_0",
      "trackinfo": [
        {
          "title": "Briar Patch",
          "duration": "03:12",
          "lyrics": "I said please, oh please, I beg of you, say whatever you do, please don't throw me into that Briar Patch!"
        },
        {
          "title": "Bumblebee/Peter Pumpkin Eater",
          "duration": "05:00",
          "lyrics": "Today we're having someone over for lunch, perhaps if the weather's nice, a picnic-"
        },
        {
          "title": "You're Driving Me Crazy and I Can't Get Away",
          "duration": "02:36",
          "lyrics": null
        },
        {
          "title": "Splashing in the Puddles",
          "duration": "02:03",
          "lyrics": null
        },
        {
          "title": "Big Lung Samba",
          "duration": "03:37",
          "lyrics": null
        },
        {
          "title": "Toy Shop Lock",
          "duration": "02:39",
          "lyrics": null
        },
        {
          "title": "A Clarinet Quartet",
          "duration": "00:31",
          "lyrics": null
        },
        {
          "title": "Blackberry Bramble",
          "duration": "02:08",
          "lyrics": "I'm going down there by the river, down to the river to my blackberry bramble- I'm pickin' em today so tomorrow when I see the sunrise, for breakfast I'll have myself some blackberry pie, all ready for me, hot from the oven, it's so good!"
        },
        {
          "title": "Fleas in My Fur",
          "duration": "02:48",
          "lyrics": null
        },
        {
          "title": "Paprika",
          "duration": "00:33",
          "lyrics": "Do you have any cheese? We are out of all the cheeses. I have found some. Do you have any lazers? Bing! Bong! Proom! Doom! That will not do as a lazer..."
        },
        {
          "title": "Celery",
          "duration": "02:01",
          "lyrics": null
        },
        {
          "title": "Swarm",
          "duration": "02:02",
          "lyrics": null
        },
        {
          "title": "The Creature at the Bottom of the Sink",
          "duration": "02:05",
          "lyrics": null
        },
        {
          "title": "Hey Daddy",
          "duration": "03:13",
          "lyrics": null
        },
        {
          "title": "Do the Orangutan!",
          "duration": "03:20",
          "lyrics": null
        },
        {
          "title": "bass solo/Cookies",
          "duration": "03:59",
          "lyrics": null
        },
        {
          "title": "See More and Close Your Eyes",
          "duration": "02:26",
          "lyrics": null
        },
        {
          "title": "Chanticleer",
          "duration": "02:03",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://arrington.bandcamp.com/album/malaikat-dan-singa-rehearsal-tapes",
      "title": "Malaikat dan Singa rehearsal tapes",
      "artist": "Arrington de Dionyso&#39;s Malaikat dan Singa",
      "classification": "nyp",
      "tags": [
        "Arrington de Dionyso",
        "Experimental",
        "Malaikat dan Singa",
        "Trance-punk",
        "bass clarinet",
        "free jazz",
        "shamanic",
        "throatsinging",
        "trance punk",
        "Olympia"
      ],
      "item_id": 3933525168,
      "datePublished": "03 Jun 2012 00:00:00 GMT",
      "about": "These are recordings intended for the private use of Malaikat dan Singa bandmembers in advance of our recording session for a new album starting June 14. I don't particularly mind if anyone else wants to listen to it, but...yeah, these are just rehearsal tapes pretty much.",
      "credits": "released June 3, 2012",
      "license": "some rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a4187070968_0",
      "trackinfo": [
        {
          "title": "nasty yawp",
          "duration": "04:28",
          "lyrics": null
        },
        {
          "title": "rehearsal vrsn of \"Baru Limunan\" 2012",
          "duration": "02:04",
          "lyrics": null
        },
        {
          "title": "Jesus Christ Satanstar (intro)",
          "duration": "00:55",
          "lyrics": null
        },
        {
          "title": "Jesus Christ Satanstar part 2",
          "duration": "01:51",
          "lyrics": null
        },
        {
          "title": "Jesus Christ Satanstar part 3",
          "duration": "02:01",
          "lyrics": null
        },
        {
          "title": "Susu Naga Harmonic Slowdown",
          "duration": "03:50",
          "lyrics": null
        },
        {
          "title": "Backwards Sleng Teng Riddim",
          "duration": "05:01",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://arrington.bandcamp.com/album/snowstorm-ragas",
      "title": "Snowstorm Ragas",
      "artist": "Arrington de Dionyso and Ravi Padmanabha",
      "classification": "paid",
      "tags": [
        "Experimental",
        "Trance-punk",
        "bass clarinet",
        "free jazz",
        "improvisation",
        "khoomei",
        "raga",
        "shamanic",
        "throatsinging",
        "Olympia"
      ],
      "item_id": 3134844272,
      "datePublished": "11 Mar 2013 00:00:00 GMT",
      "about": "Recorded in Buffalo NY on February 2nd 2013- we were nearly trapped by snow- three short cosmic raga-influenced improvisations with tabla, percussions, throatsinging voice, and the Bromiophone, a PVC contrabass clarinet with dual resonators invented by Arrington.",
      "credits": "released March 11, 2013",
      "license": "some rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a1515324357_0",
      "trackinfo": [
        {
          "title": "Ravi Padmanabha and Arrington de Dionyso - Tabla and Bromiophone Improvisation",
          "duration": "17:20",
          "lyrics": null
        },
        {
          "title": "Throatsinging and Tabla",
          "duration": "10:00",
          "lyrics": null
        },
        {
          "title": "Arrington de Dionyso and Ravi Padmanabha - Voice and Bowed Percussion",
          "duration": "06:51",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://arrington.bandcamp.com/album/the-true-folk-sounds-of-arrington-de-dionyso",
      "title": "The True Folk Sounds of Arrington de Dionyso",
      "artist": "Arrington de Dionyso",
      "classification": "paid",
      "tags": [
        "Experimental",
        "Trance-punk",
        "arrington de dionyso",
        "bass clarinet",
        "dada",
        "free jazz",
        "improvisation",
        "shamanic",
        "sound poetry",
        "surrealism",
        "throatsinging",
        "Olympia"
      ],
      "item_id": 1474211714,
      "datePublished": "13 Jan 2006 00:00:00 GMT",
      "about": null,
      "credits": "released January 13, 2006\n            \n            recorded by Nicholas Taplin in 2006 or 2007, I don't remember exactly when...",
      "license": "all rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a3099751549_0",
      "trackinfo": [
        {
          "title": "The True Folk Sounds...1",
          "duration": "10:04",
          "lyrics": null
        },
        {
          "title": "The True Folk Sounds...2",
          "duration": "02:14",
          "lyrics": null
        },
        {
          "title": "The True Folk Sounds...3",
          "duration": "01:34",
          "lyrics": null
        },
        {
          "title": "The True Folk Sounds...4",
          "duration": "01:43",
          "lyrics": null
        },
        {
          "title": "The True Folk Sounds...5",
          "duration": "01:18",
          "lyrics": null
        },
        {
          "title": "The True Folk Sounds...6",
          "duration": "02:25",
          "lyrics": null
        },
        {
          "title": "The True Folk Sounds...7",
          "duration": "03:50",
          "lyrics": null
        },
        {
          "title": "The True Folk Sounds...8",
          "duration": "02:09",
          "lyrics": null
        },
        {
          "title": "The True Folk Sounds...9",
          "duration": "01:10",
          "lyrics": null
        },
        {
          "title": "The True Folk Sounds...10",
          "duration": "00:35",
          "lyrics": null
        },
        {
          "title": "The True Folk Sounds...11",
          "duration": "00:50",
          "lyrics": null
        },
        {
          "title": "The True Folk Sounds...13",
          "duration": "02:01",
          "lyrics": null
        },
        {
          "title": "The True Folk Sounds...12",
          "duration": "01:17",
          "lyrics": null
        },
        {
          "title": "The True Folk Sounds...14",
          "duration": "01:55",
          "lyrics": null
        },
        {
          "title": "Late Night Raga",
          "duration": "05:52",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://arrington.bandcamp.com/album/trance-punk-manifesto-vol-ii-lathe-cuts-november-11-2011",
      "title": "Trance Punk Manifesto Vol. II - Lathe Cuts November 11 2011",
      "artist": "Arrington de Dionyso&#39;s Malaikat dan Singa",
      "classification": "nyp",
      "tags": [
        "Experimental",
        "Trance-punk",
        "bass clarinet",
        "free jazz",
        "shamanic",
        "throatsinging",
        "Olympia"
      ],
      "item_id": 1677174202,
      "datePublished": "11 Nov 2011 00:00:00 GMT",
      "about": "Most of these tracks recorded on November 11, 2011, with Angelo Spencer and Ben Kapp. Some tracks are Arrington only. Recorded in Olympia directly to plastic plates with a 1940's era record lathe.",
      "credits": "released November 11, 2011",
      "license": "some rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a2802732529_0",
      "trackinfo": [
        {
          "title": "Arrington de Dionyso's Malaikat dan Singa - Shaman Rock part one",
          "duration": "05:06",
          "lyrics": null
        },
        {
          "title": "Uyuyuyao",
          "duration": "03:12",
          "lyrics": null
        },
        {
          "title": "Shaman Rock part two",
          "duration": "03:03",
          "lyrics": null
        },
        {
          "title": "Shenai Locked Groove",
          "duration": "00:44",
          "lyrics": null
        },
        {
          "title": "Shaman Rock part three",
          "duration": "04:50",
          "lyrics": null
        },
        {
          "title": "Warbler Locked Groove",
          "duration": "00:46",
          "lyrics": null
        },
        {
          "title": "Magical Realism",
          "duration": "04:19",
          "lyrics": null
        },
        {
          "title": "Sahel Gangsta",
          "duration": "04:31",
          "lyrics": null
        },
        {
          "title": "Spirit Talking Locked Groove",
          "duration": "00:50",
          "lyrics": null
        },
        {
          "title": "Throatsinging Echo Echo",
          "duration": "01:55",
          "lyrics": null
        },
        {
          "title": "Trance Punk Manifesto Echoplex Voice",
          "duration": "02:21",
          "lyrics": null
        },
        {
          "title": "Trance Punk Groove Locked Groove Groove",
          "duration": "02:17",
          "lyrics": null
        },
        {
          "title": "Thanksgiving Celebration!",
          "duration": "01:53",
          "lyrics": null
        },
        {
          "title": "Trance Punk Manifesto Bass Clarinet version",
          "duration": "05:19",
          "lyrics": null
        },
        {
          "title": "Trance Punk Hardcore",
          "duration": "01:22",
          "lyrics": null
        },
        {
          "title": "Halilintar Lathe Cut (Original)",
          "duration": "03:09",
          "lyrics": null
        },
        {
          "title": "Holotropic Vocal Bonus Track",
          "duration": "01:32",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://arrington.bandcamp.com/album/slow-dancin-under-the-moon-tonight",
      "title": "Slow Dancin&#39; Under the Moon Tonight",
      "artist": "Arrington de Dionyso",
      "classification": "paid",
      "tags": [
        "Experimental",
        "Indonesian",
        "Trance-punk",
        "bass clarinet",
        "free jazz",
        "malaikat dan singa",
        "shamanic",
        "throatsinging",
        "Olympia"
      ],
      "item_id": 1956793793,
      "datePublished": "04 Jul 2011 00:00:00 GMT",
      "about": "This album was recorded sometime in 2010 using \"Songsmith\" software. It is one of the most unlistenable and abrasively grating albums ever made by Arrington de Dionyso. ALL FUNDS GENERATED FROM DOWNLOAD SALES WILL ASSIST IN SUPPORTING THE MALAIKAT DAN SINGA TOUR OF JAVA AND BALI, INDONESIA in October 2011.",
      "credits": "released July 4, 2011",
      "license": "all rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a3013304031_0",
      "trackinfo": [
        {
          "title": "Mani Malaikat (Synth Pop Version!)",
          "duration": "02:06",
          "lyrics": "\"Saya sangat adalah singa, yang melahap sayap malaikat, yang minum darah naga, darah naga bentuk dari binatang melata....etc\""
        },
        {
          "title": "Arrington de Dionyso (w/Angelo Spencer) - Twist Twist Twist",
          "duration": "00:54",
          "lyrics": "twist twist twist twist twist"
        },
        {
          "title": "Feelin' Good!",
          "duration": "01:41",
          "lyrics": "instrumental"
        },
        {
          "title": "A Little Dance in her Walk!",
          "duration": "00:56",
          "lyrics": null
        },
        {
          "title": "Hittin' the Disco Tonite!",
          "duration": "01:13",
          "lyrics": null
        },
        {
          "title": "Mani Putih Ular",
          "duration": "00:53",
          "lyrics": "Mani putih seperti halimun"
        },
        {
          "title": "Segala Binasa",
          "duration": "00:58",
          "lyrics": "segala hancur binasa...\nsaya menghutani dari mulut..."
        },
        {
          "title": "Api Putih Api Hitam",
          "duration": "01:10",
          "lyrics": "Api putih api hitam kita memamah daging melalui malam\nmenatap menatap saya memburu baru limunan"
        },
        {
          "title": "Bibirmu yang Bisikan Manis",
          "duration": "01:26",
          "lyrics": null
        },
        {
          "title": "What Lovely Lips!",
          "duration": "01:24",
          "lyrics": null
        },
        {
          "title": "Oh Wah Oh Wah",
          "duration": "01:12",
          "lyrics": null
        },
        {
          "title": "Summer of Kissin'",
          "duration": "01:03",
          "lyrics": null
        },
        {
          "title": "Jiwa Tulang Disco Version",
          "duration": "00:57",
          "lyrics": null
        },
        {
          "title": "Swingin' Shuffle!",
          "duration": "00:29",
          "lyrics": null
        },
        {
          "title": "Oh Yeaaaaah!",
          "duration": "00:47",
          "lyrics": null
        },
        {
          "title": "Serigala Surgawi",
          "duration": "01:24",
          "lyrics": null
        },
        {
          "title": "Rasu Rohani",
          "duration": "00:54",
          "lyrics": null
        },
        {
          "title": "Tak Terbatas New Romance Slowdance Version",
          "duration": "04:14",
          "lyrics": "Ciptaan tanah menahan, membawa kunci seribu\nkuat dan harum, nama bersembunyi\nEngkau menciptaan kegalapan dan cahaya\nmelebur kirikanan...."
        }
      ]
    },
    {
      "url": "https://arrington.bandcamp.com/album/unheard-indonesia-vol-i-the-trance-music-of-east-java",
      "title": "UNHEARD INDONESIA VOL. I: The Trance Music of East Java",
      "artist": "Arrington de Dionyso with Jaran Kepang Jawa",
      "classification": "nyp",
      "tags": [
        "Experimental",
        "Indonesia",
        "Java",
        "Trance-punk",
        "bass clarinet",
        "experimental",
        "free jazz",
        "improvised music",
        "jaran kepang",
        "kuda lumping",
        "shamanic",
        "throatsinging",
        "world",
        "Olympia"
      ],
      "item_id": 3720417778,
      "datePublished": "29 Nov 2011 00:00:00 GMT",
      "about": "Arrington de Dionyso performs on the bass clarinet with Javanese Trance Music Ensembles in Malang and Mojokoerto in October 2011. Guyob Rukun Jaranan Malang, Jaran Kepang Sutak, Turonggo Joyo Mulyo and Jaran Kepang Timbul Aji Jubah are featured on these recordings. Live recordings by Woto Wibowo, studio recordings by Redy Eko Prastyo.\n\nPLEASE LISTEN AND PAY ANY AMOUNT YOU LIKE FOR DOWNLOAD TO SHARE THIS MUSIC. YOUR GENEROUS DONATIONS WILL HELP SUSTAIN PROJECTS SUCH AS THIS IN THE FUTURE.\n\n\n\nAlso- see footage from the original concerts! \n\nwww.youtube.com/watch?v=Qz8Vq-i7rbs\n\n  www.youtube.com/watch?v=JSTq9uE1Vpo\n\n  www.youtube.com/watch?v=08yafwUgDCw\n\n  www.youtube.com/watch?v=9c10r0eQ8b0",
      "credits": "released November 29, 2011",
      "license": "Some rights reserved. Please refer to individual track pages for license info.",
      "coverUrl_0": "https://f4.bcbits.com/img/a0795960409_0",
      "trackinfo": [
        {
          "title": "Arrington de Dionyso and Mr. Sutak's Group - Malang",
          "duration": "23:29",
          "lyrics": null
        },
        {
          "title": "Arrington de Dionyso with Jaran Kepang Timbul Aji Jubah - Mojokoerto",
          "duration": "10:49",
          "lyrics": null
        },
        {
          "title": "Arrington de Dionyso with Turonggo Joyo Mulyo - Studio Session Malang 1",
          "duration": "09:10",
          "lyrics": null
        },
        {
          "title": "Arrington de Dionyso with Turonggo Joyo Mulyo - Studio Session Malang 2",
          "duration": "07:53",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://arrington.bandcamp.com/album/songs-of-psychic-fire-vol-i",
      "title": "Songs of Psychic Fire vol. I",
      "artist": "Arrington de Dionyso and Thollem McDonas",
      "classification": "nyp",
      "tags": [
        "Experimental",
        "Trance-punk",
        "bass clarinet",
        "experimental",
        "free jazz",
        "improvisation",
        "minimalism",
        "piano",
        "shamanic",
        "spectral",
        "throatsinging",
        "Olympia"
      ],
      "item_id": 2639669908,
      "datePublished": "11 Sep 2011 00:00:00 GMT",
      "about": "a series of short, minimalistic duos between bass clarinet and piano, recorded to a 1940's era Wilcox Gay record lathe. This is \"post-improvised\" music, i.e. these pieces are free improvisations in the sense that players are free to make any choices desired, however the choice in most of these pieces is improvise within a very narrow bandwidth of sound color, emphasizing attack, decay, and the repetition of short interlocking phrases rather than linear melodic or rhythmic development.",
      "credits": "released September 11, 2011\n            \n            Recorded to blue plastic plates using a Wilcox Gay record lathe from the 1940's, on August 9th and 10th 2011 at Le Chateau Circular Ruins in Olympia, Washington.",
      "license": "all rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a0792505420_0",
      "trackinfo": [
        {
          "title": "Arrington de Dionyso and Thollem McDonas - Lathe Cut 1",
          "duration": "02:45",
          "lyrics": null
        },
        {
          "title": "Lathe Cut 2",
          "duration": "02:05",
          "lyrics": null
        },
        {
          "title": "Lathe Cut 3",
          "duration": "01:25",
          "lyrics": null
        },
        {
          "title": "Lathe Cut 4",
          "duration": "01:14",
          "lyrics": null
        },
        {
          "title": "Lathe Cut 5",
          "duration": "01:36",
          "lyrics": null
        },
        {
          "title": "Lathe Cut 6",
          "duration": "02:29",
          "lyrics": null
        },
        {
          "title": "Lathe Cut 7",
          "duration": "01:52",
          "lyrics": null
        },
        {
          "title": "Lathe Cut 8",
          "duration": "01:36",
          "lyrics": null
        },
        {
          "title": "Lathe Cut 9",
          "duration": "02:04",
          "lyrics": null
        },
        {
          "title": "Lathe Cut 10",
          "duration": "01:37",
          "lyrics": null
        },
        {
          "title": "Lathe Cut 11",
          "duration": "01:43",
          "lyrics": null
        },
        {
          "title": "Lathe Cut 12",
          "duration": "01:43",
          "lyrics": null
        },
        {
          "title": "Lathe Cut 13",
          "duration": "03:08",
          "lyrics": null
        },
        {
          "title": "Lathe Cut 14",
          "duration": "01:37",
          "lyrics": null
        },
        {
          "title": "Lathe Cut 15",
          "duration": "00:40",
          "lyrics": null
        },
        {
          "title": "Lathe Cut 16",
          "duration": "02:38",
          "lyrics": null
        },
        {
          "title": "Lathe Cut 17",
          "duration": "00:49",
          "lyrics": null
        },
        {
          "title": "Lathe Cut 18",
          "duration": "00:55",
          "lyrics": null
        },
        {
          "title": "Lathe Cut 19",
          "duration": "04:02",
          "lyrics": null
        },
        {
          "title": "Lathe Cut 20",
          "duration": "00:57",
          "lyrics": null
        },
        {
          "title": "Totally Sick Throatsinging Lathe Cut",
          "duration": "01:44",
          "lyrics": null
        },
        {
          "title": "Arrington de Dionyso's Malaikat dan Singa - Kerasukan Dub Plate VERSION",
          "duration": "03:32",
          "lyrics": "Tabrakan dari visi dan suara, mengalir itu dari muara, melebur kirikanan, saya pasang surut, saya mengutani dari mulut, kebinalan dari bianglala batin, kemuluran dari dewa kelamin...."
        }
      ]
    },
    {
      "url": "https://arrington.bandcamp.com/album/trans-utopian-gangsta-lathe-cuts",
      "title": "Trans-Utopian Gangsta Lathe Cuts",
      "artist": "Arrington de Dionyso/ONEIDA/The Lights",
      "classification": "nyp",
      "tags": [
        "Experimental",
        "Old Time Relijun",
        "Oneida",
        "The Lights",
        "Trance-punk",
        "arrington de dionyso",
        "bass clarinet",
        "free jazz",
        "lathe",
        "lofi",
        "psychedelic",
        "shamanic",
        "throat singing",
        "throatsinging",
        "Olympia"
      ],
      "item_id": 1869292371,
      "datePublished": "22 Aug 2011 00:00:00 GMT",
      "about": "After playing a show together at Olympia's CAPITOL THEATER, Arrington de Dionyso's Malaikat dan Singa, ONEIDA, and The Lights entered the cave of Dub Narcotic Studio around 2AM on August 21st 2010 and proceeded to record about thirty sides of short improvised sound prisms to plastic plates using Arrington de Dionyso's 1940's era record lathe. Now you get to listen to the results yourself. Please consider leaving a donation if you enjoy what you hear. For more information about the physical lathe cut records themselves, please contact  arringtond@gmail.com  . THANK YOU!",
      "credits": "released August 22, 2011\n            \n            members of ONEIDA and The LIGHTS- guitars, keyboards, drums, etc\n\nArrington de Dionyso- contralto clarinet, voice, echoplex, record lathe",
      "license": "all rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a3805915267_0",
      "trackinfo": [
        {
          "title": "Arrington de Dionyso with ONEIDA and THE LIGHTS - Trans-Utopian Gangsta",
          "duration": "04:23",
          "lyrics": null
        },
        {
          "title": "The Blinding Lights",
          "duration": "03:38",
          "lyrics": null
        },
        {
          "title": "Smoke Like Briars",
          "duration": "01:55",
          "lyrics": null
        },
        {
          "title": "Briars Locked Groove",
          "duration": "01:16",
          "lyrics": null
        },
        {
          "title": "Interstellar Locked Groove",
          "duration": "00:38",
          "lyrics": null
        },
        {
          "title": "Prismatic Meditations",
          "duration": "05:18",
          "lyrics": null
        },
        {
          "title": "House of Mirrors",
          "duration": "02:32",
          "lyrics": null
        },
        {
          "title": "ooh ooh Ah Locked Groove",
          "duration": "01:42",
          "lyrics": null
        },
        {
          "title": "ooh ooh Ah Overdrive",
          "duration": "01:43",
          "lyrics": null
        },
        {
          "title": "Genetic Memory",
          "duration": "03:41",
          "lyrics": null
        },
        {
          "title": "Deep Gangsta Shit",
          "duration": "00:44",
          "lyrics": null
        },
        {
          "title": "The New Sensuality",
          "duration": "03:42",
          "lyrics": null
        },
        {
          "title": "Kargyraa Loop",
          "duration": "00:39",
          "lyrics": null
        },
        {
          "title": "Ayayayayayah",
          "duration": "01:11",
          "lyrics": null
        },
        {
          "title": "Ayayayayayayayah!",
          "duration": "01:06",
          "lyrics": null
        },
        {
          "title": "Eh He Ayayayayah",
          "duration": "01:17",
          "lyrics": null
        },
        {
          "title": "Eh He Eh He Eh Oh",
          "duration": "01:06",
          "lyrics": null
        },
        {
          "title": "Eieh Eieh",
          "duration": "00:35",
          "lyrics": null
        },
        {
          "title": "Microtonal Degradation of Eieh Eieh",
          "duration": "01:30",
          "lyrics": null
        },
        {
          "title": "Awring Memewahring",
          "duration": "01:29",
          "lyrics": null
        },
        {
          "title": "Kargyraa Holotropic Loop",
          "duration": "01:59",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://arrington.bandcamp.com/album/trance-punk-manifestos-vol-iii",
      "title": "Trance Punk Manifestos Vol. III",
      "artist": "Arrington de Dionyso&#39;s Malaikat dan Singa",
      "classification": "paid",
      "tags": [
        "Experimental",
        "Indonesia",
        "Trance-punk",
        "avant garde",
        "bass clarinet",
        "cumbia",
        "free jazz",
        "fucked up",
        "improvisation",
        "shamanic",
        "throatsinging",
        "trance punk",
        "Olympia"
      ],
      "item_id": 121497273,
      "datePublished": "23 Feb 2012 00:00:00 GMT",
      "about": "Birthday Party 2012! Recorded on the Wilcox-Gay record lathe directly to plastic plates on January 4th, 2012.",
      "credits": "released February 23, 2012\n            \n            Features guests Angelo Spencer, Ben Kapp, Markly Morrison, and Ricky.",
      "license": "some rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a0230877041_0",
      "trackinfo": [
        {
          "title": "Shaman Rock and Rolling Thunder",
          "duration": "04:18",
          "lyrics": null
        },
        {
          "title": "Sick Shenai Solo with locked groove",
          "duration": "03:10",
          "lyrics": null
        },
        {
          "title": "Trance Punk Disaster",
          "duration": "03:24",
          "lyrics": null
        },
        {
          "title": "x",
          "duration": "00:31",
          "lyrics": null
        },
        {
          "title": "Raven Voiced Drum Poem",
          "duration": "01:40",
          "lyrics": null
        },
        {
          "title": "Trance Punk Possession",
          "duration": "03:37",
          "lyrics": null
        },
        {
          "title": "Malaikat dan Cumbia vsrsn",
          "duration": "02:36",
          "lyrics": null
        },
        {
          "title": "Malaikat dan Cumbia XYXYZYZ",
          "duration": "02:41",
          "lyrics": null
        },
        {
          "title": "niu",
          "duration": "00:24",
          "lyrics": null
        },
        {
          "title": "Shaman Rock Dubfire",
          "duration": "03:25",
          "lyrics": null
        },
        {
          "title": "brrg",
          "duration": "01:59",
          "lyrics": null
        },
        {
          "title": "mnmn",
          "duration": "02:55",
          "lyrics": null
        },
        {
          "title": "Malaikat dan Cumbia Enferma",
          "duration": "03:14",
          "lyrics": null
        },
        {
          "title": "Malaikat dan Cumbia -NERUDA NOISE",
          "duration": "02:28",
          "lyrics": null
        },
        {
          "title": "Trance Punk Hypnosis Lathe Cut",
          "duration": "04:13",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://arrington.bandcamp.com/album/low-clarinet-symposium-august-2008",
      "title": "Low Clarinet Symposium (August 2008)",
      "artist": "Arrington de Dionyso, Paul Hoskin, Doug Haning, Jonathan Sielaff, Mark Kaylor",
      "classification": "paid",
      "tags": [
        "Experimental",
        "Trance-punk",
        "bass clarinet",
        "free jazz",
        "shamanic",
        "throatsinging",
        "Olympia"
      ],
      "item_id": 2472188250,
      "datePublished": "06 Sep 2012 00:00:00 GMT",
      "about": null,
      "credits": "released September 6, 2012",
      "license": "some rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a3136868618_0",
      "trackinfo": [
        {
          "title": "Arrington de Dionyso, Paul Hoskin, Doug Haning, Jonathan Sielaff, Mark Kaylor - Quintet Improvisation with Paul Hoskin, Arrington de Dionyso, Jonathan Sielaff, Doug Haning, and Mark Kaylor",
          "duration": "32:51",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://arrington.bandcamp.com/album/songs-of-psychic-fire-vol-4",
      "title": "Songs of Psychic Fire Vol. 4",
      "artist": "Arrington de Dionyso and China Star",
      "classification": "nyp",
      "tags": [
        "Experimental",
        "Trance-punk",
        "bass clarinet",
        "free jazz",
        "shamanic",
        "throatsinging",
        "Olympia"
      ],
      "item_id": 2838040151,
      "datePublished": "05 Jul 2012 00:00:00 GMT",
      "about": "Songs of Psychic Fire Vol. 4 was recorded in June 2012 and is part of the \"Songs of Psychic Fire\" quarterly series, intended to be released 3-4 times a year, featuring voices, tape manipulations, and various instruments played by Arrington and selected collaborators.",
      "credits": "released July 5, 2012",
      "license": "some rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a1423423865_0",
      "trackinfo": [
        {
          "title": "A Thousand Eyes",
          "duration": "03:41",
          "lyrics": null
        },
        {
          "title": "Dragon Mask",
          "duration": "05:13",
          "lyrics": null
        },
        {
          "title": "The Bird is Back",
          "duration": "02:55",
          "lyrics": null
        },
        {
          "title": "Trance Scribe Part 1",
          "duration": "01:33",
          "lyrics": null
        },
        {
          "title": "Trance Scribe Part Two",
          "duration": "00:53",
          "lyrics": null
        },
        {
          "title": "Trance Scribe Part Four",
          "duration": "01:02",
          "lyrics": null
        },
        {
          "title": "Trance Scribe Part Five",
          "duration": "03:43",
          "lyrics": null
        },
        {
          "title": "Trance Scribe Part Six",
          "duration": "04:38",
          "lyrics": null
        },
        {
          "title": "La Isola",
          "duration": "02:07",
          "lyrics": null
        },
        {
          "title": "The Rainbow Fire",
          "duration": "03:00",
          "lyrics": null
        },
        {
          "title": "Oracle",
          "duration": "08:34",
          "lyrics": null
        },
        {
          "title": "The Mist Increasing",
          "duration": "04:49",
          "lyrics": null
        },
        {
          "title": "BONUS TRACK oooaaa",
          "duration": "00:41",
          "lyrics": null
        },
        {
          "title": "BONUS Trance Scribe Lathe Cut 1",
          "duration": "01:31",
          "lyrics": null
        },
        {
          "title": "BONUS Trance Scribe Lathe Cut 2",
          "duration": "01:09",
          "lyrics": null
        },
        {
          "title": "BONUS Trance Scribe Lathe Cut Wicked Locked Groove",
          "duration": "08:47",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://arrington.bandcamp.com/album/ten-thousand-tigers",
      "title": "Ten Thousand Tigers",
      "artist": "Arrington de Dionyso and Thollem McDonas",
      "classification": "paid",
      "tags": [
        "Experimental",
        "Trance-punk",
        "bass clarinet",
        "contemporary classical",
        "free jazz",
        "improvisation",
        "new music",
        "shamanic",
        "throatsinging",
        "Olympia"
      ],
      "item_id": 2065289295,
      "datePublished": "05 May 2012 00:00:00 GMT",
      "about": "Recorded by Ben Hargett at Dub Narcotic, Olympia in August 2011. \n\nArrington de Dionyso - bass clarinet\n\nThollem McDonas- piano\n\n\n\nSee also \"Songs of Psychic Fire Vol. 1\" which was recorded during the same session but on an antique record lathe.",
      "credits": "released May 5, 2012\n            \n            UPCOMING TOURDATES!!!\n\n\n\n\n\n05/07/12New York, NY La Sala United StatesTime: 8:00pm. w/ Malinda Ray Allen, Diamond Terrifier\n\n\n\n05/08/12 Brooklyn, NY Zebulon 258 Wythe Avenue. w/ Malinda Ray Allen, Diamond Terrifier\n\n\n\n05/10/12Lowell, MA 119 Gallery 119 Chelmsford Street. w/ Thollem McDonas\n\n\n\n05/11/12Allston, MA Seal Beards w/ Thollem McDonas\n\n\n\n05/12/12Pawtucket, RI Machines With Magnets 400 Main St.. \n\n\n\nVenue phone: (401) 475-2655. w/ Thollem McDonas\n\n\n\n05/13/12Hudson, NY The Spotty Dog\n\n\n\nTime: 7:00pm. $5. Address: 440 Warren Street. Venue phone: (518) 671-6006. w/ Thollem McDonas\n\n\n\n05/15/12New York, NY The Stone 10:00pm. w/ Thollem McDonas\n\n\n\n05/16/12Brooklyn, NY Issue Project Room CECIL TAYLOR FESTIVAL w/ Thollem McDonas, also William Hooker!\n\n\n\n05/17/12 Harrisburg, PA Harrisburg Midtown Art Center\n\n\n\n05/18/12Buffalo, NYThe Vault 702 Main Street. Venue phone: 716-597-8396. w/ Thollem McDonas\n\n05/19/12 Detroit, MI TBA \n\n05/20/12 Ann Arbor, MI Arbor Vitae 336 1/2 S State St. \n\n\n\n05/21/12Chicago, IL The Empty Bottle FREE. Address: 1035 North Western Avenue. \n\n\n\n05/22/12Bloomington, IN Magnetic South\n\n\n\n05/23/12 St. Louis, MO Laumeier Sculpture Park Time: 6:00pm. FREE. Address: 12580 Rott Road. \n\n05/23/12 St. Louis, MO Floating Laboratories\n\n 4528 Ohio St.. \n\n05/24/12 Kansas City, MO Grunauer’s Upstairs w/ SNUFF JAZZ\n\n05/25/12Denver, CO Rhinoceropolis 3553 brighton blvd..",
      "license": "some rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a0213273798_0",
      "trackinfo": [
        {
          "title": "Ten Thousand Tigers, Unrelenting",
          "duration": "15:26",
          "lyrics": null
        },
        {
          "title": "Ecstatic Abundance",
          "duration": "03:34",
          "lyrics": null
        },
        {
          "title": "Alchemical Wedding",
          "duration": "09:32",
          "lyrics": null
        },
        {
          "title": "Masked Dancer",
          "duration": "07:28",
          "lyrics": null
        },
        {
          "title": "Meta-Mythic",
          "duration": "02:15",
          "lyrics": null
        },
        {
          "title": "BONUS REMIX= Birth Magic and Rot",
          "duration": "10:06",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://arrington.bandcamp.com/album/trance-punk-manifesto-vol-iv-most-wicked-dancehall-riddims-in-the-realm-of-magic",
      "title": "Trance Punk Manifesto Vol. IV- Most Wicked Dancehall Riddims In the Realm of Magic",
      "artist": "Arrington de Dionyso",
      "classification": "nyp",
      "tags": [
        "Dancehall",
        "Dancehall Reggae",
        "Experimental",
        "Trance-punk",
        "bass clarinet",
        "free jazz",
        "shamanic",
        "throatsinging",
        "trance punk",
        "Olympia"
      ],
      "item_id": 175859098,
      "datePublished": "03 Jun 2012 00:00:00 GMT",
      "about": null,
      "credits": "released June 3, 2012",
      "license": "some rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a1936451167_0",
      "trackinfo": [
        {
          "title": "Orgasm Ragga Riddim Redux",
          "duration": "06:26",
          "lyrics": null
        },
        {
          "title": "Bola Bola Afro Punk Riddim",
          "duration": "02:46",
          "lyrics": null
        },
        {
          "title": "Vampire Riddim",
          "duration": "02:31",
          "lyrics": null
        },
        {
          "title": "Blood Riddim",
          "duration": "02:54",
          "lyrics": null
        },
        {
          "title": "Shed Your Scales Riddim",
          "duration": "02:52",
          "lyrics": null
        },
        {
          "title": "Orgasm Riddim NO GUITAR",
          "duration": "03:25",
          "lyrics": null
        },
        {
          "title": "Deeeeeeper Riddim",
          "duration": "04:40",
          "lyrics": null
        },
        {
          "title": "Oyster Mushroom Riddim",
          "duration": "01:19",
          "lyrics": null
        },
        {
          "title": "Disaster Riddim",
          "duration": "02:07",
          "lyrics": null
        },
        {
          "title": "Disaster Riddim LONGER VERSION",
          "duration": "03:03",
          "lyrics": null
        },
        {
          "title": "Demon Whisper Riddim",
          "duration": "02:59",
          "lyrics": null
        },
        {
          "title": "Broken Glass Riddim",
          "duration": "02:24",
          "lyrics": null
        },
        {
          "title": "Agua Frio ECHO TRANCE",
          "duration": "09:21",
          "lyrics": null
        },
        {
          "title": "Agua Frio ECHO TRANCE 2nd Version",
          "duration": "03:40",
          "lyrics": null
        },
        {
          "title": "Agua Frio ECHO TRANCE 3rd Version",
          "duration": "06:07",
          "lyrics": null
        },
        {
          "title": "Agua Frio ECHO TRANCE vocal version",
          "duration": "06:05",
          "lyrics": null
        }
      ]
    }
  ]
}