{
  "Daniel Carter": [
    {
      "url": "https://danielcarternyc.bandcamp.com/album/home-is-where-you-are",
      "title": "Home is where You Are",
      "artist": "Dawn After Dawn",
      "classification": "paid",
      "tags": [
        "577 Records",
        "Aron Namenwirth",
        "Daniel Carter",
        "Experimental",
        "Jon Rosenberg",
        "avant",
        "avantgarde",
        "free jazz",
        "freejazz",
        "New York"
      ],
      "item_id": 2197104895,
      "datePublished": "28 Mar 2025 00:00:00 GMT",
      "about": "‘This Album Explodes into Infinite Possibilities’: 577 Records Presents New Trio Project from Maestro Daniel Carter, Guitarist Aron Namenwirth, & Sound Engineer Jon Rosenberg\n\n\n\nIf you’ve ever wondered what it sounds like to weave together wildly different genres, like electronic, experimental, funk, punk, metal, pop, R&B, and reggae, Home is Where You Are is it! The must-hear album comes from Dawn After Dawn, a new trio project by renowned multi-instrumentalist (and the intellectual who inspired the philosophy behind 577 Records) Daniel Carter, creative guitarist Aron Namenwirth and veteran sound engineer Jon Rosenberg. Their curiosity-piquing masterpiece satisfies a deeply buried need for blissful chaos that you never knew you had.\n\nDawn After Dawn is a story of fate. The trio was orbiting around each other, sparking creativity, duo collaborations, exploration, and encouragement that culminated in the mesmerizing, roaring fire you’ll hear in Home is Where You Are. As your mind identifies familiar genres, a stream of improvisational sounds flows between and around them, presenting music in motion delightfully sprinkled with modernity and wonder.\n\n“Find yourself lucky enough to have him [Daniel Carter] and Jon Rosenberg in a recording studio and some incredible guitars and pedals [on] a grand piano, incredible exchanges will happen,” says guitarist Aron Namenwirth. “Then, the engineer becomes a musician, and a duo becomes a trio.”\n\nNamenwirth and Rosenberg have been friends since 2020. They also have a duo project, Hall of Mirrors, which was formed thanks to Daniel Carter’s wise suggestion.   There is something refreshing about the way Rosenberg applied loops and effects to the random acoustics of Carter’s saxophone, trumpet, and piano and Aron’s guitar, flute, and percussion in the trio’s new release.\n\n“Between my love for dance music, the electric period of Miles Davis, and music for films, I began to add samples of tonally and rhythmically centered material to see if, somehow, these two disparate types of music could be made to mesh into something unique in the listener’s mind,” explains Brooklyn-based audio engineer, Jon Rosenberg.\n\nFor Carter, this project is all about freedom. And he isn’t shy about expressing how much it inspires and energizes him. He says it allows him to break out of the boxes of categorization and use sound as a spaceship to explore what else the universe has to offer.\n\n“Dawn After Dawn inspires me to be more free of being a saxophonist, so to speak,” 577 Records Co-Founder Daniel Carter expresses.  “Seems there are certain requirements and expectations that can be suffocating, nerve-wracking, and confining in trying to be a saxophonist.  [I] have, for a long time, periodically been inspired to play in the inner voices instead of ‘playing on top of what’s going on’ (i.e., like a soloist).”\n\nThanks to 577 Records, Home is Where You Are drops on March 28, available as a digital download for your convenience. You’re going to LOVE it!",
      "credits": "released March 28, 2025\n            \n            Daniel Carter: saxophones, trumpet, piano\n\nAron Namenwirth: guitars, flute, percussion\n\nJon Rosenberg: loops, effects\n\n\n\nRecorded by Jon Rosenberg & Alex Conroy on November 1, 2023 at the The Bunker Studio\n\n\n\nMixed by Hall of Mirrors (Aron Namenwirth & Jon Rosenberg) Producers\n\nMastering by Jon Rosenberg\n\n\n\nPainting by Aron Namenwirth\n\nGraphic design by Sergio Vezzali\n\n\n\n\n\n577 Records is an independent record label based in Brooklyn, New York operating since 2001\n\n\n\n577 Records\n\nBrooklyn, New York \n\nwww.577records.com\n\n ©+℗ 2025",
      "license": "all rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a2589661809_0",
      "trackinfo": [
        {
          "title": "No BIrTh No DEaTh",
          "duration": "02:15",
          "lyrics": null
        },
        {
          "title": "BIRDS don't Feel guilty",
          "duration": "19:49",
          "lyrics": null
        },
        {
          "title": "Home is where You Are",
          "duration": "09:45",
          "lyrics": null
        },
        {
          "title": "Margot",
          "duration": "11:16",
          "lyrics": null
        },
        {
          "title": "Whoa come on",
          "duration": "13:04",
          "lyrics": null
        },
        {
          "title": "Kris",
          "duration": "17:55",
          "lyrics": null
        },
        {
          "title": "Shadows",
          "duration": "03:00",
          "lyrics": null
        },
        {
          "title": "Last Chance to Love",
          "duration": "07:36",
          "lyrics": null
        },
        {
          "title": "Home is where You Are (Single edit)",
          "duration": "05:11",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://danielcarternyc.bandcamp.com/album/volume-1",
      "title": "Volume 1",
      "artist": "Makeshift Spirituals feat. Daniel Carter, Ayumi Ishito, George Draguns, Ed Wilcox",
      "classification": "paid",
      "tags": [
        "577 Records",
        "Ayumi Ishito",
        "Daniel Carter",
        "Ed Wilcox",
        "Experimental",
        "George Draguns",
        "avant",
        "avantgarde",
        "free jazz",
        "freejazz",
        "New York"
      ],
      "item_id": 1808868871,
      "datePublished": "16 May 2025 00:00:00 GMT",
      "about": "A New Quartet Has Been Born from the Souls of Daniel Carter, Ayumi Ishito, George Draguns, and Ed Wilcox, and Their Debut Album Stands to Redefine Experimental Music Entirely\n\n \n\nGuys! It finally happened! NYC’s Ayumi Ishito and Daniel Carter have teamed up with all-star guitarist/bassist George Draguns and renowned drummer Ed Wilcox to unleash the next level of greatness in experimental, avant-garde music. Prepare to get addicted once you experience Makeshift Spirituals and their debut (eponymous) album, thanks to 577 Records.\n\n\n\nFamed multi-instrumentalist Daniel Carter (who is also guiding light for the label) and sax wizard Ishito have been collaborating on unearthing auditory wonders for a while now, as you may have experienced with their more recent 577 Records release, Endless Season. Ed Wilcox (who has played with Marshall Allen and Arthur Doyle) met George Draguns in NYC years ago. The two instantly inspired each other, prompting their togetherness as a duo and in a well-loved Philadelphian weekly ensemble. Although Wilcox is a newcomer to 577, the others are pillars of its community.\n\n\n\nThe vision became clear when George discovered that Ed had played with Daniel Carter in the past. He also knew of the maestro’s work with Ayumi, instantly recognizing the potential for something spectacular to be born from a nostalgically cutting-edge quartet. Fast forward a bit, and here we are with the proof: Makeshift Spirituals, Volume 1. To call this a \"supergroup\" would be pretentious. But there is no denying that spirits were conjured at Brooklyn's Metropolitan Sound when they recorded on August 17, 2024.\n\n\n\nEnjoy their three tracks of mysteriously playful, soothingly invigorating, unhinged creativity when the album drops on May 16, 2025. Save the date! Only 100 first-edition CDs will be available, but you can also get it on digital download.",
      "credits": "released May 16, 2025\n            \n            Daniel Carter: trumpet, flute, saxophone\n\nAyumi Ishito: saxophone and effected saxophone\n\nGeorge Draguns: guitar and bass\n\nEd Wilcox: drums\n\n\n\nRecorded by John Epperly on August 17, 2024 at Metropolitan Sound, Brooklyn, NYC\n\nMixed and mastered by Jeremy Loucas at Sear Sound, New York City\n\n\n\nSculpture on cover: ‘King Diamond’ by Dan Tag\n\nGraphic design by Sergio Vezzali\n\nGraphic support by Mark Smith\n\n\n\nAll music by Carter, Ishito, Draguns, Wilcox\n\nPublishing: Dragunsmilk, ASCAP\n\n\n\n577 Records is an independent record label based in Brooklyn, New York operating since 2001\n\n\n\n577 Records\n\nBrooklyn, New York \n\nwww.577records.com\n\n ©+℗ 2025",
      "license": "all rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a2690915943_0",
      "trackinfo": [
        {
          "title": "Aldous Anorexics Cartwright Part 2",
          "duration": "11:31",
          "lyrics": null
        },
        {
          "title": "Alix Reassuring Witchdoctor Part 3",
          "duration": "09:30",
          "lyrics": null
        },
        {
          "title": "Alix Reassuring Witchdoctor Part 4",
          "duration": "20:11",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://danielcarternyc.bandcamp.com/album/shine-hear-vol-2",
      "title": "Shine Hear, Vol. 2",
      "artist": "Daniel Carter, Leo Genovese, William Parker, Francisco Mela",
      "classification": "paid",
      "tags": [
        "577 Records",
        "Daniel Carter",
        "Experimental",
        "Francisco Mela",
        "William Parker",
        "avant",
        "avant-garde",
        "avantgarde",
        "free jazz",
        "freejazz",
        "leo genovese",
        "New York"
      ],
      "item_id": 3803637866,
      "datePublished": "06 Sep 2024 00:00:00 GMT",
      "about": "Building off of their debut album last year, legendary musicians and 577 mainstays reunite for a second volume. As in the first, saxophonist and multi-instrumentalist Daniel Carter, pianist Leo Genovese, bassist William Parker (also playing Gralla and Shakuhachi on this album), and drummer and vocalist Francisco Mela, unite for another cosmic album. This project again draw from classic jazz arrangements, juxtaposed with a modern experimentalism and a huge range of instrumentation. Shine Hear, Vol. 2, their newest avant-garde album is testament to their mastery and ease. The album and tracks titles are inspired by another poem Carter wrote about the transience and motion of modern life. The project will be released LP/CD/DL this September.",
      "credits": "released September 6, 2024\n            \n            Daniel Carter - Saxophones, trumpet, flute\n\nLeo Genovese - Piano\n\nWilliam Parker - Bass, shakuhachi \n\nFrancisco Mela - Drums, voice\n\n\n\nRecorded on July 16, 2021 by Jeremy Loucas at Sear Sound, New York City\n\nMixed and master by Jeremy Loucas\n\n\n\nIllustration by Robert Mirolo\n\nGraphic design by Mark Smith\n\n\n\nMusic by Daniel Carter (Five Seven Seven Records Music, ASCAP), Leo Genovese, William Parker (Centering Music, BMI), Francisco Mela (BMI)\n\n\n\nOn these improvisations Francisco Mela sings themes inspired by the Cuban traditional repertoire\n\n\n\n577 Records is an independent record label \n\nbased in Brooklyn, New York \n\noperating since 2001\n\n\n\n\n\n577 Records\n\nBrooklyn, New York \n\nwww.577records.com\n\n ©+℗ 2024",
      "license": "all rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a3267077684_0",
      "trackinfo": [
        {
          "title": "Sentimental Moments",
          "duration": "11:06",
          "lyrics": null
        },
        {
          "title": "Vida Mia",
          "duration": "08:20",
          "lyrics": null
        },
        {
          "title": "Oh Yeah T’ Be Blessed",
          "duration": "20:57",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://danielcarternyc.bandcamp.com/album/trabajadores-de-energia",
      "title": "Trabajadores De Energia",
      "artist": "Daniel Carter, Adriana Camacho, Federico Ughi",
      "classification": "paid",
      "tags": [
        "577 Records",
        "Adriana Camacho",
        "Daniel Carter",
        "Experimental",
        "Federico Ughi",
        "Sounds of Freedom",
        "avant",
        "avantgarde",
        "free jazz",
        "freejazz",
        "New York"
      ],
      "item_id": 1169539543,
      "datePublished": "27 Oct 2023 00:00:00 GMT",
      "about": "The legendary New York saxophone player Daniel Carter joins forces with Mexico City based, cosmic bass player Adriana Camacho and drum wizard/producer Federico Ughi. The three master artists met in Italy during the Sounds of Freedom international music residency that culminated in the trio recording ‘Trabajadores De Energia’ out now on 577 Records. \n\n\n\nAfter 22 years of playing duo, Carter and Ughi expand the group to a trio that could be considered the perfect band. Get ready for some serious energy shifts!",
      "credits": "released October 27, 2023\n            \n            Daniel Carter: Trumpet, Alto Sax, Piano\n\nAdriana Camacho: Bass\n\nFederico Ughi: Drums\n\n\n\nRecorded on March 31, 2023 by Clive Simpson at Extrabeat, Rome, Italy\n\nMixed and mastered by Jeremy Loucas, Sear Sound, New York City\n\n\n\nAll music by Daniel Carter (Five Seven Seven Records Music, ASCAP), Adriana Camacho, Federico Ughi (Five Seven Seven Records Music, ASCAP)\n\n\n\nCover painting: ‘De la vida en el agua’ by Antonio Gritón\n\nPhoto by Rafael Arriaga\n\nGraphic design by Sergio Vezzali\n\n\n\n577 Records is an independent record label \n\nbased in Brooklyn, New York \n\noperating since 2001\n\n\n\n577 Records\n\nBrooklyn, New York \n\nwww.577records.com\n\n ©+℗ 2023",
      "license": "all rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a3970188625_0",
      "trackinfo": [
        {
          "title": "Oltre La Montagna, Il Mare",
          "duration": "18:17",
          "lyrics": null
        },
        {
          "title": "Amanecer",
          "duration": "16:31",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://danielcarternyc.bandcamp.com/album/open-question-vol-2",
      "title": "Open Question, Vol. 2",
      "artist": "Daniel Carter, Ayumi Ishito, Eric Plaks, Zachary Swanson, Jon Panikkar",
      "classification": "paid",
      "tags": [
        "577 Records",
        "Ayumi Ishito",
        "Daniel Carter",
        "Experimental",
        "Zachary Swanson",
        "avant",
        "avant-garde",
        "avantgarde",
        "free jazz",
        "freejazz",
        "New York"
      ],
      "item_id": 2103853105,
      "datePublished": "03 Nov 2023 00:00:00 GMT",
      "about": "Iconic New York music master Daniel Carter is perhaps best known for his masterful command of saxophones, trumpet, and many other instruments. However, his immense talent doesn’t just manifest through his considerable musical ability, Carter’s genius also lies in his ability to create ensembles. Daniel knows how to put just the right musicians together even when externally everything about them seems completely different. Once he’s created these groups, Daniel operates in gentle ways to guide artists to collaborate and unify. Never condescending, he seems to intuitively know the chemistry of a successful band. Open Question is one of those bands. \n\n\n\nThe previous release from this band, Vol. 1 has been received very positively by listeners and press. Will Vol. 2, extracted from the same 2020 recording session as Vol. 1, perform as well? The answer is an Open Question and the only way to solve the riddle is to immerse oneself in the vast ocean of Daniel Carter’s sound and imagination, delivered to you through this particular crew.",
      "credits": "released November 3, 2023\n            \n            Daniel Carter: Trumpet, tenor sax\n\nAyumi Ishito: Tenor sax/fx\n\nEric Plaks: Piano, rhodes\n\nZach Swanson: Electric bass\n\nJon Panikkar: Drums\n\n\n\nRecorded November 11, 2020 by Chris Benham at Big Orange Sheep, Brooklyn, NY\n\nMixed by Akihiro Nishimura\n\nMastered by Jeremy Loucas at Sear Sound, New York City\n\n\n\nCover painting: Echo by MiHee Kim Magee\n\nGraphic design by Sergio Vezzali\n\n\n\nAll music by Open Question\n\n\n\n\n\n577 Records is an independent record label based in Brooklyn, New York \n\noperating since 2001\n\n\n\n577 Records\n\nBrooklyn, New York \n\nwww.577records.com\n\n ©+℗ 2023",
      "license": "all rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a0734817609_0",
      "trackinfo": [
        {
          "title": "Peach Blossom",
          "duration": "15:01",
          "lyrics": null
        },
        {
          "title": "Undercover Cats",
          "duration": "16:49",
          "lyrics": null
        },
        {
          "title": "Joy",
          "duration": "06:45",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://danielcarternyc.bandcamp.com/album/friendship-lucid-shared-dreams-and-time-travel",
      "title": "Friendship: Lucid Shared Dreams and Time Travel",
      "artist": "Jessica Ackerley and Daniel Carter",
      "classification": "paid",
      "tags": [
        "577 Records",
        "Daniel Carter",
        "Experimental",
        "Jessica Ackerley",
        "avant",
        "avantgarde",
        "free jazz",
        "freejazz",
        "New York"
      ],
      "item_id": 2494888899,
      "datePublished": "10 Sep 2021 00:00:00 GMT",
      "about": "Friendship: Lucid Shared Dreams and Time Travel documents a fresh collaboration between multi-instrumentalist, Daniel Carter, and guitarist, Jessica Ackerley. Both musicians are active improvisers on the New York free jazz scene, but rather than collaborating on a formal stage, their musical relationship developed over a few casual outdoor sessions during the summer of 2020. This release captures the joyful ease of their collaboration, as each musical interaction creates a warm transcendence, inspired by the dream-like, meditative effect improvised music is known for. Rippling guitar strums cascade under the sustained swells of various horns and reeds, allowing passages of space and minimalist tendencies in the music to ebb and flow like breathing. The use of acoustical instruments lends itself to the stylings of primitive guitar music and nods to baroque cadences without compromising each musicians’ free jazz and experimentalist foundations. The 8-track album documents a precious encounter between two friends, inviting the listener to glimpse into their tranquil inner world. This marks Jessica Ackerley’s debut on 577 Records, anticipating future releases scheduled on the 577 catalog later in 2022. Friendship: Lucid Shared Dreams and Time Travel will be available in September 2021 on CD/digital editions.",
      "credits": "released September 10, 2021\n            \n            Daniel Carter - Saxophones, Flute, Trumpet, Clarinet\n\nJessica Ackerley - Acoustic Guitar\n\n\n\nRecorded September 7, 2020 by René Pierre Allain at Scholes Street Studio, Brooklyn\n\nMixed and mastered by Lucas Brode\n\n\n\nCover photo by No Land\n\nGraphic design by Sergio Vezzali\n\n\n\nMusic by Jessica Ackerley (BMI), Daniel Carter (Five Seven Seven Records Music, ASCAP)\n\n\n\n577 Records is an independent record label \n\nbased in Brooklyn, New York \n\noperating since 2001\n\n\n\n577 Records\n\nBrooklyn, New York \n\nwww.577records.com\n\n ©+℗ 2021",
      "license": "all rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a0030616471_0",
      "trackinfo": [
        {
          "title": "Welcome, Our Friends",
          "duration": "05:35",
          "lyrics": null
        },
        {
          "title": "Converging",
          "duration": "08:25",
          "lyrics": null
        },
        {
          "title": "A Glimpse Into",
          "duration": "03:17",
          "lyrics": null
        },
        {
          "title": "Dream State",
          "duration": "07:34",
          "lyrics": null
        },
        {
          "title": "Lucid Dreamer",
          "duration": "10:44",
          "lyrics": null
        },
        {
          "title": "Hidden Truths",
          "duration": "07:58",
          "lyrics": null
        },
        {
          "title": "Foreknowledge",
          "duration": "03:51",
          "lyrics": null
        },
        {
          "title": "Awakening",
          "duration": "03:46",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://danielcarternyc.bandcamp.com/album/welcome-adventure-vol-2",
      "title": "Welcome Adventure! Vol. 2",
      "artist": "Daniel Carter, Matthew Shipp, William Parker, Gerald Cleaver",
      "classification": "paid",
      "tags": [
        "577 Records",
        "Daniel Carter",
        "Experimental",
        "Gerald Cleaver",
        "Matthew Shipp",
        "Welcome Adventure",
        "William Parker",
        "avant",
        "avantgarde",
        "free jazz",
        "freejazz",
        "New York"
      ],
      "item_id": 3936829987,
      "datePublished": "03 Jun 2022 00:00:00 GMT",
      "about": "How do you welcome adventure? Longtime comrades, legendary Daniel Carter, Matthew Shipp, William Parker and Gerald Cleaver investigated this in their first album, Welcome Adventure, Vol. 1, resulting in 577 Records’ best-selling release in the 20 years we’ve been operating. Now, the group is trying the question again with their second astonishing volume, taken from the same historical recording session. Daniel Carter (Saxophone, Clarinet) has been collaborating with William Parker (Bass) since the early 70s and with Matthew Shipp (Piano) beginning in the mid 80s. This trio had previously played together on other occasions but sought to add a percussive element to their sound, adding stellar Gerald Cleaver (Drums) to their mix. From the warm opening song, “Sunverified” to the richly layered closer, “Da Rest Is Story,” the all-star, 5-track project is an exploratory delight. Welcome Adventure, Vol. 2 will be available in digital, CD and vinyl editions (black LPs and limited edition color vinyl) on June 3, 2022.",
      "credits": "released June 3, 2022\n            \n            Daniel Carter - Saxophones, Clarinet\n\nMatthew Shipp - Piano\n\nWilliam Parker - Bass\n\nGerald Cleaver - Drums\n\n\n\nRecorded on October 29th, 2019\n\nRecorded, mixed and mastered by Jeremy Loucas at Sear Sound, New York City\n\n\n\nPhotos by Federico Ughi\n\nGraphic design by Sergio Vezzali\n\n\n\nAll music by Daniel Carter (Five Seven Seven Records Music, ASCAP), Matthew Shipp (Matt Shipp Music, ASCAP), William Parker (Centering Music, BMI), Gerald Cleaver (Gerald Cleaver Music, SESAC)\n\n\n\nOriginal recording produced by 577 Records\n\n\n\n577 Records is an independent record label based in Brooklyn, New York operating since 2001\n\n\n\n577 Records\n\nBrooklyn, New York \n\nwww.577records.com\n\n ©+℗ 2022",
      "license": "all rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a3641512106_0",
      "trackinfo": [
        {
          "title": "Sunverified",
          "duration": "06:58",
          "lyrics": null
        },
        {
          "title": "Blinking Dawn",
          "duration": "05:17",
          "lyrics": null
        },
        {
          "title": "Mask Production",
          "duration": "07:29",
          "lyrics": null
        },
        {
          "title": "Wordwide",
          "duration": "11:00",
          "lyrics": null
        },
        {
          "title": "Da Rest Is Story",
          "duration": "10:21",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://danielcarternyc.bandcamp.com/album/radical-invisibility",
      "title": "Radical Invisibility",
      "artist": "Daniel Carter, Stelios Mihas, Irma Nejando, Federico Ughi",
      "classification": "paid",
      "tags": [
        "Cosmic Music",
        "Experimental",
        "avant",
        "avantgarde",
        "free jazz",
        "freejazz",
        "miles davis",
        "sun ra",
        "New York"
      ],
      "item_id": 3982889219,
      "datePublished": "26 Jul 2019 00:00:00 GMT",
      "about": "This is the debut album of a group dedicated to the invisible world. Some people operate invisibly by choice, some are invisible because of the nature of events in their life, some remain invisible and unknown against their will.\n\n\n\nLegendary music master Daniel Carter came up with the title Radical Invisibility. He says about this project: “This group has signature attitude, and astonishing access to some of the enticingly key mysteries of musical creation… mood, atmosphere, recognizable group-sound identity. A graceful, but quite radical, radical, but quite graceful, subtle synthesis of a wide range of musical styles/genres/traditions/sensibilities. Divinely infectious”. In various sections of the music, the listener, may ask her/himself, \"I know I’m somewhere notably specific and real, but how did I get here?”. \n\n\n\n\"Ms. Gertrude\" from Daniel Carter: \"Gertrude Stein, who again is not exactly invisible, though she’s hardly a household name for most people. I think she might qualify as invisible because her writing is so radical and “obscure”, therefore, basically very unpopular, so it’s like she’s virtually invisible.\"\n\n\n\n\"Diaspora Guinéa\" from Federico Ughi: \"dedicated to my friend Simon. He drowned while trying to cross over from Africa to Europe in a handmade boat. He wanted to bring his music project Diaspora Guinéa to Spain.\"\n\n\n\n\"weNyamombe and Gomukomu weSimbi\" from Stelios Mihas: \"it was in Mozambique during the 1940s that Dr. Tracey met musicians Katini weNyamombe and Gomukomu weSimbi. They were composer-poets as he describes and their texts \"are an excellent resource of the unique qualities of African poetry. Combining joy with melancholy, political comments and protest with everyday gossip. They express the dynamic liveliness of the people, while carrying a universal spiritual message.” The composer works at first on the text (which is a highly regarded social service as there are no newspapers or other publications besides the village square where opinions can be shared). Then the composer starts working on the music, first by memory, then with the help of the xylophone. After presenting the music to the orchestra (which is made up entirely of local musicians), they work on the underlying theme together to create variations that make up the basic structure of the \"ndogo\" (the symphonic work). Then the choreographer comes and invents movements to the music until the work is complete. According to the writer the whole work is so rich in melody, rhythm & color that it contradicts the western idea of the necessity of notation & the limits of musical memory.\"\n\n\n\n\"Mrs. Myth\" from Daniel Carter: \"a creative variation of, or wordplay on, Mrs. Smith, i.e., Bessie Smith, who’s not exactly invisible, though maybe relatively invisible for most people.\"",
      "credits": "released July 26, 2019\n            \n            Daniel Carter - Saxophones, Trumpet, Clarinet, Flute, Keyboard\n\nStelios Mihas - Guitar\n\nIrma Nejando (aka Esperanza Spalding) - Bass\n\nFederico Ughi - Drums\n\n\n\nRecorded January 13th, 2018\n\nRecorded, mixed and mastered by Jeremy Loucas at Sear Sound, New York City\n\nMusic production by Stelios Mihas\n\n\n\nOriginal recording produced by 577 Records\n\n\n\nPhotographs by Katerina Delta\n\nGraphic design by Sergio Vezzali\n\n\n\nAll music by Daniel Carter, Stelios Mihas, Irma Nejando and Federico Ughi (Five Seven Seven Records Music, ASCAP)\n\n\n\n577 Records is an independent record label based in Brooklyn, New York operating since 2001\n\n\n\n577 Records\n\nBrooklyn, New York \n\nwww.577records.com\n\n ©+℗ 2019 vinyl edition",
      "license": "all rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a0430088261_0",
      "trackinfo": [
        {
          "title": "Ms. Gertrude",
          "duration": "04:05",
          "lyrics": null
        },
        {
          "title": "Diaspora Guinéa",
          "duration": "14:26",
          "lyrics": null
        },
        {
          "title": "weNyamombe and Gomukomu weSimbi",
          "duration": "20:06",
          "lyrics": null
        },
        {
          "title": "Mrs. Myth (bonus track)",
          "duration": "04:28",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://danielcarternyc.bandcamp.com/album/life-station",
      "title": "Life Station",
      "artist": "Leila Adu, Daniel Carter, Jeff Henderson, Jeff Snyder, Federico Ughi",
      "classification": "paid",
      "tags": [
        "577 Records",
        "Daniel Carter",
        "Experimental",
        "Federico Ughi",
        "Jeff Henderson",
        "Jeff Snyder",
        "avant",
        "avant-garde",
        "avantgarde",
        "free jazz",
        "freejazz",
        "leila adu",
        "New York"
      ],
      "item_id": 3977828622,
      "datePublished": "22 Nov 2016 00:00:00 GMT",
      "about": "This recording is the culmination of a wide array of cross collaborations. Daniel Carter and Federico Ughi are known in NYC’s avant-garde music scene for their prolific musical partnership that began when they met in 2000. Leila Adu and Jeff Snyder have a shared connection to Princeton University and have been collaborating on musical projects since when they were both based there. Federico Ughi and Jeff Snyder have played together in numerous groups including Federico Ughi’s own band and latest album Heart Talk (577 Records, 2016). Jeff Henderson and Leila Adu are both from New Zealand and have been affiliated for many years.\n\n\n\nThe final product of this joint effort, featuring Daniel Carter’s sublime playing intertwined with Leila Adu’s lullaby voice and piano ostinatos, Jeff Snyder’s unpredictable electronics and the abstract grooves supplied by Federico Ughi, is a recording that is a symphony for our 2016 ears.",
      "credits": "released November 22, 2016\n            \n            Leila Adu - voice. piano\n\nDaniel Carter - tenor sax, trumpet\n\nJeff Henderson - alto sax, clarinet\n\nJeff Snyder - electronics\n\nFederico Ughi - drums   \n\n\n\nMusic by Leila Adu (APRA, Daniel Carter, Jeff Henderson (APRA), Jeff Snyder (Owen Lake Publishing, ASCAP), Federico Ughi (Five Seven Seven Records Music, ASCAP)\n\n\n\n Recorded September 17th 2013 in New York City\n\nRecorded by Michael Goldberg and NYU students under the supervision of Amandine Pras\n\nMixed by Jeff Snyder \n\nArtwork by Jeff Snyder\n\nAll rights reserved \n\nwww.577records.com",
      "license": "all rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a2175028036_0",
      "trackinfo": [
        {
          "title": "Life Station",
          "duration": "09:06",
          "lyrics": null
        },
        {
          "title": "No Drones",
          "duration": "10:25",
          "lyrics": null
        },
        {
          "title": "Punk Years",
          "duration": "16:57",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://danielcarternyc.bandcamp.com/album/the-uproar-in-bursts-of-sound-and-silence",
      "title": "The Uproar in Bursts of Sound and Silence",
      "artist": "Daniel Carter, Evan Strauss, 5-Track, Sheridan Riley",
      "classification": "paid",
      "tags": [
        "5-Track",
        "577 Records",
        "Daniel Carter",
        "Evan Strauss",
        "Experimental",
        "Sheridan Riley",
        "avant",
        "avant-garde",
        "avantgarde",
        "free jazz",
        "freejazz",
        "New York"
      ],
      "item_id": 2611899140,
      "datePublished": "26 Aug 2022 00:00:00 GMT",
      "about": "The Uproar in Bursts of Sound and Silence is a sort of emergent collage that came together over four years of composition, improvisation, and production. The foundations for this album were initially recorded in 2018 by producer/engineer Jack Endino (Nirvana, Soundgarden, Mudhoney, Skinyard) at Soundhouse in Seattle, WA with myself (Evan Strauss, electric bass and upright bass), 5-Track (Guitar) and Sheridan Riley (Drums). The initial foundations of this music consisted of my long-form graphically notated conceptual compositions based on the calls of the Veery songbird (Catharus fuscescens), the astrological transits at the precise time of the recording session and some thematic elements from Ursula K. Le Guin’s novel The Dispossessed. \n\n\n\nIn 2019 the album was given the working title Bird Songs for the Stars and I commissioned the cover art, Night Fisher, from Jeane Cohen. Also around this time, Daniel Carter had emphatically told me, “I’m going to become a rapper by the time I turn 90.” So, a few weeks later Daniel and I were hanging out, recording music and eating stir fry in my Ditmas Park apartment and I convinced him to make some progress on his goals by recording his voice into a microphone. Daniel began by recording an excerpt from Virginia Woolf’s The Waves and continued by recording some of his own poetry.\n\n\n\nThe recordings of Daniel from that afternoon would eventually make their way onto this album alongside my own experimentations in production inspired by Lee Scratch Perry, J Dilla and Ingram Marshall. I have since come to believe that this music was waiting for Daniel’s voice and music. Over the next couple of years I experimented with production techniques, renamed the album The Uproar in Bursts of Sound and Silence after an excerpt from The Waves (“wind blows the uproar in bursts of sound and silence across the court / now again they are smashing the china / that is the convention”), moved to the pacific northwest, corresponded with the estate of Virginia Woolf, mastered the entire project onto a cassette tape and convinced 577 records to release it. I hope you enjoy it as much as I have!\n\n\n\n-Evan Strauss, February 2022",
      "credits": "released August 26, 2022\n            \n            Personnel:\n\n A1. Hands, at the Bonfire \n\nDaniel Carter: Voice \n\nEvan Strauss: Synthesizers, Programming \n\nSheridan Riley: Drums \n\n\n\nA2. Examination Exanimation\n\nDaniel Carter: Voice\n\n5-Track: Guitar \n\nEvan Strauss: Electric Bass, Bass Clarinets, Tenor Saxophone  \n\nSheridan Riley: Drums\n\n\n\nB1. Gemini Rising \n\nDaniel Carter: Flute, Clarinet, Soprano Saxophone, Alto Saxophone \n\n5-Track: Guitar  \n\nEvan Strauss: Upright Bass, Programming \n\nSheridan Riley: Drums\n\n\n\nProduced by Evan Strauss\n\nAll compositions by Evan Strauss with significant contributions by 5-Track, Daniel Carter & Sheridan Riley Hands, at the Bonfire words and \"The Uproar in Bursts of Sound and Silence\" text excerpted from The Waves by Virginia Woolf ©1931 and used with permission from the estate of Virginia Woolf\n\n Examination Exanimation words by Daniel Carter ©2021\n\n\n\n Cover art by Jeane Cohen, ©2019; Night Fisher, 10\"x10\", oil on canvas\n\nGraphic design by Sergio Vezzali\n\n\n\n Recorded by Jack Endino at Soundhouse in Seattle, WA; 2018 \n\nAdditional recording by Evan Strauss in Brooklyn, NY; 2019\n\n Mixed and mastered by Evan Strauss \n\n\n\nAll material ©2021 Evan Strauss except where otherwise noted\n\nSpecific analog systems have been utilized in the production of this music. Artifacts of these systems, which may be perceived as imperfections in audio quality, are present in this music. \n\n\n\nGracious thanks to all who contributed to this music including 5-Track, Sheridan Riley, Daniel Carter, Jeane Cohen, 577 Records, Virginia Woolf, the estate of Virginia Woolf and The Society of Authors. \n\n\n\n\n\n577 Records is an independent record label\n\nbased in Brooklyn, New York \n\noperating since 2001\n\n\n\n577 Records\n\nBrooklyn, New York \n\nwww.577records.com\n\n ©+℗ 2022",
      "license": "all rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a0849052577_0",
      "trackinfo": [
        {
          "title": "Hands, at the Bonfire",
          "duration": "01:44",
          "lyrics": null
        },
        {
          "title": "Gemini Rising",
          "duration": "20:16",
          "lyrics": null
        },
        {
          "title": "Examination Exanimation",
          "duration": "18:55",
          "lyrics": null
        },
        {
          "title": "Aquarian Mars",
          "duration": "06:17",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://danielcarternyc.bandcamp.com/album/wake-up",
      "title": "WAKE UP!",
      "artist": "WAKE UP!",
      "classification": "paid",
      "tags": [
        "Experimental",
        "avant",
        "avantgarde",
        "free jazz",
        "freejazz",
        "New York"
      ],
      "item_id": 1210571240,
      "datePublished": "01 Apr 2010 00:00:00 GMT",
      "about": null,
      "credits": "released April 1, 2010\n            \n            Daniel Carter - alto and tenor sax\n\nDemian Richardson- trumpet\n\nDavid Moss- electric bass\n\nFederico Ughi - drums\n\nMatthew Putman - piano (on track 15)\n\n\n\nRecorded in Brooklyn, NY\n\nDate: August 2009\n\nRelease: April 2010",
      "license": "all rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a0166696744_0",
      "trackinfo": [
        {
          "title": "It's WAKE UP! TIME",
          "duration": "01:11",
          "lyrics": null
        },
        {
          "title": "The Queen",
          "duration": "04:03",
          "lyrics": null
        },
        {
          "title": "Wake Up Call, The Time Has Come",
          "duration": "02:01",
          "lyrics": null
        },
        {
          "title": "Aiming To All Voices",
          "duration": "09:12",
          "lyrics": null
        },
        {
          "title": "I Wanna Eat You",
          "duration": "02:31",
          "lyrics": null
        },
        {
          "title": "Joy For Now",
          "duration": "04:21",
          "lyrics": null
        },
        {
          "title": "Love Before The Sacred Dawn",
          "duration": "04:35",
          "lyrics": null
        },
        {
          "title": "One Way",
          "duration": "01:39",
          "lyrics": null
        },
        {
          "title": "Laid Back",
          "duration": "03:00",
          "lyrics": null
        },
        {
          "title": "Disco Days",
          "duration": "01:25",
          "lyrics": null
        },
        {
          "title": "Strange Up",
          "duration": "02:44",
          "lyrics": null
        },
        {
          "title": "Super Chicken",
          "duration": "05:57",
          "lyrics": null
        },
        {
          "title": "Get Ready",
          "duration": "02:36",
          "lyrics": null
        },
        {
          "title": "Resisting In Space",
          "duration": "02:13",
          "lyrics": null
        },
        {
          "title": "Bliss Between The Cracks",
          "duration": "06:42",
          "lyrics": null
        },
        {
          "title": "The Courage To Be",
          "duration": "01:27",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://danielcarternyc.bandcamp.com/album/open-question-vol-1",
      "title": "Open Question Vol. 1",
      "artist": "Daniel Carter, Ayumi Ishito, Eric Plaks, Zach Swanson, Jon Panikkar",
      "classification": "paid",
      "tags": [
        "577 Records",
        "Ayumi Ishito",
        "Daniel Carter",
        "Experimental",
        "avant",
        "avant-garde",
        "avantgarde",
        "free jazz",
        "freejazz",
        "New York"
      ],
      "item_id": 1957237059,
      "datePublished": "21 Jan 2022 00:00:00 GMT",
      "about": "Open Question Vol. 1—soon to be followed by a second volume—is the first of two albums that rely on stellar, warm, collective, and freely improvised music. The band formed organically in 2019 from weekly jam sessions in Harlem; it is comprised of tenor saxophonist Ayumi Ishito, pianist Eric Plaks, bassist Zach Swanson, and drummer Jon Panikkar, and later, multi-instrumentalist Daniel Carter. Recording an album with only free-improvisation was Ishito’s long time dream, stalled by the pandemic, and realized only this year. Open Question’s music today, while fully improvised, remains firmly rooted in the jazz tradition. This is best heard on “Synchronicity,” the last recorded piece of the session, where each musician’s trajectory diverges even as the piece holds together. On the track, Carter starts out with soprano sax then later switches to tenor toward the middle of the piece, as Carter and Ishito playfully spar with competing tenor melodies. This album marks Ayumi Ishito’s second album on 577 Records, following her widely-acclaimed Ayumi Ishito & the Spacemen Vol. 1 (2021).",
      "credits": "released January 21, 2022\n            \n            Daniel Carter: Trumpet, flute, clarinet, soprano, alto, tenor sax\n\nAyumi Ishito: Tenor sax/fx\n\nEric Plaks: Piano, wurlitzer\n\nZach Swanson: Acoustic bass\n\nJon Panikkar: Drums\n\n\n\nRecorded November 11, 2020 by Chris Benham at Big Orange Sheep, Brooklyn, NY\n\nMixed by Akihiro Nishimura\n\nMastered by Jeremy Loucas at Sear Sound, New York City\n\n\n\nCover painting: Echo by MiHee Kim Magee\n\nGraphic design by Sergio Vezzali\n\n\n\nAll music by Open Question\n\n\n\n\n\n577 Records is an independent record label based in Brooklyn, New York \n\noperating since 2001\n\n\n\n577 Records\n\nBrooklyn, New York \n\nwww.577records.com\n\n ©+℗ 2022",
      "license": "all rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a1659655517_0",
      "trackinfo": [
        {
          "title": "Blues",
          "duration": "11:59",
          "lyrics": null
        },
        {
          "title": "Dimly-lit Platform",
          "duration": "05:33",
          "lyrics": null
        },
        {
          "title": "Confidential BBQ",
          "duration": "19:41",
          "lyrics": null
        },
        {
          "title": "Synchronicity",
          "duration": "06:36",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://danielcarternyc.bandcamp.com/album/endless-season",
      "title": "Endless Season",
      "artist": "Daniel Carter, Ayumi Ishito",
      "classification": "paid",
      "tags": [
        "577 Records",
        "Ayumi Ishito",
        "Cosmic Music",
        "Daniel Carter",
        "Experimental",
        "abstract hip-hop",
        "avant",
        "avant-garde",
        "avant-hip-hop",
        "avantgarde",
        "free jazz",
        "freejazz",
        "New York"
      ],
      "item_id": 3299690407,
      "datePublished": "28 Feb 2025 00:00:00 GMT",
      "about": "Endless Season: Legendary Maestro Daniel Carter and Flourishing Saxist Ayumi Ishito Join Forces in Dreamy Debut Album That Redefines ‘Auditory Escape’\n\n\n\nThe ultimate cosmic music has arrived! Prepare to be gently led into an invigorating electronic dreamscape by a skillfully creative partnership. Despite collaborating since 2016, Endless Season is the first duo album from 577 Records Co-Creator (and legendary maestro), Daniel Carter, and rising tenor saxist Ayumi Ishito.\n\nOriginally recorded as an acoustic set, the plan changed when Carter encouraged Ishito to explore audio production. Before they knew it, she had shaped beats and sounds that perfectly complemented his creativity, forming a tranquil, melodic dialogue. His delightful expressions become animated through his trumpet, saxophones, clarinet, flute, piano, and poems. When they meet Ayumi’s courage, playfulness, and head-turning musical gifts in this dimension, blissful ambiance and sounds as deep as Mother Nature are born. It’s why she so aptly suggested Endless Season for the title of this release.\n\nDaniel Carter is the philosopher behind grassroots label, 577 Records. He is world-renowned for his multi-instrumentalist talents and awe-inspiring musical innovation. Ayumi Ishito is considered one of the best young, dynamic, creative musicians in New York’s avant-garde scene. Many agree she represents the future of this genre with her incredible means of weaving together sound and imagination.\n\nTheir six-track duo debut will be available on CD and digital download starting February 28, 2025!",
      "credits": "released February 28, 2025\n            \n            Daniel Carter: trumpet, saxophones, clarinet, flute, piano, words/poem on track 1\n\nAyumi Ishito: tenor sax, effects, synthesizer, arrangements\n\n\n\nRecorded February 24, 2023 and November 3, 2023 at Metropolitan Sound, Brooklyn, New York\n\nRecorded by John Epperly\n\nMixed by Akihiro Nishimura\n\nMastered by Jeremy Loucas at Sear Sound, New York City\n\n\n\n\n\nAudio production by Ayumi Ishito\n\n\n\nPhotography by Meghan Desmond\n\nGraphic design by Mark Smith\n\n\n\nMusic by Daniel Carter (Five Seven Seven Records Music, ASCAP) and Ayumi lshito (BMI)\n\n\n\n577 Records is an independent record label \n\nbased in Brooklyn, New York \n\noperating since 2001\n\n\n\n577 Records\n\nBrooklyn, New York \n\nwww.577records.com\n\n ©+℗ 2025",
      "license": "all rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a2768184745_0",
      "trackinfo": [
        {
          "title": "Dreamy Contagion",
          "duration": "04:29",
          "lyrics": null
        },
        {
          "title": "Rhymes Times",
          "duration": "07:07",
          "lyrics": null
        },
        {
          "title": "Hatch da Sun",
          "duration": "08:42",
          "lyrics": null
        },
        {
          "title": "Grave Fortune",
          "duration": "07:31",
          "lyrics": null
        },
        {
          "title": "Teeyah",
          "duration": "04:20",
          "lyrics": null
        },
        {
          "title": "Night Mirrors",
          "duration": "09:59",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://danielcarternyc.bandcamp.com/album/shine-hear-vol-1",
      "title": "Shine Hear, Vol. 1",
      "artist": "Daniel Carter, Leo Genovese, William Parker, Francisco Mela",
      "classification": "paid",
      "tags": [
        "577 Records",
        "Daniel Carter",
        "Experimental",
        "Francisco Mela",
        "Leo Genovese",
        "William Parker",
        "avant",
        "avant-garde",
        "avantgarde",
        "free jazz",
        "freejazz",
        "New York"
      ],
      "item_id": 2321785383,
      "datePublished": "07 Jul 2023 00:00:00 GMT",
      "about": "Collaborations are unique to their combinations, producing totally original and innovative ideas with the addition of a single factor. In this case, legendary musicians and 577 mainstays join together in this unique arrangement for the first time, allowing for yet another reinvention. Saxophonist and multi-instrumentalist Daniel Carter, pianist Leo Genovese, bassist William Parker (also playing Gralla and Shakuhachi on this album), and drummer and vocalist Francisco Mela, unite for another improvisational project—one that invokes classic, elegant jazz, juxtaposing their different instruments with experimental arrangement. Shine Hear, Vol. 1, their latest avant-garde album is testament to their mastery and ease. The album and tracks titles are inspired by a poem Carter wrote about New York’s interminable motion, the city they all call home. The project will be released as an LP/CD/DL in July 2023.",
      "credits": "released July 7, 2023\n            \n            Daniel Carter - Saxophones\n\nLeo Genovese - Piano\n\nWilliam Parker - Bass, gralla, shakuhachi \n\nFrancisco Mela - Drums, voice\n\n\n\nRecorded on July 16, 2021 by Jeremy Loucas at Sear Sound, New York City\n\nMixed and master by Jeremy Loucas\n\n\n\nIllustration by Robert Mirolo\n\nGraphic design by Mark Smith\n\n\n\nMusic by Daniel Carter (Five Seven Seven Records Music, ASCAP), Leo Genovese (BMI), William Parker (Centering Music, BMI), Francisco Mela (BMI) \n\n\n\nOn these improvisations Francisco Mela sings themes inspired by the Cuban traditional repertoire\n\n\n\n577 Records is an independent record label \n\nbased in Brooklyn, New York \n\noperating since 2001\n\n\n\n577 Records\n\nBrooklyn, New York \n\nwww.577records.com\n\n ©+℗ 2023",
      "license": "all rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a4187067729_0",
      "trackinfo": [
        {
          "title": "Intertext Salute",
          "duration": "14:50",
          "lyrics": null
        },
        {
          "title": "Shine Hear",
          "duration": "05:29",
          "lyrics": null
        },
        {
          "title": "Glisten Up",
          "duration": "17:31",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://danielcarternyc.bandcamp.com/album/in-ponta-delgada",
      "title": "In Ponta Delgada",
      "artist": "Big Group",
      "classification": "paid",
      "tags": [
        "Experimental",
        "avant",
        "avantgarde",
        "free jazz",
        "freejazz",
        "New York"
      ],
      "item_id": 14930478,
      "datePublished": "01 May 2009 00:00:00 GMT",
      "about": null,
      "credits": "released May 1, 2009\n            \n            Big Group\n\nIn Ponta Delgada\n\n\n\nDaniel Carter: alto sax\n\nRodrigo Amado: tenor sax\n\nMichael Smith: tenor & soprano saxes\n\nJorge Lima: soprano sax\n\nTadeu Cabral: alto sax\n\nLuís Senra: tenor sax\n\nMartin Maus: alto sax\n\nMiguel Mendes: alto sax\n\nDemian Richardson: trumpet\n\nEma da Ponte: cello\n\nJoão Luis Macedo: guitar\n\nJoão Simas: guitar\n\nEmanuel Paquete: guitar\n\nTérinho: piano\n\nJoão Bernardo: piano\n\nPaulo Pimentel: piano\n\nHernani Faustino: bass\n\nGianna De Toni: bass\n\nFederico Ughi: drums, flute, percussion\n\nZézé Ngambi: drums\n\nJoão Tavares: drums\n\nRicardo Reis: drums\n\n\n\n\n\nRecorded at the 10th Festival de Jazz de Ponta Delgada, Teatro Micaelense, Ponta Delgada, São Miguel, Açores, Portugal\n\n\n\nReleased: May 2009\n\n\n\nCatalogue No. LES 005",
      "license": "all rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a1814672976_0",
      "trackinfo": [
        {
          "title": "Rain On The Green Mountain",
          "duration": "27:19",
          "lyrics": null
        },
        {
          "title": "Current Ocean Beauty",
          "duration": "30:00",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://danielcarternyc.bandcamp.com/album/concrete-science",
      "title": "Concrete Science",
      "artist": "Daniel Carter, Steve Swell, Federico Ughi",
      "classification": "paid",
      "tags": [
        "Cosmic Music",
        "Daniel Carter",
        "Experimental",
        "Federico Ughi",
        "Forward Festival",
        "Steve Swell",
        "avant",
        "avantgarde",
        "free jazz",
        "freejazz",
        "New York"
      ],
      "item_id": 3078515694,
      "datePublished": "25 May 2017 00:00:00 GMT",
      "about": null,
      "credits": "released May 25, 2017\n            \n            Daniel Carter: alto and tenor sax, flute and clarinet\n\nSteve Swell: trombone\n\nFederico Ughi: drums\n\n\n\nRecorded in Brooklyn, New York\n\nRelease: December 2004\n\nCatalogue number 577-5\n\n\n\nPhotograph: Federico Ughi",
      "license": "all rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a3090868686_0",
      "trackinfo": [
        {
          "title": "Now And Ever Resistance",
          "duration": "17:09",
          "lyrics": null
        },
        {
          "title": "Soul's Underwood Tunnels",
          "duration": "12:34",
          "lyrics": null
        },
        {
          "title": "Middleclass Madness",
          "duration": "18:04",
          "lyrics": null
        },
        {
          "title": "Our Own Fingerprints",
          "duration": "07:18",
          "lyrics": null
        },
        {
          "title": "Concrete Science",
          "duration": "06:24",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://danielcarternyc.bandcamp.com/album/welcome-adventure-vol-1",
      "title": "Welcome Adventure! Vol. 1",
      "artist": "Daniel Carter, Matthew Shipp, William Parker, Gerald Cleaver",
      "classification": "paid",
      "tags": [
        "577 Records",
        "Daniel Carter",
        "Experimental",
        "Gerald Cleaver",
        "LP",
        "Matthew Shipp",
        "William Parker",
        "avant",
        "avant-garde",
        "avantgarde",
        "free jazz",
        "freejazz",
        "vinyl",
        "New York"
      ],
      "item_id": 2736588233,
      "datePublished": "05 Jun 2020 00:00:00 GMT",
      "about": "Are you ready for magic? The master musicians Daniel Carter, Matthew Shipp, William Parker and Gerald Cleaver will provide access with this album, the first they have released after playing together for decades. \n\n\n\nDaniel Carter has been collaborating with William Parker since the early 70s and with Matthew Shipp starting in the mid 80s. This trio has played together on many recordings but by adding legendary drummer Gerald Cleaver to the mix they have created a masterpiece combination; a supergroup of sorts. This all-star project is presented in two parts/LPs. This is the first volume - with volume two scheduled to be published in the near future. \n\n\n\nListen to Welcome Adventure! and experience the mystical journey of these masterful artists as they guide you through the realm of magic.",
      "credits": "released June 5, 2020\n            \n            Daniel Carter - Tenor Saxophone, Trumpet, Flute\n\nMatthew Shipp - Piano\n\nWilliam Parker - Bass\n\nGerald Cleaver - Drums\n\n\n\n\n\nRecorded on October 29th, 2019\n\nRecorded, mixed and mastered by Jeremy Loucas at Sear Sound, New York City\n\n\n\nPhotos by Federico Ughi\n\nGraphic design by Sergio Vezzali\n\n\n\nAll music by Daniel Carter (Five Seven Seven Records Music, ASCAP), Matthew Shipp (Matt Shipp Music, ASCAP), William Parker (Centering Music, BMI), Gerald Cleaver (Gerald Cleaver Music, SESAC)\n\n\n\n\n\nOriginal recording produced by 577 Records\n\n\n\n577 Records is an independent record label based in Brooklyn, New York operating since 2001\n\n\n\n577 Records\n\nBrooklyn, New York \n\nwww.577records.com\n\n ©+℗ 2020 vinyl edition",
      "license": "all rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a1753807666_0",
      "trackinfo": [
        {
          "title": "Majestic Travel Agency",
          "duration": "13:03",
          "lyrics": null
        },
        {
          "title": "Scintillate",
          "duration": "04:39",
          "lyrics": null
        },
        {
          "title": "Ear-regularities",
          "duration": "20:01",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://danielcarternyc.bandcamp.com/album/stepping-out",
      "title": "Stepping Out",
      "artist": "Playfield: Carter, Muhr, Ishito, Plaks, Namenwirth, Takahashi, Swanson, Panikkar",
      "classification": "paid",
      "tags": [
        "Aron Namenwirth",
        "Ayumi Ishito",
        "Daniel Carter",
        "Eric Plaks",
        "Experimental",
        "Jon Panikkar",
        "Luisa Muhr",
        "Yutaka Takahashi",
        "Zachary Swanson",
        "avant",
        "avantgarde",
        "free jazz",
        "freejazz",
        "New York"
      ],
      "item_id": 926261971,
      "datePublished": "21 Oct 2022 00:00:00 GMT",
      "about": "Playfield has never played inside. Daniel Carter, a multi-instrumentalist and the founder of 577 Records, has always pushed to make sound more real, relying on outdoor performance and New York City’s auditory ambience, to orchestrate his pieces. This practice, which is fundamentally improvisational and experimental, opens any final recording to the unpredictable nature of strangers’ sound and offers a rich texture of a moment in time. Importantly for the artists, this practice draws on the energy of one’s external environment: conversations, car horns, bird songs, and far away, even other music. That changed with Stepping Out, the group’s first recording in the comparatively sterile environment of a studio. Alongside Carter, Luisa Muhr (Voice), Ayumi Ishito (Tenor Sax and Electronics), Eric Plaks (Piano and Rhodes), Aron Namenwirth (Guitar and Electronics), Yutaka Takahashi (Guitar and Electronics), Zachary Swanson (Bass), Jon Panikkar (Drums) packed into a Brooklyn recording studio. As the environment shrank from open streets to an enclosed room, the artists were compelled to make field recordings of cicadas or ice-cream trucks, and include heavy new effects to transition between improvisations. Producers Jon Rosenberg and Aron Namenwirth borrowed mixing techniques from the pop and cinema world to bring jazz into the 21st century without resorting to commercial beats or a famous feature singer. The result is creative, expansive, and intently real. Stepping Out will be available on CD in October 2022.",
      "credits": "released October 21, 2022\n            \n            Daniel Carter: Tenor Sax, Alto sax, Clarinet, Bass Clarinet, Flute, Trumpet\n\nLuisa Muhr: Voice\n\nAyumi Ishito: Tenor Sax and Electronics\n\nEric Plaks: Piano and Rhodes\n\nAron Namenwirth: Guitar and Electronics\n\nYutaka Takahashi: Guitar and Electronics\n\nZachary Swanson: Bass\n\nJon Panikkar: Drums\n\n\n\nRecorded June 16, 2021 by Jon Rosenberg at The Bunker, Brooklyn\n\nAssistant Engineer: Alex Conroy\n\nMixed & Mastered by Jon Rosenberg\n\nProduced by Hall Of Mirrors (Aron Namenwirth & Jon Rosenberg)\n\n\n\nPainting by Aron Namenwirth\n\nGraphic design by Sergio Vezzali\n\nGraphic files preparation by Mark Smith\n\n\n\nAll music by Playfield (Five Seven Seven Records Music, ASCAP)\n\n\n\n577 Records is an independent record label \n\nbased in Brooklyn, New York \n\noperating since 2001\n\n\n\n577 Records\n\nBrooklyn, New York \n\nwww.577records.com\n\n ©+℗ 2022",
      "license": "all rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a1635373613_0",
      "trackinfo": [
        {
          "title": "Tree House",
          "duration": "08:48",
          "lyrics": null
        },
        {
          "title": "Ice Cream Mountain",
          "duration": "12:45",
          "lyrics": null
        },
        {
          "title": "Loves Electric Touch",
          "duration": "19:26",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://danielcarternyc.bandcamp.com/album/peoples-resonance",
      "title": "People&#39;s Resonance",
      "artist": "Daniel Carter, Gene Janas, Federico Ughi",
      "classification": "paid",
      "tags": [
        "Experimental",
        "avant",
        "avantgarde",
        "free jazz",
        "freejazz",
        "New York"
      ],
      "item_id": 3988624153,
      "datePublished": "01 Dec 2008 00:00:00 GMT",
      "about": null,
      "credits": "released December 1, 2008\n            \n            Daniel Carter: alto sax, tenor sax, flute, trumpet\n\nGene Janas: upright bass, percussion, voice\n\nFederico Ughi: drums\n\n\n\nRecorded in Brooklyn, New York\n\nReleased: December 2008\n\nCatalogue number 577-8\n\n\n\nPhotograph: Federico Ughi",
      "license": "all rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a3880630554_0",
      "trackinfo": [
        {
          "title": "Daniel Carter, William Parker, Federico Ughi - Talk In Play, People On Mercy",
          "duration": "08:53",
          "lyrics": null
        },
        {
          "title": "Flowers Reach Clouds",
          "duration": "20:20",
          "lyrics": null
        },
        {
          "title": "Protecting Cosmos",
          "duration": "30:06",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://danielcarternyc.bandcamp.com/album/magic-heart",
      "title": "Magic Heart",
      "artist": "Playfield: Carter, Muhr, Ishito, Plaks, Namenwirth, Takahashi, Swanson, Panikkar",
      "classification": "paid",
      "tags": [
        "577 Records",
        "Daniel Carter",
        "Experimental",
        "Playfield",
        "avant",
        "avant-garde",
        "avantgarde",
        "free jazz",
        "freejazz",
        "New York"
      ],
      "item_id": 472839449,
      "datePublished": "19 Jan 2024 00:00:00 GMT",
      "about": "Playfield, the experimental jazz collective guided by Daniel Carter, offers a second studio album, Magic Heart. As a multi-instrumentalist, Carter has always sought to contextualize sound, relying on outdoor performance and New York City’s auditory ambience, to orchestrate his sound. This practice, which is fundamentally improvisational and experimental, opens any final recording to the unpredictable nature of strangers’ sound and offers a rich texture to depict a moment in time, drawing on the world itself: conversations, car horns, bird songs, and far away, even other music. This is the group’s first recording in a studio and it’s made of two volumes: Stepping Out (released by 577 Records in 2022) and this second volume: Magic Heart. Here Daniel Carter together with Luisa Muhr (Voice), Ayumi Ishito (Tenor Sax and Electronics), Eric Plaks (Piano and Rhodes), Aron Namenwirth (Guitar and Electronics), Yutaka Takahashi (Guitar and Electronics), Zachary Swanson (Bass), Jon Panikkar (Drums) gathered inside to make something less ambient. As the environment transitioned from open streets to an enclosed room, the artists brought in field recordings of cicadas or ice-cream trucks, and heavy new effects to transition during interludes. Producers Jon Rosenberg and Aron Namenwirth borrowed mixing techniques from the pop and cinema world. Magic Heart will be available on CD in January 2024.",
      "credits": "released January 19, 2024\n            \n            Daniel Carter: Tenor Sax, Alto sax, Clarinet, Bass Clarinet, Flute, Trumpet\n\nLuisa Muhr: Voice\n\nAyumi Ishito: Tenor Sax and Electronics\n\nEric Plaks: Piano and Rhodes\n\nAron Namenwirth: Guitar and Electronics\n\nYutaka Takahashi: Guitar and Electronics\n\nZachary Swanson: Bass\n\nJon Panikkar: Drums\n\n\n\nRecorded June 16, 2021 by Jon Rosenberg at The Bunker, Brooklyn\n\nAssistant Engineer: Alex Conroy\n\nMixed & Mastered by Jon Rosenberg\n\nProduced by Hall Of Mirrors (Aron Namenwirth & Jon Rosenberg)\n\n\n\nPainting by Aron Namenwirth\n\nGraphic design by Sergio Vezzali\n\nGraphic files preparation by Mark Smith\n\n\n\nAll music by Playfield (Five Seven Seven Records Music, ASCAP)\n\n\n\n577 Records is an independent record label \n\nbased in Brooklyn, New York \n\noperating since 2001\n\n\n\n577 Records\n\nBrooklyn, New York \n\nwww.577records.com\n\n ©+℗ 2024",
      "license": "all rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a3237611016_0",
      "trackinfo": [
        {
          "title": "Miracle",
          "duration": "32:08",
          "lyrics": null
        },
        {
          "title": "Magic Tree",
          "duration": "22:25",
          "lyrics": null
        },
        {
          "title": "Hardcore Orange Eyelids Of The Sun",
          "duration": "05:10",
          "lyrics": null
        }
      ]
    }
  ]
}