{
  "Dirk Serries": [
    {
      "url": "https://dirkserries.bandcamp.com/album/arcas-callisto",
      "title": "Arcas/Callisto",
      "artist": "Dirk Serries",
      "classification": "paid",
      "tags": [
        "Experimental",
        "ambient",
        "freejazz",
        "improvisation",
        "minimal",
        "Antwerp"
      ],
      "item_id": 3749316848,
      "datePublished": "27 Oct 2024 00:00:00 GMT",
      "about": "Performed at the Oude Klooster chapel (Brecht, Belgium) on April 30th, 2023. Recorded, mixed and mastered by Dirk Serries.",
      "credits": "released October 27, 2024\n            \n            José Lencastre : alto sax \n\nDirk Serries : archtop guitar \n\n\n\n\n\nOriginally released as a limited edition Lathe Cut 7inch on Champion Version, 2024. \n\n\n\nchampionversion.bandcamp.com",
      "license": "all rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a0302510672_0",
      "trackinfo": [
        {
          "title": "Arcas",
          "duration": "02:24",
          "lyrics": null
        },
        {
          "title": "Callisto",
          "duration": "02:43",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://dirkserries.bandcamp.com/album/dual-activity",
      "title": "Dual Activity",
      "artist": "Mark Wastell &amp; Dirk Serries",
      "classification": "paid",
      "tags": [
        "Experimental",
        "ambient",
        "freejazz",
        "improvisation",
        "minimal",
        "Antwerp"
      ],
      "item_id": 3414647320,
      "datePublished": "18 Apr 2025 00:00:00 GMT",
      "about": "Recorded at Dave Hunt Studio, London, 12 February 2025\n\nRecording engineered by Dave Hunt\n\n\n\nMixed and mastered by Dirk Serries.",
      "credits": "released April 18, 2025\n            \n            DIRK SERRIES : archtop guitar, effects, amp\n\nMARK WASTELL : percussion\n\n\n\nOriginally released on Confront Records (cd, 2025)\n\n\n\nSPONTANEOUS MUSIC TRIBUNE REVIEW :\n\nMark Wastell, brytyjski wiolonczelista, a od pewnego czasu głównie perkusjonalista, wspominał w czasie pobytu na pewnym spontanicznym festiwalu w naszym pięknym kraju o koncercie, w jakim miał okazję uczestniczyć jako widz ponad trzydzieści lat temu. W mniemaniu Marka, było to wydarzenie, które ukształtowało go jak artystę, nadało sens jego wzmaganiom na polu muzyki swobodnie improwizowanej. A na myśli miał wspólny występ Dereka Baileya i Johna Stevensa z roku 1992 (nagranie jest dostępne w zasobach globalnej sieci, także z obrazem).\n\n\n\nDokładnie o tym samym koncercie Wastell wspomina zapraszając nas do odsłuchu najnowszej płyty Confront Recordings, która konsumuje jego duet z Dirkiem Serriesem. Czyli spotkanie perkusji (tu raczej perkusjonalii) i amplifikowanej gitary akustycznej. Album sytuuje się w serii tak zwanych EP-CD, a zatem jest krótki (tu 25 minut), do tego wydany w nakładzie ledwie 50 sztuk. Szczęśliwe nakład plików elektronicznych jest jak zawsze niewyczerpalny. Zapraszamy do odsłuchu, warto tu bowiem pochylić się nad każdą frazą, każdym dźwiękiem, każdą koincydencją brzmieniową, czy dramaturgiczną.\n\n\n\nNagranie składa się z ośmiu opowieści, które trwają od niespełna dwóch do czterech i pół minuty. Start jest leniwy, nieco enigmatyczny – szeleszczą talerze, delikatnie drżą tomy, gitara rysuje pierwsze pętle ze strzępami melodii. Muzycy bystrze na siebie reagują, zwłaszcza gdy nabierają odrobinę intensywności. W kolejnej części przez kilka chwil brzmią, niczym duet, który stał się tak silną inspiracją dla Marka. Potem gitara nabiera rockowej soczystości, a zwinny, koci drumming wznieca dodatkowe porcje emocji. W ułamku sekundy muzycy potrafią tu zastygnąć i szukać lekkich, bardziej ulotnych fraz. W ramach deseru dostajemy jeszcze krótkie solo Wastella, utrzymane w tajemniczej rytmice.\n\n\n\nNa starcie trzeciej improwizacji artyści frazują bardzo filigranowo. Po niedługim czasie gitara zaczyna szukać masy i rozbłyskuje, perkusjonalia tymczasem pozostają w stadium interaktywnych detali. W kolejnej części pojawiają się flażolety, pomruk szeleszczących talerzy, a całość lepi się w subtelną post-balladę na wdechu. Pod koniec utworu muzycy unoszą się ku górze i kołyszą niesieni strzępami rytmu. Początek piątej części wydaje się z jednej strony nerwowy, z drugiej dość ceremonialny. Z odsieczą przychodzi melodia i perkusyjny post-rytm. W szóstej piosence czuć bluesem na kilometr. Mark szoruje werbel, Dirk leniwie swawoli. W kolejnej odsłonie obaj znów sięgają po estetykę amerykańskiej prerii, są swobodni w każdym ruchu, uśmiechnięci, zdolni do figlowania. Nucą nam meta balladę w oczekiwaniu na długą podróż po tajemniczych bezdrożach.\n\n\n\nFinałowa improwizacja rodzi sie w szemrzącej ciszy. Perkusjonalia niczym wataha owadów, struny gitary niczym wielka pajęczyna. W sieci lądują filigranowe uderzenia, drobne otarcia, zgrzyty i pół akordy, z których lepi się nerwowe, rozedrgane zakończenie. Odrobinę niedopowiedziane, jakby muzycy sugerowali, iż ich podróż będzie miała ciąg dalszy. Koniecznie!\n\n\n\nSALT PEANUTS REVIEW :\n\nDual Activity is an inspired homage to the seminal, free improvised work of British free improvising pioneers – drummer John Stevens and guitarist Derek Bailey, and especially to their duo album Playing (Incus, 1993). Wastell, who witnessed Stevens and Bailey’s performance in August 1992, says that «the music they played that night marked me for life. I reflect on that gig to this day. Their commitment, energy, seriousness, and musical intellect have informed me for over three decades». Prolific Belgian guitarist Dirk Series, like Wastell, was influenced by the work of Bailey and Stevens. Wastell (who also runs the Confront label) and Serries, with the same instrumentation as Stevens and Bailey, amplified acoustic guitar and small percussion set, recorded eight short improvisations as an homage to their mentors at Dave Hunt Studio in London in February 2025. This EP lasts only 25 minutes, and its limited edition of 50 CD-Rs is already sold out, but the music is still available on Confront and Serries’ Bandcamp pages. And the music is profound, uncompromising, thought-provoking, clear, and pure, just like their mentors.",
      "license": "all rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a3425022041_0",
      "trackinfo": [
        {
          "title": "Jeddo",
          "duration": "01:52",
          "lyrics": null
        },
        {
          "title": "Stronsa",
          "duration": "04:39",
          "lyrics": null
        },
        {
          "title": "Lefroy",
          "duration": "03:17",
          "lyrics": null
        },
        {
          "title": "Aylmer",
          "duration": "02:30",
          "lyrics": null
        },
        {
          "title": "Cobbold",
          "duration": "03:26",
          "lyrics": null
        },
        {
          "title": "Gayford",
          "duration": "01:44",
          "lyrics": null
        },
        {
          "title": "Becklow",
          "duration": "03:49",
          "lyrics": null
        },
        {
          "title": "Kinnear",
          "duration": "04:29",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://dirkserries.bandcamp.com/album/zonal-disturbances-ii",
      "title": "Zonal Disturbances II",
      "artist": "Dirk Serries",
      "classification": "paid",
      "tags": [
        "Experimental",
        "ambient",
        "freejazz",
        "improvisation",
        "minimal",
        "Antwerp"
      ],
      "item_id": 2827371419,
      "datePublished": "27 Feb 2025 00:00:00 GMT",
      "about": "All performed real-time at the home studio in November 2024.\n\nMixed and mastered by Dirk Serries.",
      "credits": "released February 27, 2025\n            \n            Dirk Serries : electric guitar, effects.\n\n\n\nPhotography by Dirk Serries.\n\n\n\nOriginally released on Zoharum, 2025. This is part two in a series of 5 volumes.\n\n\n\nMOORS MAGAZINE REVIEW :\n\nZonal Disturbances II is het tweede deel van de reeks ambientalbums die de Belgische gitarist Dirk Serries in zijn eentje in zijn homestudio opneemt, met enkel zijn elektrische gitaar en een aantal effectpedalen. Ik zeg nu wel “ambient” maar deze muziek is niet helemaal in dat vakje te plaatsen, want dit is ambient die je goed wakker houdt als luisteraar. Donker, melodieus, melancholiek, zwaar ook, maar tegelijk vol subtiele details die je steeds doen opveren en weer bij de les houden, om het zo maar te zeggen. Het album duurt een uur en een kwartier, en na afloop ben ik blij dat er meer delen zijn, want dit hoeft niet te stoppen, als ik eenmaal samen met Serries in de flow zit wil ik eigenlijk alleen maar dat het nog een hele tijd doorgaat. Er worden ons vijf delen in het vooruitzicht gesteld, en ik zit in ieder geval al handenwrijvend klaar. Geweldige muziek.\n\n\n\nKRAUTNICK REVIEW:\n\nVerrückt: Allein mit seiner E-Gitarre und einem unüberblickbar hohen Stapel an Effektgeräten, verliert sich Dirk Serries selbst und lässt dazu das Aufnahmegerät laufen. Seine „Zonal Disturbances“ enthalten eine Art Ambient, die Musik mäandert ohne rhythmische Konturen durch den Raum und nimmt die Hörenden mit zwar dunklen, aber durchaus entspannenden Sounds auf eine Reise. Die auch was länger dauert: Aktuell liegt „Zonal Disturbances II“ vor, und der Antwerpener kündigt an, dass dies eine Serie aus fünf Teilen werden soll. Nur zu!Dunkelheit dominiert diese „Störungen“, die Töne sind tiefer gehalten, lediglich im Hintergrund oder in Ausnahmen schimmert es mal etwas heller, als Riss in den Wolken – oder auch als Ankündigung von noch mehr Dunkelheit. Serries lässt seine Gitarre dröhnen, er entringt ihr durchgehende Sounds, die er leicht variiert, aber von anderen Sounds begleiten lässt. So hat man nie das Gefühl, permanent nur ein Geräusch zu hören, sondern etwas Lebendigem, aber Langsamem zu folgen.\n\nDer erste von vier Tracks schunkelt wie ein dunkelgraues Meer aus flüssigem Metall in der Nacht, dessen Wellen Geräusche abgeben, die nicht nach Wasser klingen, sondern fester, wenn auch nicht greifbar. Eine Viertelstunde lang wogt dieses handzahme Ungetüm und schafft es, gleichzeitig den Eindruck von unterschwelliger Bedrohlichkeit und deren behutsame Abwendung auszustrahlen. Etwas mehr Helligkeit begleitet den zweiten Viertelstünder, dessen Basis-Drone angenehm fuzzy erklingt und der mehrere Begleitgeräusche transportiert. Von denen sind einige tatsächlich in hoffnungsvoll höheren Lagen gehalten, binden sich aber mit allen Sounds zu einem Geflecht zusammen, so dass keine der Stimmungen dominiert, sondern man von diesem Fluss einfach irgendwie behütet getragen wird.\n\nAn dritter Stelle wird es beinahe klassisch, das Stück klingt anfangs nach Streichinstrumenten, die über einen Drone kratzen, wischen, geistern, und danach wie gehauchte Blasinstrumente, ein Saxophon oder Didgeridoo, in das jemand ohne Kraftanstrengung hineinpustet. In diesem Zweiungdzwanzigminüter finden mehr atmosphärische Wechsel statt als in den beiden Tracks davor, die in sich geschlossener ein Thema abbilden. Hier verändern sich die Sounds beständig, denn bald schon bedient Serries seine Gitarre so behutsam, dass ihr lediglich ein milder Ton entfleucht, in dem man sich betten mag. Was er dem hinzufügt, lässt die Ahnung von Synthesizern aufkommen, die jemand zaghaft bedient, nur einen Ton, vielleicht zwei, ein bisschen herumprobiert, vorsichtig, dass es auch ja niemand mitbekommt. Ab und zu rutscht der Experimentierende dann und wann aus, dann dröhnt ein intensiver Ton, aber hey, das verleiht dem Bild nur Konturen und bindet die Aufmerksamkeit der Betrachtenden.\n\nDer letzte Track, abermals 22 Minuten lang, erhöht wieder den Fuzz-Anteil im Drone. Mancher Sound knarzt gar wie ein alter analoger Synthesizer, dadurch bekommt der gesamte Track eine angenehme Wärme, trotz der eher aufgekratzten Sounds, denn die setzt der Gitarrist stressfrei ein, wellenartig, sinuskurvig. So sind Wiederholungen und Loops ohnehin ein fester Teil dieser „Zonal Disturbances“. Zudem variiert er auch hier die Geräusche, er entlockt seiner Gitarre unter anderem gelegentlich den Klang einer Orgel und zuletzt sogar den einer Sirene. Damit holt er die Hörenden freundlich aus der Trance wieder heraus, in die er sie in den 70 Minuten davor versetzte.\n\nRätselhaft sind die Titel der vier Tracks: Sie lauten „594ZEY8P“, „KG209NCF“, „XDY8756C“ und „AHOFS58Z“. Was auch immer sie bedeuten, sie sind originär, eine Internetsuche führt direkt auf dieses Album zurück. Auch scheinen es keine codierten Koordinaten zu sein, Google Maps wirft da nichts aus. Zeitangaben sind es nicht, Hexadezimalzahlen nicht, allenfalls ein kryptischer Dialog mit Richard D. James fällt dazu ein, dessen Tracktitel sind ja bisweilen ähnlich nebulös. Auf dem ersten Teil der „Zonal Disturbances“ begannen alle Tracktitel mit dem Buchstaben I, gefolgt von weiteren Buchstaben und Zahlen, aber selbst solch eine minimale Konstante bietet Teil II nicht an. Auch ergeben Online-Decodierer keine sinnvollen Ergebnisse. Drei weitere Teile der „Zonal Disturbances“ will Serries noch folgen lassen. Die spielt er vermutlich ein, während man den zweiten Teil noch hört, und dazu gleichzeitig noch 161 weitere Projekte mit Freunden, die dann im Mai als Mitschnitt erscheinen. Verrückt!\n\n\n\nJAZZ'HALO REVIEW :\n\nNiet elke gitaar klinkt als een gitaar. Dirk Serries bewijst dit nogmaals op deze nieuwe opname. Dat hij daarbij gretig gebruik maakt van “effects” helpt om een heel aparte klankenwereld te creëren.\n\nHet was ergens in november 2024 dat gitarist “hors pair” Dirk Serries zich terugtrok in zijn thuisstudio en aan het improviseren ging enkel met gitaar gekoppeld aan wat analoge pedalen. Alles wat op band belandde, werd in “real-time” ingespeeld. Na de mixing en mastering door Serries zelf is ‘Zonal Disturbances II’ het eindresultaat.\n\nZoals titel en kunstzinnige zwart-withoes aanduiden gaat het om een uiterst donkere soundtrack te omschrijven als “industrial ambient”. Welkom in een gitzwarte matrix waar cijfers en letters door elkaar als referentie gebruikt worden, net als op de vorige release trouwens. Vandaar benamingen voor de vier hoofdstukken als ‘594ZEY8P’, ‘KG209NCF’, ‘XDY8756C’ en ‘AHOFS58Z’. \n\nTweeënzeventig minuten lang wordt de luisteraar ondergedompeld in een huiveringwekkend decor waarin duistere texturen overheersen. Soundscapes schuiven als tektonische platen over elkaar heen en leiden tot een heus trance-effect. Dirk Serries werpt zich wederom op als de obsessieve muzieketnoloog van dienst gespecialiseerd in sonische weefsels van het schimmige type. Zeker voor fans van Tim Motzer. Dit is het tweede hoofdstuk van een vijfdelige reeks. Uiteindelijk zal een verzamelbox volgen. U bent verwittigd.\n\n\n\nVITAL WEEKLY REVIEW :\n\nDuring his long career, there have been some interesting changes for Dirk Serries and his music. I am sure I started previous reviews with similar words. In recent years, he has done many releases with improvised music, but there has been a slight side interest, which is more up my alley. This is an extension of his old work as Vidna Obmana, Fears Fall Burning and Microphonics, but it is also a new direction for him. The guitar remains his instrument of choice, but in his current handling, it sounds pretty different from the deep ambient of Vidna Obmana or the rockist drones of Fears Fall Burning. I have no idea how he plays his guitar these days, with his hands, objects, or a bow (or a combination), but Serries manages to retrieve a ‘dirty’ sound from his instrument. The results are crumbled sounds, muffled, alien, and sustaining oddly, like ambient music. In some ways, I’d say Serries connects with those dystopian lo-fi noise mongers, working with cheap instruments to alter field recordings so they sound like a field recording of a post-nuclear blast, but doing something similar. However, it’s less lo-fi, or at least I assume so, and there’s a long line of shiny effects pedals to create this sound. The only other guitarist to play similar music is Manuel Mota (I am sure there are others, but I don’t know them). The music fits Serries’ long career in ambient music, but he now takes a new path, one that leads to more industrial results, as depicted on the cover. There are four pieces, between 14 and 22 minutes, and none feels long or too much. Maybe it’s the somewhat sombre Good Friday, slower than your average, and I am in no hurry either, that made me play this on repeat three times, before even wanting to get up and think about a review. Dystopian never felt this good! (Unlike the unfolding dystopia in real life, I might add)\n\n\n\nMEDIENKONVERTER REVIEW :\n\nWer glaubt, Ambient sei nur Klangtapete fürs entspannte Kräutertee-Schlürfen, dem wirft ‘Dirk Serries’ am 7. April 2025 mit Zonal Disturbances II eine düstere Klanglandschaft vor die Füße, die eher nach post-apokalyptischem Gewächshaus klingt als nach Esoterikladen. Die vier Stücke, live eingespielt im heimischen Studio im November 2024, sind der zweite Teil einer fünfteiligen Reihe, die nach und nach auf Zoharum erscheinen und schließlich in einer Box enden wird – ein musikalischer Langzeitplan mit Tiefgang.\n\nSerries, der mit seiner Gitarre und einem analog-pedalgesteuerten Arsenal schon seit Jahrzehnten das weite Feld zwischen Ambient, Industrial und experimenteller Musik durchpflügt, zeigt sich auch hier wieder als Klangarchitekt mit Hang zur brodelnden Unruhe. Zonal Disturbances II klingt dabei so, als hätte jemand Minimalismus mit einer Prise Nihilismus gewürzt – organisch, düster, langsam wachsend, aber stets mit einem subtilen Zittern unter der Oberfläche. Tracktitel wie 594ZEY8P oder XDY8756C wirken wie Passwörter in ein klangliches Paralleluniversum, das mit traditionellen Songstrukturen nichts am Hut hat. Stattdessen gibt es langsam wuchernde Droneflächen, tiefe Schwingungen und eine Atmosphäre, die sich eher zwischen verlassenem Industriekomplex und endlosem Weltraum bewegt als im Wohnzimmer.\n\nWer also auf Ambient steht, der nicht einfach nur plätschert, sondern unter der Oberfläche brodelt, sollte sich dieses zweite Kapitel von Zonal Disturbances auf keinen Fall entgehen lassen. Es ist Musik für jene, die in der Stille das Chaos hören können – und für alle, die nicht glauben, dass man mit einer Gitarre die Realität verbiegen kann. Dirk Serries kann es.\n\n\n\nAMN REVIEW :\n\nDespite its title, Zonal Disturbances II is the first of five planned releases. The album presents Dirk Serries in a raw form that combines two of his areas of focus: guitar-based free improv and ambient music.\n\nSpanning four long tracks (14-23 minutes) recorded live in the studio, Serries employs just electric guitar and a rack of effects. Through delay, loops, and other processing, there are multiple voices present most of the time, adding unsettling ambient washes to spiky distorted guitar. When not plucking abrupt or jolting individual notes, his fretwork blends into a fuzzy background that shift, moves, and evolves over time. Occasionally this background takes on a harsher presence, with feedback and static-laden passages that resemble a loose electrical connection.\n\nFor those familiar with the multiple faces of Dirk Serries, Zonal Disturbances II is a interesting amalgam of his styles. But this release should have appeal to any adventurous listener, as he explores a sparsely-populated area of ambient music.\n\n\n\nANXIOUS MAGAZINE REVIEW :\n\nDirk Serries na muzycznej scenie obecny jest już blisko cztery dekady. Artysta znany choćby z legendarnego dla wielu projektów Vidna Obmana trwale wpisał się w kanon ambientowej klasyki, która w jego wykonaniu bardzo często wykracza poza utarte ramy gatunku. Nie inaczej jest na nowym albumie Dirka, tym razem wydanym pod jego własnym nazwiskiem. Zazwyczaj wszelkie ambientowe eksperymenty kojarzą się z dźwiękami generowanymi i przetwarzanymi za pomocą stricte syntetycznego instrumentarium. W przypadku nowej płyty Serriesa jest jednak zgoła inaczej. Muzyk postanowił oprzeć wszystko na bazie brzmienia gitary elektrycznej, instrumentu, po który bardzo często sięga w swojej twórczości. Oczywiście gitara jest tylko punktem wyjścia, ponieważ dźwięki przez nią generowane przepuszczone są przez masę efektów i procesorów. Co ciekawe, całość została nagrana na żywo, przez co brzmi niezwykle surowo i organicznie. Zonal Disturbances to również dzieło bardzo obszerne. Składa się z czterech kompozycji, z których najkrótsza trwa blisko kwadrans. Nie sposób tym samym słuchać tego albumu w biegu. Wymaga on zarówno czasu skupienia, aby we wszystkich zawartych tu niuansach usłyszeć całe bogactwo dźwięków. A jest tu co odkrywać… Od repetatywnych partii zanurzonych w przesterach i sprzężeniach po przestrzenne plamy dźwięku, które nakładając się na siebie tworzą zamglone, dźwiękowe krajobrazy. Jest tu miejsce i na surowość, chropowatość, jak również na spokój i łagodność. Słuchanie tego ponad godzinnego albumu na pewno może być nie lada wyzwaniem, jeśli jednak stylistyka muzycznego eksperymentu jest komuś bliska to nie przejdzie koło tej płyty obojętnie.\n\n\n\nVER SACRUM REVIEW :\n\nZonal Disturbances II non è un disco, ma un’interferenza cosmica: una trasmissione opaca proveniente da un confine instabile tra il suono e il silenzio. Dirk Serries, da solo con la sua chitarra elettrica e un arsenale di pedali analogici, si ritira dal mondo per improvvisare in tempo reale una topografia sonora senza coordinate, senza direzione, senza centro. Ne nasce un’opera che non guida ma disorienta, che non racconta ma si lascia abitare come un territorio astratto — o un sogno ricorsivo. Quattro lunghe tracce dai titoli alfanumerici (“594ZEY8P”, “KG209NCF”, “XDY8756C”, “AHOFS58Z”) funzionano come traslitterazioni acustiche di un codice indecifrabile. Come in una matrice nera attraversata da tensioni residue, la chitarra non è mai solo una chitarra: è rumore latente, voce che si scioglie nel riverbero, feedback che pulsa come una vena elettrica appena sotto la pelle. È una musica che serpeggia e resta, simile a una macchia di umidità sul muro: lenta, persistente, inesorabile. Qui torna lo spirito dei lavori più oscuri e sperimentali di Vidna Obmana, il precedente alias di Serries. Non la world ambient meditativa di alcuni suoi cicli etnici, ma i paesaggi più ridotti, granulosi, profondamente texturali — pensiamo a The Spiritual Bonding, Crossing the Trail, o ai primi lavori per Projekt. Zonal Disturbances II condivide con quei dischi l’approccio rituale all’improvvisazione, la preferenza per i suoni che emergono dal margine e l’esplorazione come unica forma di struttura. L’oscurità domina, ma è un’oscurità senza dramma. Non è tragedia: è condizione. A tratti le frequenze si alzano in un mormorio industriale, come un impianto in dismissione che continua a ronzare da solo nella notte. Altre volte, brevi lampi armonici squarciano il tessuto audio, come crepe in una lastra d’ardesia. Ogni elemento pare sospeso in un vuoto pressurizzato, come se ci trovassimo all’interno di una camera stagna in cui ogni gesto ha il peso della distanza. Il risultato è un suono vivido, ma quasi disabitato, come se si ascoltasse ciò che resta dopo che la musica ha cessato di interessarsi all’umano. È ambient, certo, ma nel senso di un ambiente che ti guarda senza riconoscerti. Una lenta mutazione in loop, dove le stratificazioni non costruiscono climax, ma profondità. Una caverna elettroacustica dove il tempo viene assorbito invece che scandito. Zonal Disturbances II è un invito a sottrarsi, a osservare da dentro la deriva. È un’opera isolazionista per eccellenza: non chiama, non accoglie. Ma chi è disposto a perdersi troverà qui un altrove sonoro senza nome — un luogo in cui riconoscere la propria sparizione come forma ultima di ascolto. Serries non si limita a suonare la chitarra: la dissolve.\n\n\n\nSPONTANEOUS MUSIC TRIBUNE REVIEW :\n\nDirk Serries jest tak częstym gościem na tych łamach, iż nie wymaga choćby słowa wprowadzenia. Zauważmy wszakże, iż muzyk, od ponad dekady silnie zanurzony w post-jazzowej muzyce swobodnie improwizowanej, coraz częściej powraca do swojej dawnej, ambientowej estetyki. Niektóre z nowych albumów są dla gatunku typowe, inne zdają się wnosić nowe elementy do ukształtowanego lata temu idiomu. Choćby At Future Down, nagranie, które śmiało posadowiło się na liście najlepszych nagrań ubiegłego roku, czyli wedle nomenklatury Trybuny, było jednym z 50 powodów, dla których warto było ów rok zapamiętać.\n\nPrzed nami kolejna ambientowa nowość Serriesa, znów doposażona w elementy, które winny szczególnie przykuwać naszą uwagę. Dodajmy, iż krążek dostarcza krajowe Zoharum, które na ogół śle nam reedycje starszych nagrań belgijskiego gitarzysty. A tu nowość, do tego w zapowiadanej serii i od razu z … rozdziałem drugim. Tych ostatnich będzie kilka, a ów pierwszy epizod na nośniku fizycznym otrzymany … dopiero na samym końcu. Zapraszamy w kolejną samotną podróż Dirka ze wspaniałego cyklu the way of no return.\n\nDruga odsłona Zonal Disturbances składa się z czterech rozbudowanych ekspozycji, z których dwie pierwsze trwają po ponad kwadrans, dwie kolejne każdorazowo przekraczają dwadzieścia minut. W spektrum nagrania pojawiamy się jakby znienacka. Coś już trwa, coś nas ominęło. Gęsty, szorstki, wielowątkowy strumień – niektóre pasma falują, inne są efektem szarpnięcia za struny, obleczone kurzem antycznego ambientu. Background zdaje się mroczny, nosi znamiona zdekonstruowanego wieki temu rocka, słychać odgłosy iście loftcraftowskich przestworzy grozy. Wątek prymarny wydaje się poszarpany, skundlony, zagniatany ciężarem upływającego czasu. Początek drugiej części brzmi niemal post-industrialnie. Gitara charczy, rzęzi jak stary gruźlik, brzmi niczym zdezelowany syntezator. W tle już tradycyjnie mości się mroczny, wielowątkowy ambient. Teraz przypomina złowrogi chór wieszczący nieoczekiwaną nowinę. Flow popada w prawdziwie diabelskie rozkołysanie. Z czasem wydaje się, że ulega rozrzedzaniu, niczym plamy farby, na którą kapią łzy skazańców. Na zakończenie na nieistniejącej scenie pozostaje już sam ambient, obleczony spazmami smutnych piechurów. Trzecia opowieść sprawia wrażenie najspokojniejszej, szytej większymi połaciami czystszego ambientu. Wątek główny przypomina mglisty śpiew syntezatora zasilanego coraz mniejszymi porcjami prądu. Ta cisza przed burzą nabiera tajemniczej syntetyczności, a każdy z wątków zdaje się gubić gibkość na rzecz gęstości. Pojawiają się ukradkowe melodie, strzępy fonii poddawane nieuchronnemu upływowi czasu, niczym proces powolnej korozji. Opowieść ma różne fazy intensywności, ale i tak pozostaje nadspodziewanie kojąca w brzmieniu. Na ostatnich metrach gitara delikatnie sprzęga, wpada w boleść, umiera wyjątkowo długo. W ostatniej opowieści wątek główny jest kłębkiem basowych nerwów. Jego flow jest poszarpany, rozmywa się pod ciężarem własnym, tembr jest brudny, masywny, obleczona zakurzonym ambientem. Wszystko kołysze się na umiarkowanie silnym wietrze, brzmi syntetycznie, znów bardzo boleśnie. W tle pojawia się czyste pasmo ambientu, niczym światełko w tunelu, lepione z brzmienia nieobecnych strun i nieistniejących organów. Basowy strumień nie odpuszcza, dygocze, szczerzy zęby na dźwięk kolejnego pasma czystej fonii. Coś w tle delikatnie wyje, jakaś tajemnicza syrena alarmowa.\n\n\n\nEXPOSÉ REVIEW :\n\nThese are a couple of releases that Dirk Serries released on other labels (meaning other than Projekt, the label that has released most of the titles we have reviewed in these pages), though they are no less worthy, covering a wide range of styles; no songs, no singing, no jazz or rock in evidence, these are both extended sound sculptures of the highest order. Zonal Disturbances II picks up where 2024’s Zonal Disturbances left off, except this time out it’s available as a compact disc as opposed to a download-only, for those who like their music on a convenient physical medium. Again, the four very cryptic titles clock in at around an album side each, and could best be described as hard core ambient industrial sound sculptures created in real time using electric guitar and a motherboard of effects pedals, resulting in a sort-of minimalist chamber of chaos and clusters of gritty sounds, always interesting — though your average song-oriented listener might be running away with their ears covered after just a few minutes — this is definitely not for the faint of heart; it’s provocative, noisy, and highly experimental, one never knows what’s going to happen from one moment to the next. That said, each one of the pieces is a beautiful creation, a unique chain of sonic events that appear, expand, coalesce, decay and self-destruct in real time, each idea turning inward on itself or exploding into a supernova, with threads of amazing sounds flowing between each of the sub-constructs. There is no cadence, only a droning flow of energy and ideas. One can imagine hearing this being created in a live setting, loops of pure sonic madness moving in and out of the listener’s consciousness. This is the second installation of what Serries plans as a five volume set on the Polish Zoharium label.\n\n\n\nROCKERILLA REVIEW :\n\nL’ultimo progetto del prolifico musicista belga è un’opera in cinque parti, ZONAL DISTURBANCES. La prima uscita discografica è il secondo capitolo, appena pubblicato dalla solita Zoharum, l’etichetta polacca che ha recentemente ristampato alcuni imperdibili lavori di Vidna Obmana. Zonal Disturbances II è a sua volta diviso in quattro parti, ognuna rappresentata da un codice alfanumerico. Dirk Serries improvvisa con chitarra elettrica e feedback, inseguendo i fantasmi nascosti nei cantieri e nelle periferie della città in demolizione/ricostruzione. L’abisso della società post-industriale nascosto nell’ ombra di drone elettrici. Tenebroso.\n\n\n\nDE SUBJECTIVISTEN REVIEW : \n\nMijn eerste kennismaking met de muziek van de Belgische artiest Dirk Serries is met zijn Vidna Obmana project (waarvan de schrijfwijze nog wel eens verschilt). Hier heeft hij van 1984 tot 2007 een meer dan indrukwekkende discografie opgebouwd. Maar dat is lang niet alles, want er volgen vele releases met projecten als Fear Falls Burning, YODOK III, 3 Seconds Of Air, The Sleep Of Reason, Continuum, Akhet, Kodian Trio en Streams Of Consciousness en tevens onder zijn eigen naam. Hij is terug met denk ik zijn vierde of vijfde album van dit jaar Zonal Disturbances II, dat volgt het in 2024 verschenen eerste deel. Zoals altijd verkent hij nieuwe, dikwijls onontgonnen gebieden in de muziek, die meestal wel ergens in de ambienthoek finisht. Met zijn elektrische gitaar met een moederbord vol analoge pedalen heeft hij 4 stukken live opgenomen. Het zijn dus niet per se improvisaties, maar denk ik wel op dat moment ingekleurde stukken. Dat maakt ook dat de muziek organisch en ongepolijst overkomt. In totaal serveert hij er hier 4, maar dan wel met een totale lengte van 74 minuten. Je hoeft niet je veiligheidsgordel om te doen voor deze trip, want Serries pakt het zoals altijd rustig en minimalistisch aan. De stukken zijn wat meer grofkorrelig en unheimisch. Hij lardeert de muziek met drones en industriële en experimentele elementen. Met dit alles weet hij op biologerende wijze je steeds te verrassen met geluid die komen en gaan. Ook zitten er geluiden door die een soort zang doen vermoeden, al zou dat ook door de effecten kunnen komen. Het is wederom onderscheidend en meeslepend goed.\n\n\n\nCHAIN D.L.K. REVIEW :\n\nIn Zonal Disturbances II, Dirk Serries continues his exploration of ambient soundscapes, crafting a sonic journey that is both immersive and introspective. Recorded live in his home studio in November 2024, this album showcases Serries' mastery in manipulating electric guitar tones through a complex array of analog pedals, resulting in four expansive tracks that blur the lines between ambient, drone, and experimental music. Each track, intriguingly titled with cryptic alphanumeric codes - \"594ZEY8P\", \"KG209NCF\", \"XDY8756C\", and \"AHOFS58Z\" - serves as a portal into a distinct auditory realm. These compositions, ranging from 14 to 22 minutes, unfold with a deliberate pace, allowing listeners to become enveloped in evolving textures and subtle tonal shifts. Serries' approach is characterized by minimalistic structures and repetitive clusters of sound, creating an atmosphere that is both brooding and eerie. The live recording process adds an organic quality to the music, capturing the spontaneity and raw emotion of each performance. This album is part of a planned five-volume series, with Zonal Disturbances II laying the groundwork for the subsequent releases. The Polish label Zoharum has committed to releasing the entire series, culminating in a comprehensive box set that encapsulates Serries' vision for this ambitious project. For those seeking an ambient experience that challenges conventional boundaries, Zonal Disturbances II offers a compelling exploration of sound and emotion.\n\n\n\nSALT PEANUTS REVIEW :\n\nThe first collection of Zonal Disturbance extended ambient pieces was released by Serries (as a download-only release) and was recorded at his home studio in October 2025. The second one was recorded a month later, again, in Serries’ home studio (and released as a disc by the Polish Zoharum label) and injects an unpredictable, provocative spin to these disorienting, restless pieces. The four distinct, minimalist pieces are carefully layered, looped, manipulated, and distorted in real time. They use slow repetitive clusters of sound, with many effects that reference Serries’ sonic alter-egos as Vidna Obmana and Fear Falls Burning, with their strong industrial and experimental veins. They sound as if Serries sculpts their enigmatic, melancholic sound out of dark and highly resonant, extraterrestrial materials.",
      "license": "all rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a0000655478_0",
      "trackinfo": [
        {
          "title": "594ZEY8P",
          "duration": "14:08",
          "lyrics": null
        },
        {
          "title": "KG209NCF",
          "duration": "16:00",
          "lyrics": null
        },
        {
          "title": "XDY8756C",
          "duration": "22:28",
          "lyrics": null
        },
        {
          "title": "AHOFS58Z",
          "duration": "21:36",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://dirkserries.bandcamp.com/album/the-might-of-stars-sublime",
      "title": "The Might Of Stars Sublime",
      "artist": "Dirk Serries",
      "classification": "paid",
      "tags": [
        "Experimental",
        "ambient",
        "freejazz",
        "improvisation",
        "minimal",
        "Antwerp"
      ],
      "item_id": 3779324460,
      "datePublished": "28 Apr 2025 00:00:00 GMT",
      "about": "All performed and recorded at the home studio, July-August 2024. \n\nMixed and mastered by Dirk Serries.",
      "credits": "released April 28, 2025\n            \n            Dirk Serries : electric guitar, effects. \n\n\n\nphotography by Martina Verhoeven. \n\nmartinaverhoeven.com\n\n\n\n “The Might Of Stars Sublime” from a poem by Johann Wolfgang von Goethe.\n\n\n\n\n\nOriginally released on Audiophob (cd, 2025).\n\n\n\nVITAL WEEKLY REVIEW :\n\nThis time, I will refrain from expressing my surprise about Dirk Serrries returning to ambient music, playing guitar with lots of effects, and such, because there are a few of these albums, and it’s a steady stream. If Serries is on a roll, there’s no stopping him. His improvised music side is nice, even when, most of the time, not my thing. I always preferred his work as Vidna Obmana and Fears Falls Burning, and these days doing a crossover between those previous projects. There are the highly atmospheric, sustaining patterns of Vidna Obmana, without the refinement, coupled with the rock-like guitar drone approach of Fear Falls Burning, but without the rock context, if you get my drift. The previous release had a bit more of a crumbled approach, almost like aliens playing the residue of a guitar, but on ‘The Might Of Stars Sublime’, the guitar returns to being a guitar and even howls like a drone-rock guitar e-bow solo. Here, too, the element of sustaining plays a significant role \n\nin the music, with the five pieces ranging in length from seven to ten minutes. Each of these is a well-rounded composition, and the five pieces are alike, yet different. They’re from the same composer, who nailed his approach down and sticks to the plan. Of course, Serries understands the need for this approach; to make an atmospheric album most enjoyable, it is essential to have no distractions, no out-of-place elements, and to do what he does best: play this kind of music. Whereas the previous release reminded me of Manuel Mota, this new one reminds me mostly of Dirk Serries, and that’s also (!) a great connection. Another refined work!\n\n\n\nAFRICAN PAPER REVIEW :\n\nMit “The Might of Stars Sublime” veröffentlicht der belgische Musiker Dirk Serries sein erstes Album auf dem Leipziger Label Audiophob. Aufgenommen mit elektrischer Gitarre und Effektgeräten, bewegt sich das Werk im Spannungsfeld zwischen warmer, vielfarbiger Klangschichtung und rauen, körnigen Texturen, oft mit einem spürbar melancholischen Unterton. Die Stücke folgen einer reduzierten, aber harmonisch fein abgestimmten Struktur, in der melodische Elemente zwar angedeutet, aber nie vordergründig ausformuliert werden. Stattdessen entfaltet sich eine Musik, die gleichermaßen geerdet wirkt und doch in eine andere Dimension zu führen scheint. Der Titel, inspiriert von einem Zitat Goethes, scheint auf diese Spannung zwischen Größe und Zerbrechlichkeit, zwischen Sternenglanz und Stille zu deuten.\n\n\n\nNITESTYLEZ REVIEW : \n\nPut out on the circuit via the German Audiophob label on April 25th, 2k25 is \"The Might Of Stars Sublime\", the most recent album by long standing producer Dirk Serries who has - according to Discogs stats... - more than 130 solo album releases under his belt using his real name alone, with a multiple of multiple involvements in groups, bands and projects as well as other aliases used since the 80s not accounted for. An impressive discography which sees its latest sequel, a five tracks and roughly 45 minutes spanning CD album, venturing into emotional, highly dramatic Synth Ambient landscapes with the opening tune \"A Soft Glow\" which moves to and fro like bright beams of sunlight over harsh, mountaineous terrain on a stormy, semi-clouded day followed by the deeper, more nocturnal, yet not less dramatic \"Evocation\" which, despite being less spiralling, for us evokes faint memories of Tangerine Dream's score work for the 1977 movie \"Sorcerer\". Furthermore \"Carved Into\" Oscillation\" brings forth a calm take on post-apocalyptic Dark Ambient melancholia with fine morning mists floating over scarred landscapes and future battlefields whereas \"Form Reversal\" enters a realm of shimmering Ambient hopefulness and ethereal beauty before the final cut that is \"The Stars Sublime\" waves goodbye in a most comforting, and probably most classic and soothing Ambient manner with its soft ebb and flow of tonal shifts and a basically naturalistic overall feel which also might speak to fans and followers of (Neo)Classical music for a reason. A highly recommended journey into Ambient and Deep Listening Music as well as classic Synth compositions for those who know. Go check!\n\n\n\nKRAUTNICK REVIEW :\n\nHeimlich wie die Kraft der Sterne bedient sich Dirk Serries für den Titel seines neuesten Albums (obwohl das zum Zeitpunkt der Niederschrift bei dem vielbeschäftigten Antwerpener vermutlich nicht mehr zutrifft) „The Might Of Stars Sublime“ bei Johann Wolfgang von Goethes Gedicht „Glück der Entfernung“. So poetisch wie der Titel ist auch die Musik, möchte man sagen. Dieses Mal hat sein mit der E-Gitarre erzeugter Ambient mehr Modulation als auf anderen Veröffentlichungen dieser Art, man ist beinahe geneigt, zu sagen: mehr Tempo, was bei beatlosem Ambient natürlich etwas schwierig zu ermitteln ist. Strahlende Schönheit liegt ihm ebenso inne wie beklemmende Spannung. Die Musik auf diesen fünf Tracks bewegt sich mehr, die Modulationen geschehen wahrnehmbarer. Auf vergleichbaren Alben strecken sich die Tonlagenänderungen bisweilen in den mehrstelligen Minutenbereich, hier geschehen sie wahrnehmbarer, expliziter. Rasanter wäre das falsche Wort, weil man den Bereich des Ambient hier nicht verlässt, dennoch hat sich das Tempo hier erhöht. Aufgrund der Sounds, die Serries hier und überhaupt generiert, erwartet man das komplett Verlangsamte, und fühlt sich dann, wenn er sich etwas flotter bewegt, quasi überrumpelt. Es entsteht eine Art Beklemmung, ein Unbehagen, wenn das, was den Hörenden ansonsten entspannen soll, unerwartet Spannung erzeugt. Und schon ist man gefangen von den Sounds hier. In „A Soft Glow“ klingt Serries‘ Gitarre wie zwei Orgeln: eine generiert eine deckende Soundscpae im Hintergrund, die zweite im Vordergrund in anderer Tonlage eine Melodie. Hier entsteht der Eindruck erstmals, alles sei zu schnell, obschon es immer noch sehr langsam vonstattengeht, wie Serries seine Gitarre und die Effektgeräte bearbeitet. Man ist verunsichert, fürchtet einen Angriff, als bäume sich da etwas in der Musik auf, um den unbedarften Hörenden zu attackieren, doch dies geschieht nicht, Serries hat das Biest unter Kontrolle, vermutlich windet es sich deshalb so vergleichsweise ungestüm. Für „Evocation“ wechselt Serries die Ausprägung der Sounds, hier klingt die Gitarre wie ein unbestimmtes Instrument in einem nebligen Hallraum, ebenfalls leicht beschleunigt variiert. Anders in „Carved Into Oscillation“, da nimmt Serries das Tempo erstmals heraus. Hier klingt die Gitarre wie dunkler Atem, bald cineastisch, warm, weich, beruhigend, und die Anflüge von Unbehagen sind verschwunden. Mit „Form Reversal“ kehren sie zurück, denn das Stück erhebt sich bedächtig schlängelnd aus dem Abgrund, es entwickelt einen Rausch und ist beinahe melodiös, so wie der Auftakt. Das Quasi-Titelstück „The Stars Sublime“ kommt komplett ohne den Fuzz aus, ohne das Diffuse, ohne Drones: Die Gitarre ist weitgehend klar gespielt, die zweite Ebene erinnert abermals an eine Orgel. Bill Murray erzählt den Teetrinkern RZA und GZA, dass er vor dem Schlafen Kaffee trinkt, damit er dann schneller träumt, und so wirkt „The Might Of Stars Sublime“ ebenfalls ein wenig: Es ist alles etwas beschleunigt, damit man schneller entspannt. Aber wie gesagt, lediglich im Vergleich zu anderen Arbeiten von Serries, für sich gehört ist dies immer noch chillig-schleppendes Gitarren-Drone-Ambient. Schön und entspannend, wenn es im Hintergrund läuft, und umso spannender und detailreicher, wenn man die Konzentration darauf lenkt. Und während man dies liest, hat Serries 393 neue Alben herausgebracht.\n\n\n\nEXPOSÉ REVIEW :\n\nLike its title implies, The Might of Stars Sublime is less a disturbance and more of a step into the floating ambient direction, yet still full of fascinating textures and beautiful looping structures, created using a similar template of electric guitars and a massive number of effects. This one found release as a CD on the German Audiophob label, which specializes in ambient / industrial / experimental music. Like ZDII, the five tracks herein have no cadence or beat, they just flow from one idea to the next, though in a softer more discrete way; there’s nothing really abrasive here, just a gentle flow of sculpted dreamy sonic loops that the listener can immerse themselves in. The five tracks are around ten minutes each give or take a few, and have legible titles that are at once descriptive and inviting, like “Carved into Oscillation,” “Soft Glow,” “Evocation,” or the title track, each perhaps a journey unto its own, offering patches of light and shadow, flowing and muted tonal colors, all within a swirling eddy of textures and graininess. One might find The Might of Stars Sublime to be an easier journey with less of an overt industrial feel, a bit more melodic perhaps, expressive though still shrouded in mystery.\n\n\n\nVER SACRUM REVIEW :\n\nCon The Might Of Stars Sublime, il suo debutto per l’etichetta tedesca Audiophob, Dirk Serries firma un ritorno che è anche un’uscita: un allontanamento dall’umano per abitare la rarefazione cosmica dell’ascolto puro. Qui la musica non racconta nulla, ma assorbe tutto. Limitato a 300 copie, il disco stesso è già un oggetto di ritiro, un frammento per iniziati. In un’epoca ossessionata dalla moltiplicazione, Serries sceglie la sottrazione radicale: una serie di brani che non cercano il centro, ma orbitano pazientemente intorno a un vuoto generativo. È ambient, sì — ma non come sottofondo: come orizzonte. Un orizzonte che si muove lentamente, troppo lentamente per lo sguardo frettoloso, ma perfettamente visibile a chi ha smesso di cercare. Il titolo stesso, The Might Of Stars Sublime, non è una metafora: è un invito a perdersi in una vertigine luminosa che non abbaglia, ma seduce con lentezza. Serries lavora per erosione. Ogni suono pare levigato dal tempo, come se provenisse da una fonte che ha suonato per eoni, fino a diventare pura presenza. Non ci sono accensioni, non ci sono cadute: c’è una stasi che pulsa, che respira con un ritmo disumano e necessario. Il minimalismo che pervade l’album non è scelta stilistica, ma atto esistenziale. I suoni si distendono come linee di forza invisibili, tra tensione e abbandono, tra l’eco e l’origine. La grandezza evocata non è teatrale: è cosmologica. Una vastità che si fa prossimità intima, come quando il buio di una stanza coincide con la notte stellata. E proprio qui si annida la forza del disco: nella capacità di evocare un altrove che non è fuori, ma sotto la pelle. Il brano finale, “The Stars Sublime”, è più che un culmine: è una soglia definitiva. Lì Serries chiude il cerchio, o forse lo dissolve. Si tratta del suo brano più trasparente e profondo, un eco affettuosa a quel Microphonics XXIII – there’s a light in vein, ma con una luce più rarefatta, meno terrestre. Non è nostalgia, ma trasfigurazione. Non memoria, ma riemersione di un sentire arcaico, assoluto. In The Might Of Stars Sublime non c’è spazio per la comunicazione, né per la relazione. È un disco per chi ha scelto di non partecipare, per chi ascolta non per sapere, ma per sciogliersi. Serries non ci accompagna: ci abbandona gentilmente in un paesaggio dove tutto è lento, distante, eppure inesorabilmente vicino. È musica che non chiede attenzione, ma sottrazione. Che non vuole essere capita, ma contemplata. Un’opera isolazionista, radicalmente aliena al tempo comune. Una preghiera muta verso un cielo che non risponde. Ma che continua, ostinatamente, a brillare.\n\n\n\nSALT PEANUTS REVIEW :\n\nThe Might Of Stars Sublime is Serries’s solo electric guitar album that expands his minimalist ambient music, now with a motherboard of analog pedals and often colored with delicate, noisy, and distorted effects. The album was recorded at Serries’ home studio between July and August 2024, and its title is taken from Johann Wolfgang von Goethe’s poem «The Bliss of Absence» («…Powers eternal, distance, time, / Like the might of stars sublime,…»). The five pieces were created spontaneously and are expansive, accumulate to a bigger whole, and enjoy a rare kind of nocturnal, deep space harmonies. The last one, «The Stars Sublime», suggests the most beautiful and peaceful territory of this journey.\n\n\n\nAMBIENT LANDSCAPE REVIEW :\n\nDirk Serries’ latest excursion serves up soft, layered, sculpted loops combined with floating textures which meld into deeply flowing melodic tones as five distinct aural pathways forge an ambient landscape along a serendipitous sonic journey.\n\nIt presents the listener with a calming and sustaining collection of beautiful atmospheres (with an occasional, subtle, feedback-oriented growl).\n\nMr. Serries, while still (undoubtedly) striving for the next rung on the ethereal ladder, has perfected the craft of guitar drone-scaping (along with layering effects) and has cemented his “star, sublime” into the annals of outstanding ambient axe-men. Standout tracks (for me): Carved Into Oscillation & A Soft Glow. In a word . . . “Wonderful!”\n\n\n\nSPONTANEOUS MUSIC TRIBUNE REVIEW :\n\nTego artystę i dark ambientowy wątek jego twórczości nie trzeba na tych łamach komukolwiek przedstawiać. Muzyk, który kilka lat temu twierdził, że ambient to przeszłość, zdaje się w ostatnim czasie dostarczać coraz więcej nagrań w zadanej estetyce. Wszystkie je namiętnie śledzimy i rekomendujemy trybunowym fanom. Dziś produkcja domowa z lata ubiegłego roku. W kategorii dark ambientu taka, którą zwykliśmy określać mianem wzorcowej dla tej stylistyki.\n\nPośród pięciu opowieści żadna nie ma oczywiście początku ani końca, płynie soczystą strugą gitarowego ambientu. Pierwszą z nich tworzą trzy wątki – krystaliczny ambient, warstwa codziennego kurzu i brudu, wreszcie basowa struga o zaskakująco kojącym zabarwieniu. W drugiej odsłonie narracja zdaje się być bardziej mroczna, płynie z głębin bezkresnego oceanu. Z czasem rozmywa się, odsuwa w cień. Otwarcie trzeciej historii jest ciepłe, niemal relaksacyjne. Rozbudowana warstwa szumu stawia jednak znak zapytania i skutecznie dominuje w dalszej części utworu. Czwarta część wydaje się sprasowana, matowa, przefiltrowana przez grubą kotarę teatralną. Szorstki flow ma jednak nieoczywistą intensywność. Wreszcie finałowa, łagodna, pożegnalna meta ballada, z nowym wątkiem, który brzmi jak nagie struny gitary. Smutna opowieść jednocześnie narasta i rozlewa się coraz szerszym korytem. Potem umiera w dalece metafizyczny sposób.",
      "license": "all rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a0356984572_0",
      "trackinfo": [
        {
          "title": "A Soft Glow",
          "duration": "09:48",
          "lyrics": null
        },
        {
          "title": "Evocation",
          "duration": "09:52",
          "lyrics": null
        },
        {
          "title": "Carved Into Oscillation",
          "duration": "07:27",
          "lyrics": null
        },
        {
          "title": "Form Reversal",
          "duration": "07:38",
          "lyrics": null
        },
        {
          "title": "The Stars Sublime",
          "duration": "10:34",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://dirkserries.bandcamp.com/album/invincible-time",
      "title": "Invincible Time",
      "artist": "Martina Verhoeven/Luis Lopes/Dirk Serries",
      "classification": "paid",
      "tags": [
        "Experimental",
        "ambient",
        "freejazz",
        "improvisation",
        "minimal",
        "Antwerp"
      ],
      "item_id": 1590997348,
      "datePublished": "23 Mar 2025 00:00:00 GMT",
      "about": "Recorded live in concert on May 2nd, 2023 at Oude Klooster Chapel, Brecht, Belgium. Mixed and mastered by Dirk Serries.",
      "credits": "released March 23, 2025\n            \n            Martina Verhoeven - Crumar Piano\n\nLuis Lopes - Guitar\n\nDirk Serries - Guitar\n\n\n\nArtwork by Colin Webster.\n\n\n\nOriginally released on Raw Tonk Records.\n\n\n\n\"Invincible Time brings together three wilful free improvisers into the beautiful resonance of the Oude Klooster chapel in Brecht, Belgium. Partners in life and music - Belgian pianist Martina Verhoeven, who plays on the vintage-sounding Crumar electric piano, and guitarist Dirk Serries with Portuguese guitarist Luis Lopes, in his first-ever recorded document with prolific Serries or Verhoeven. The album was recorded live in May 2023 and was released by the Raw Tonk label of Serries’ frequent collaborator, British sax player Colin Webster, who did the cover artwork.\n\n\n\nSerries, and his musical comrades - Webster, and fellow Portuguese bassist Gonçalo Almeida, like the resonant qualities of the Oude Klooster chapel, and recorded several albums there in the last few years. Invincible Time is a 50-minute free improvisation that focuses on the unique tonalities and the musicians' distinct approaches/ \n\n\n\nIt begins with the lush, jazzy floating sounds of the Crumar piano, gently caressed by the electric guitars of Serries and Lopes, still searching for the right vibe. But about ten minutes later, the atmosphere alternates to an intense, heated one. Verhoeven pounds the vintage keyboard and squeezes alien sounds out of it, while Serries and Lopes begin the first guitar duel when Serries suggests, abstract, free-associative gestures and Lopes introduces noisy, metallic lines. But a few minutes later the trio explores an almost silent, distorted ambient drone, and soon after oscillates its dynamics into dense and frenetic, explosive clusters, and again, to a breezy jazz guitar duet. Verhoeven, Serries, and Lopes do not attach themselves to any of these sonic options, and as soon as they exhaust investigating these possibilities they move on, eager to expand this restless conversational interaction. It ends with a quiet, peaceful, and meditative coda.\n\n\n\nSerries calls this eventful improvisation “a nightmare-ish live soundtrack to a fictional David Cronenberg movie”. It certainly is an uncompromising, nervous, fast-shifting, and risk-seeking exploration of the art of the moment.\" Eyal Hareuveni/Percorsi Musicali\n\n\n\n\"Martina Verhoeven is something of a polymath. A bass player who has received worldwide acclaim for her photography, she now focusses instead on piano. She cites Morton Feldman and Salvador Dali as influences. Lisbon-based composer and improviser Luis Lopes came to jazz from the world of rock and punk. He plays sax and guitar (guitar, here) and has worked extensively with other improvising musicians. Belgian-based sound artist Dirk Serries has been working in the world of experimental music for over three decades (his early, dark ambient work was released under the pseudonym vidnaObmana). In recent years, influenced by the work of Derek Bailey, he’s turned his attention to guitar-centred free improvisation, becoming a significant figure in the Belgian free improv scene. He’s also curator of the A New Wave of Jazz Bandcamp label.\n\n\n\nRecorded live at concert at Oude Klooster Chapel, Brecht, Belgium, back in May 2023, the music of Invincible Time consists of a single, 50-minute track. It begins with some quiet conversation between the guitars, with the odd laconic intervention from the piano. Five minutes in, it all turns busier, only to turn back into a world akin to the beginning a few minutes later. This becomes a pattern, although the music never returns to quite the same place: the next busy section is more percussive and, when it next subsides, it explores the long, sustained attacks of bowed guitar-notes. About ten minutes from the end, the music builds up to a dense, noisy climax, only to fall away into a series of piano chords which unfold over bowed guitar drones, music which feels like the only possible response to that which preceded it. There is a sense of having been on a journey and – as it should be – arriving at a very different place to where it began.\n\n\n\nThe Crumar piano is a great choice to go with two guitars and all three musicians really push the textural possibilities it throws up to the limit: the sound-world is such that sometimes it’s difficult to tell which sounds come from which instrument. And it’s as effective in the more intimate, contrapuntal music as it is in the noisier, more monumental sections. A great listen.\"  internationaltimes.it\n\n\n\n \"Belgijski gitarzysta Dirk Serries, stały bywalec tych łamów, kontynuuje współpracę z muzykami portugalskimi. Tym razem proponuje spotkanie z gitarzystą Luisem Lopesem, którego również nie trzeba przedstawiać w zadanych okolicznościach gatunkowych. W zgrabnie zaaranżowanym trio spotykamy także Martinę Verhoeven, która dopełnia obrazu nagrania poczynionego w gronie dobrych znajomych trybunowej socjety.\n\n\n\nBelgijka grywała onegdaj na kontrabasie i wiolonczeli, od pewnego czasu jest już na stałe pianistką, okazjonalnie sięgającą po instrument klawiszowy zwany crumar piano, który w omawianym dziś przypadku swym niepowtarzalnym brzmieniem stawia obu gitarzystów w intrygującej sytuacji dramaturgicznej i estetycznej.\n\n\n\nMuzyków odnajdujemy w doskonale nam znanej, koncertowej … kaplicy w Brechcie. Dokumentacja fonograficzna ulepiona jest w jeden trak, ale śmiało w rozbudowanej, pięćdziesięciominutowej ekspozycji możemy wyróżnić trzy, a nawet cztery epizody. Nagranie inicjuje jazzowa gitara, która po niedługiej chwili liczyć może na wsparcie drugiej gitary. Ciepłe, delikatne piano pojawia się w grze po półtorej minuty. Bardzo ciekawie brzmiące otwarcie kojarzyć się może z debiutanckim nagraniem … Return To Forever sprzed ponad półwiecza. Tymczasem opowieść nabiera masy, ale nie tempa. Bardziej energiczne ruchy, szczególnie na klawiaturze, odnotowujemy po mniej więcej siedmiu minutach, z kolej po dwunastu frazy każdego z muzyków stają się bardziej zadziorne, a tempo wreszcie nabiera rumieńców. Nie brakuje dobrych reakcji, a brzmienie wszystkich instrumentów wydaje się w tym momencie dość podobne. Improwizacja staje się rytmiczna, tłusta, z delikatnym posmakiem intrygującej kwasowości. Po upływie siedemnastej minuty gaśnie wprost w niczym niezmąconą ciszę.\n\n\n\nNowy wątek budowany jest bardzo pieczołowicie. Na gryfie gitary Dirka pojawia się smyczek, piano Martiny brzmi wyjątkowo onirycznie, a gitara Luisa cedzi drobne frazy przez zaciśnięte zęby. Martwa ballada trwa kilka chwil, budowana zarówno w niskich partiach gitarowych, jak i wyższych, klawiszowych. Opowieść nabiera odrobiny tempa, pęcznieje też na szerokość. Brzmienie staje się mięsiste, szczególnie piana, niemal post-industrialne i niedalekie od hałasu. W okolicach dwudziestej szóstej minuty następuje kolejne tego wieczorku wystudzenie, tym razem nieoparte na chwili ciszy. Przez pewien czas na scenie panuje wystudzona, leniwa flauta, bez ogniska zapalnego, bez skłonności do podejmowania nowych decyzji dramaturgicznych. Ów martwy taniec przez moment staje się duetem bez Lopesa, opartym na plamach klawisza i gitarowych, suchych akordach. Powrót do tria okraszony jest porcją pick-up’owej elektroniki, ale nie trwa długo, gdyż na kolejne kilka chwil spektakl staje się samotnym udziałem Portugalczyka. Potem wspomaga go Belg.\n\n\n\nBelgijka wraca do rozgrywki wysoko zawieszonymi frazami, a improwizacja w mgnieniu oka nabiera bardziej dynamicznego kształtu. Spiętrzenie jest o tyle intrygujące, iż tym razem każdy z artystów frazuje inaczej, niosąc indywidualną jakość. Po osiągnięciu szczytu flow opada na samo dno ciszy, zgaszony do pojedynczego dźwięku piana. Na końcowe minuty powraca formuła arco, który staje się chyba udziałem obu gitarzystów. Refleksyjne, mroczne oddechy i westchnienia oblepione subtelnym ambientem towarzyszą nam już do samego końca. Na ostatniej prostej trudno nie dostrzec delikatnego, pięknie uformowanego wzniesienia.\" Spontaneous Music Tribune\n\n\n\n“Invincible Time” è un unico lungo brano di cinquanta minuti, registrato il 2 maggio del 2023 presso la Oude Klooster Chapel di Brecht, in Belgio, con la formula atipica composta da un pianoforte (quello di Martina Verhoeven) e due chitarre elettriche (Luis Lopes e Dirk Serries).\n\nMartina Verhoeven è una pianista, nonchè fotografa belga. E' sposata con Dirk Serries e insieme gestiscono l’etichetta free-jazz A New Wave Of Jazz. Ha suonato in divesi progetti tra cui 3 Seconds Of Air, Fantoom, Kodian Plus, Lemadi Trio e Rubicon Quartet. Spesso ìnsieme al marito invitano ospiti illustri a improsvvisare con loro, come nel caso del chitarrista Luis Lopes, da quindici anni tra le menti più brillanti della fervida scena jazz portoghese (Afterfall, Big Bold Back Bone, Guillotine, Isotope Ensemble, Lisbon Connection, Lisbon Freedom Unit, Misanthrope Trio, String Theory, Vine Leaf).\n\nL’inizio della lunga improvvisazione contenuta su “Invincible Time” è sospeso ed etereo: il pianoforte suona una morbida melodia intorno alla quale risplendono poche note blues suonate dai chitarristi. Dopo la boa dei sei minuti, lentamente, Lopes e Serries cominciano a rincorrersi inciampando e rialzandosi in un dialogo serrato che crea un climax avvincente.\n\nSuperati i dieci minuti la Verhoeven inizia a percuotere il pianoforte partecipando alla creazione di un muro di suono imponente e carico di elettricità. La tensione sembra poter crescere senza sosta mentre i chitarristi duellano graffiando le armonie con tutti i suoni possibili.\n\nUn silenzio improvviso divide in due parti la lunga improvvisazione, dando la possibilità ai musicisti di far respirare i loro strumenti con lente note volte a creare un drone onirico e apparentemente sospeso nel vuoto. E’ solo la calma prima della tempesta pronta ad esplodere sotto una pioggia di chitarre elettriche che si lanciano in assolo carichi di rumorosa elettricità.\n\nNel lungo finale torna la tranquillità d’inizio brano e il cerchio si chiude.\" Ondarock - Italy",
      "license": "all rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a2216492301_0",
      "trackinfo": [
        {
          "title": "Invincible Time",
          "duration": "50:14",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://dirkserries.bandcamp.com/album/humming-the-earth",
      "title": "Humming The Earth",
      "artist": "Dirk Serries",
      "classification": "paid",
      "tags": [
        "Experimental",
        "ambient",
        "freejazz",
        "improvisation",
        "minimal",
        "Antwerp"
      ],
      "item_id": 2015013928,
      "datePublished": "18 Oct 2024 11:02:34 GMT",
      "about": "Recorded at Kapel Oude Klooster (Brecht, Belgium) on August 13th, 2024. Mixed and mastered by Dirk Serries.",
      "credits": "released October 18, 2024\n            \n            Dirk Serries : electric guitar, effects, amp \n\n\n\nPhotography by Dirk Serries.",
      "license": "all rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a2715797504_0",
      "trackinfo": [
        {
          "title": "Humming The Earth I",
          "duration": "07:17",
          "lyrics": null
        },
        {
          "title": "Humming The Earth II",
          "duration": "07:16",
          "lyrics": null
        },
        {
          "title": "Humming The Earth III",
          "duration": "07:38",
          "lyrics": null
        },
        {
          "title": "Humming The Earth IV",
          "duration": "06:47",
          "lyrics": null
        },
        {
          "title": "Humming The Earth V",
          "duration": "08:44",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://dirkserries.bandcamp.com/album/fog-curtains",
      "title": "Fog Curtains",
      "artist": "Dirk Serries",
      "classification": "paid",
      "tags": [
        "Experimental",
        "ambient",
        "freejazz",
        "improvisation",
        "minimal",
        "Antwerp"
      ],
      "item_id": 1388657095,
      "datePublished": "13 Jun 2025 00:00:00 GMT",
      "about": "All performed real-time at the home studio between\n\nFebruary and June 2024. Mixed and mastered by Dirk\n\nSerries.",
      "credits": "released June 13, 2025\n            \n            Dirk Serries : electric guitar, effects.\n\n\n\nOriginally released on Momentarily Records (tape, 2025)",
      "license": "all rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a2743104949_0",
      "trackinfo": [
        {
          "title": "Part One / Part Two",
          "duration": "19:28",
          "lyrics": null
        },
        {
          "title": "Part Three / Part Four",
          "duration": "18:56",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://dirkserries.bandcamp.com/album/treasure-of-stars-a-streams-of-consciousness-album",
      "title": "Treasure Of Stars - A Streams Of Consciousness Album",
      "artist": "Dirk Serries",
      "classification": "paid",
      "tags": [
        "Experimental",
        "ambient",
        "freejazz",
        "improvisation",
        "minimal",
        "Antwerp"
      ],
      "item_id": 2291782818,
      "datePublished": "25 Feb 2025 00:00:00 GMT",
      "about": "Available from Projekt Records : \n\nprojektrecords.bandcamp.com/album/treasure-of-stars-streams-of-consciousness",
      "credits": "released February 25, 2025\n            \n            The Streams Of Consciousness series is home for Dirk Serries’ gleaming solo ambient work. With over 40 years of sonic experimentation — including his many albums as VidnaObmana — Dirk's TREASURE OF STARS is a return to his trademark melancholic ambient dwellings. Created in real-time on electric guitar and a handful of effects, it’s a shimmering slowflow exploration of textures and emotional states. Transcendent and esoteric soundscapes facilitate moments of solitary reflection.\n\n\n\nProjekt’s 2024 release, STREAMS OF CONSCIOUSNESS COMPILED, was such a success with the label's fanbase that the decision was easily made to return with a new album exclusively recorded for Projekt. The serene tones and expansive – yet mysterious – atmospheres are constructed live solely on the electric guitar. Individual notes and reverberating washes ebb and flow over the course of these longform pieces. \n\n\n\nFor those who wished VidnaObmana was still around releasing albums, the wait it over. This release invites repeated listenings as one is gently rocked by warm, starlit washes of sound.\n\n\n\n\n\nPress excerpts from 2024:\n\n\n\n• A slowflow inner exploration of sonics and emotional states… Dirk Serries’ homage and return to pure harmonic sonic moments. This music is purely ‘in-the-moment’ ambient.\n\n\n\n• The sounds here are gentle ambiance with slow-moving chord patterns, airy textures, and a peaceful mood.\n\n\n\n• Despite the apparent simplicity of the music, it resonates deeply on an emotional level, inviting the listener to engage in relaxed, thoughtful introspection.\n\n\n\n• Serries constructs serene soundscapes that facilitate moments of solitary reflection. He engages with the notion that the notes you do not play can be just as important as the notes that are played, thus using space as an auxiliary instrument.\n\n\n\n• At times while listening I feel like I’m floating in deep space, at others that I am a piece of driftwood being gently rocked by ocean waves, and at still others it’s as if I’m lying stretched out in the grass, the sun gently warming my face as I watch puffy white clouds slowly drifting by.\n\n\n\n• Slow flowing evolutionary washes of sonic color full of warmth and emotion. \n\ncredits\n\nreleases February 28, 2025\n\n\n\nAll streams performed and recorded at the home studio throughout 2024, exclusively for Projekt Records.\n\n\n\nDS : electric guitar, effects \n\nwww.dirkserries.com   streamsofconsciousness.bandcamp.com\n\n\n\n Video for \"Other Transformations\":  www.youtube.com/watch?v=S_3Ny_tI2OM\n\n\n\n 2024 release from Dirk’s Streams Of Consciousness \n\nprojektrecords.bandcamp.com/album/streams-of-consciousness-compiled\n\n\n\n\n\n REVIEWS :\n\n\n\n\"Listening to this album offers one an opportunity to practice non-attachment; to attend carefully to each moment that passes, exploring its unique contours and textures with the wide-eyed wonder of beginner’s mind; but then to let it pass into the next, as it must, without grasping at it frantically. Listening here one simply floats, serene and complete; a part of it all, but shackled to none.\" Dave Aftandilian\n\n\n\n\"Dirk Serries has once again figured out a way to pull our [ambient] strings!\n\nHis latest offering, ‘Treasure of Stars’ (releasing February 28th), creates a sonic mosaic of intricate ambient sound. Serries at once presents dreamy, melancholy waves of ethereal isolation; wielding his ambient “axe” to build an intangible wall of delicious quietude and dividing intentional spareness from the larger elemental body of enveloping ambience.\n\n“Other Transformations” is the standout track for me personally; with the entire album embodying a sublime reflection of Dirk’s ability to transport the listener’s attention into a personal space of solace.\n\nBeautiful and . . . evocative\" Ambient Landscape",
      "license": null,
      "coverUrl_0": "https://f4.bcbits.com/img/a0520445854_0",
      "trackinfo": []
    },
    {
      "url": "https://dirkserries.bandcamp.com/album/low-volume-music",
      "title": "Low Volume Music",
      "artist": "Steve Roach &amp; Dirk Serries",
      "classification": "paid",
      "tags": [
        "Experimental",
        "ambient",
        "freejazz",
        "improvisation",
        "minimal",
        "Antwerp"
      ],
      "item_id": 2403202848,
      "datePublished": "03 Apr 2025 00:00:00 GMT",
      "about": "concept, music and production : Steve Roach & Vidna Obmana\n\nphotography by Martina Verhoeven\n\ndesign by Sam Rosenthal\n\n\n\nOriginally released on Projekt Records (cd, 2012)",
      "credits": "released April 3, 2025\n            \n            A review from textura.org:\n\nHaving previously recorded six full-length releases for Projekt between 1995 and 2005, Steve Roach and Dirk Serries (formerly vidnaObmana) reconvene after a long hiatus for Low Volume Music, an aptly titled hour-long set of finely calibrated minimalism. Don't be fooled by the album title: its five pieces aren't pitched at a level of near-inaudability but instead declare their ethereal character with ample presence. Introspective and harmonious by design, the tracks unfurl in slow-motion, their loops rising and falling like the breathing patterns of a sleeping infant.\n\n\n\nThough no instrumentation details are provided, one presumes that the tracks, which range between eight and fifteen minutes, blend the soft hum of Roach's electronic textures with the calming washes of Serries' guitar playing, and the resultant effect is both meditative and soothing. It's the sum-total of sound that's more important here than the individual components, however, and most importantly the calming effect the flowing sound mass generates. Admittedly, played at a low volume, the pieces would merge with the environment, given their seeming stasis, but played at a higher volume, they produce no small amount of stimulation. There are moments, especially during the fifteen-minute closer “Haze,” when the music could be mistaken for a meditative Fear Falls Burning piece—not that that surprises, given Serries' involvement in the Low Volume Music project.\n\n\n\nRepresentative of the album's tone is “Whisper,” whose limpid swirls and softly shimmering textures exhale ever so gently for thirteen minutes. The penultimate “Bow” breathes as placidly, with Serries' micro-guitar shadings heard fluttering within an opaque, oft-crystalline cloud mass after which “Haze” drifts ever so slowly, filling the room as aromatically as incense. Admittedly, there's nothing revolutionary about Low Volume Music—no governments will topple nor regimes collapse following its release. But there is something thoroughly satisfying about two experienced practitioners pooling their considerable talents to bring a classic set of deep ambient moodscaping into being.",
      "license": "all rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a2947795729_0",
      "trackinfo": [
        {
          "title": "Here",
          "duration": "08:01",
          "lyrics": null
        },
        {
          "title": "Whisper",
          "duration": "12:44",
          "lyrics": null
        },
        {
          "title": "Closed",
          "duration": "08:12",
          "lyrics": null
        },
        {
          "title": "Bow",
          "duration": "14:28",
          "lyrics": null
        },
        {
          "title": "Haze",
          "duration": "15:14",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://dirkserries.bandcamp.com/album/arbor",
      "title": "Arbor",
      "artist": "Dirk Serries",
      "classification": "paid",
      "tags": [
        "Experimental",
        "ambient",
        "freejazz",
        "improvisation",
        "minimal",
        "Antwerp"
      ],
      "item_id": 2079963712,
      "datePublished": "20 Oct 2024 11:13:08 GMT",
      "about": "Recorded, mixed and mastered at the home studio, December 2023 - January 2024.",
      "credits": "released October 20, 2024\n            \n            Dirk Serries : electric guitar, effects.\n\n\n\nPhotography by Dirk Serries.",
      "license": "all rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a1716907841_0",
      "trackinfo": [
        {
          "title": "Simple Origin",
          "duration": "21:36",
          "lyrics": null
        },
        {
          "title": "Court Unit",
          "duration": "13:28",
          "lyrics": null
        },
        {
          "title": "Cart Trail",
          "duration": "09:27",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://dirkserries.bandcamp.com/album/magnetar-2",
      "title": "Magnetar",
      "artist": "Dirk Serries &amp; Trösta",
      "classification": "paid",
      "tags": [
        "Ambient",
        "Drone",
        "Experimental",
        "New Age",
        "ambient",
        "freejazz",
        "improvisation",
        "minimal",
        "Antwerp"
      ],
      "item_id": 3711223870,
      "datePublished": "27 Aug 2024 00:00:00 GMT",
      "about": "Available through Projekt Records : \n\nprojektrecords.bandcamp.com/album/magnetar",
      "credits": "released August 27, 2024\n            \n            Belgians Dirk Serries & Trösta (the nom de plume of Nicolas Lefèvre) release their second album of ambient drone. What sets MAGNETAR apart from many others in the genre is Trösta's melodic alto saxophone. Warmly phrased, the saxophone spreads its serene and graceful melody, washed in reverb, flowing in long, engulfing phrases. Don’t think about the jazz use of the sax but consider it as a warm analog wind instrument that moves above, underneath and along with the expansive guitar soundscapes. \n\n\n\nSerries began the project with electric guitar and effects; performed live in the studio, he received a duet in return. The results are elaborate soundscapes: a symphony of lyricism, depth and nuance. It’s a solace drenched in melancholy and light, organically made by the hands of talented musicians. The 102-minute album expands their unique sonic universe, creating a beautiful, harmonic and moody blend. Music created on the spot showcases how naturally their two worlds blend. \n\n\n\nAVANT MUSIC NEWS wrote of their debut, \"Serries, who has also recorded and performed under his VidnaObmana and Fear Falls Burning pseudonyms, returns to his signature sound on this duo effort with Trösta on alto sax. Credited with electric guitar, Serries provides… layers of soft drones that gently reshape themselves. To this, Trösta adds plaintive and exploratory themes. Whether merging with the drones or serving a contrast thereto, these melancholy lines evoke a wistful and peaceful sadness... The result is not quite ambient, and neither dark nor light. Instead, it is a strangely moving set of long-form pieces that capture the emotions of the moment.”\n\n\n\nLUMINOUS DASH wrote of their debut, “The two musicians produce a rich and compelling sound palette... Trösta colors the sonic swells in an impressive way with his saxophone. The duo immerses the listener in beneficial cosmic atmospheres that convey a soft timbre of melancholy.\"\n\n\n\nA subtle contrast is created between the fine, graceful brushstrokes of the saxophonist and the ever-transforming surfaces of the electric guitarist. Within a subtle cloud of sound, Trösta feels at home with his light, intimate playing as these two artists keep each other in balance walking together on a tightrope across a deep, dark chasm. \n\n\n\nCREDITS: Recorded live, including all spatiotemporal effects at Sunny Side Studios between 2021-2023. Electric guitar, alto saxophone and electronics by Dirk Serries and Trösta. Mixed and mastered at Sunny Side Studios, Anderlecht.\n\n\n\nPhotography by Martina Verhoeven  \n\n\n\nmartinaverhoeven.com\n\n\n\n  dirkserries.com\n\n  trosta.bandcamp.com\n\n\n\n \"A magnetar is a neutron star with an incredibly powerful magnetic field, such that as it decays it powers the emission of high energy electromagnetic radiation, and in particular x-rays and gamma rays. No need to worry about that here, this magnetar is completely safe and won’t harm your hearing, vision, or internal cell structure — no danger at all. In fact, being in the vicinity of this Magnetar is a relatively gentle and calming experience, though it is warm, a combination of ambient and melodic elements that cover the listener like a warm blanket on a cold autumn night under the stars. Dirk Serries should be well known to Exposé readers — we interviewed him years ago when he was using the moniker VidnaObmana to release his own work, as well as many collaborations with the likes of Steve Roach, Stratosphere, Asmus Tietchens, PBK and numerous others over a 40-plus year career. Trösta is Belgian saxophonist Nicolas Lefèvre, an outstanding player but relatively unknown, though we did review his 2021 collaboration with Serries titled Island on the Moon. On the ten improvised tracks at hand, Serries provides a heavily effected ambient guitar backdrop to the proceedings, while Trösta provides the melodies on alto sax with a mild amount of studio reverb. The sax is always clearly audible as such, while the same can’t be said for the expansive guitar sweeps, which often sound more like a wall of synthesizers, but the combination that they present together is always graceful, forceful, and melodically striking, though never harsh or abrasive in any way. For those who need categorizations, one might say it’s a mix of floating ambient and melodic jazz working together seamlessly, weaving in and out of a cosmic atmospheric fabric, each track around ten minutes in length, give or take a few minutes, and all together the album comes to well over 100 minutes. While there is definitely too much going on here to make it suitable for slumber, it’s a perfect soundtrack for relaxation and meditation.\" Exposé\n\n\n\n\"De Belgische jazzgitarist Dirk Serries is een man van vele gezichten – meestal maakt hij geïmproviseerde, buitengewoon avontuurlijke muziek waar je als luisteraar scherp en aandachtig naar moet luisteren als je niets wilt missen, maar in de samenwerking met Trösta (saxofonist Nicolas Lefèvre) gebeurt er iets anders, want hier wil je als luisteraar vooral lui gaan liggen en je laten meedrijven op de muziek. Magnetar is misschien wel het meest toegankelijke album dat Serries ooit maakte, waarbij hij met zijn elektrische gitaren en effecten een soundscape creëert waarop Trösta met zijn warme altsaxofoon lange, goddelijke melodieën neerzet, in een perfect duet. Tien lange stukken van rond de tien minuten per stuk vind je hier, en dan heb ik er eerlijk gezegd nog lang niet genoeg van. Muziek om bij te ontspannen, maar zeker geen simpele ambient soundscape, daarvoor valt er te veel te ontdekken als je goed luistert. Een aanrader.\" Moors Magazine",
      "license": null,
      "coverUrl_0": "https://f4.bcbits.com/img/a4081528159_0",
      "trackinfo": []
    },
    {
      "url": "https://dirkserries.bandcamp.com/album/the-invisible",
      "title": "The Invisible",
      "artist": "Dirk Serries/Rodrigo Amado/Andrew Lisle",
      "classification": "paid",
      "tags": [
        "Experimental",
        "ambient",
        "freejazz",
        "improvisation",
        "minimal",
        "Antwerp"
      ],
      "item_id": 1980927295,
      "datePublished": "26 Jun 2024 00:00:00 GMT",
      "about": "Performed, recorded, mixed and mastered at the Sunny Side Inc. Studio, Anderlecht (Belgium) on November 22nd, 2021.",
      "credits": "released June 26, 2024\n            \n            Dirk Serries : archtop guitar\n\nRodrigo Amado : tenor saxophone\n\nAndrew Lisle : drums\n\n\n\nFront cover by Rodrigo Amado.\n\nDesign by Rutger Zuydervelt.\n\n\n\nOriginally released on Klanggalerie, 2024.\n\n\n\nREVIEWS :\n\n\n\n\"\"***** For me this trio is a magisterial example of energetic synergy or synergetic energy. What I particularly like in the music is the not-so-common combination of instruments; archtop guitar, tenor saxophone, and drums. They play three relatively long tracks, all with changing moods and climates, but all at the very end in the tradition of the best of the best hymn of John Coltrane and Davis S. Ware. The starting \"New Tone\" perfectly illustrates my comments. The second \"Tapestry\" is my favorite. It starts asab½n a melancholic free ballad but attains amazing power in the following. It is the longest track, lasting 23 minutes and including fantastic duos and solos by Dirk Serries and Andrew Lisle. The album closes with the title\n\ntune, \"The Invisible\", lasting nearly 18 minutes. In addition to Coltrane and Ware, also the spirit of Sonny Rollins seems to inspire Rodrigo. The track is notable for particularly impressive changes in moods. Outstanding album, period!!!\" MACIEJ LEWENSTEIN\n\n\n\n\"At first blush, this seems like an odd meeting of minds. Belgian Dirk Serries is as well known for his ambient synth work as his free improv. Rodrigo Amado is a central figure in the Portuguese jazz scene and Andrew Lisle has played with a long list of musicians from his native British Isles as well as the European mainland. While every pairing of two out of these three has previously been recorded, this is their first joint effort. Amado leads the trio with both outside and lyrical playing, while Serries aggressively strums his undistorted electric. Lisle can be both subtle and overt, lurking in the background and then surfacing with unstructured lines that lead the others into new spaces. The Invisible is an enjoyable document that blends free jazz tropes with abstract guitar and versatile drumming in new and compelling ways. It was released on June 28 by Klanggalerie.\" AMN\n\n\n\n\"Belgian prolific experimental guitarist Dirk Serries has worked separately with Portuguese sax hero Rodrigo Amado (the duo album Jazzblazzt, Raw Tonk/Klanggalerie, 2020) and in many more formats with British drummer Andrew Lisle, as a duo, The Kodian trio with sax player Colin Webster, or with sax player John Dikeman and double bass player John Edwards. Amado played with Lisle when he resided in Portugal. The Invisible is the debut trio album of Serries, Amado and Lisle, recorded after three performances at the Sunny Side Inc. Studio in Anderlecht in November 2021. Amado, who is also a gifted photographer, took the cover photo. The Invisible offers three extended pieces that adopt free jazz dynamics and led by the warm tenor sax tone of Amado, with the abstract and more ethereal guitar lines of Serries and the intuitive, free pulse of Lisle. It is clear that the already-established bond between these master improvisers informs the trio’s dynamics and opens the music for more sonic adventures. The trio patiently and organically alternates with tension building and release, and swinging from the melodic and lyrical to the fiery and thorny. There is a lot of space in these extended pieces for individual courses, just as Amado’s cover photo suggests.\" SALT PEANUTS\n\n\n\n\"The truth is that the Austrian Klanggalerie is more associated in my mind with reissues from various experimental and non-experimental groups of the 80's in particular, classic favorites from groups like Nocturnal Emissions or Non Toxic Lost but also several classic Ralph's groups of the Residents like the albums of Snakefinger or Renaldo and the Loaf. I didn't associate it so much with free jazz or improvisation until the recent release of The Invisible, a recording by the trio of Rodrigo Amado, Dirk Serries and Andrew Lisle. The latter two are also members of the amazing Kodian Trio along with Colin Webster on saxophone. But if Kodian have a rougher sound for hours because of Webster, here the saxophone has a different tone, I would call it 'sweetness'. Not that Amado doesn't play wild, he has proven it several times anyway, and he proves it on this recording, but this different tone also creates a different style in the music they play. Intense and wild where it needs to be and more calm and enjoyable at other times. What I really liked about this album is that each musician leaves room for the other to express themselves and they complement each other sonically without creating any confusion. Also, where all three of them forge on, they play amazingly without overlapping just to play loud. This is one of those albums that I like to put on and get lost in my thoughts or just ramble while listening to this amazing music. You also need that feeling for hours and hours and if anything here they manage to create such a fantastic atmosphere!\" Nicholas Malevitsis – Mic, August 2024\n\n\n\n\"Quando si discute di jazz improvvisato o di free jazz in Europa allora non si può non citare il sassofonista portoghese Rodrigo Amado, autorevole esponente di questo ambito come dimostra il recente album Beyond The Margins, inciso, per la Trost Records, dal quartetto the Bridge dove, con accanto ad Amado al sax tenore, troviamo Alexander Von Schlippenbach al pianoforte, Ingebrigt Håker Flaten al contrabbasso e Gerry Hemingway alla batteria e voci, qui trovate la recensione mentre colgo l’occasione per ribadire quanto ho già scritto in un apposito post di questo blog, ovvero che da poco è stata pubblicata una versione in vinile di questo album che include una traccia non presente sia nella versione cd che nella versione digitale. Tornando all’oggetto di questa recensione va detto che la formazione di questo trio è la conseguenza di un primo incontro tra il chitarrista sperimentale belga Dirk Serries e Amado. La loro collaborazione, esplicatosi con un paio di concerti dal vivo che portarono alla pubblicazione di una audio cassetta, a cui seguì la relativa versione in cd, rilevò anche la inevitabile necessità che al duo si aggiungesse una batterista e la scelta cadde su un musicista conosciuto da entrambi e da entrambi apprezzato: l’inglese Andrew Lisle. Il trio dopo alcuni concerti ha inciso il 22 novembre 2021 al Sunny Side Studio di Anderlecht in Belgio questo album pubblicato lo scorso 28 giugno 2024. Tre i brani inclusi nella selezione, tutti di lunga durata, dai 15,59 di “New Tone” ai 23,08 di “Tapestry” passando per i 17,37 della title track, che rivelano a chiare lettere il layout espressivo del trio che esprime un jazz libero, ricco di energia espressiva, mutevole nel ritmo e nella dialettica interattiva e che mostra i tre musicisti impegnati in un costante dialogo.\n\n Amado appare come il fulcro ideatore di questa dialettica, l’elemento che conduce, che traccia il percorso, il suo sax sa essere sinuoso e dirompente, lirico e incalzante mentre incrocia i contrappunti della chitarra semiacustica di Serries, una tipica chitarra archtop nata per suonare il jazz. Serries da un’interpretazione straordinariamente versatile del suo strumento nello svolgimento dei tre brani ed in particolare nei dialoghi a due, nell’improvvisazione e come ho già detto nel contrappunto. Di Lisle non posso non dire che è l’elemento di cui il duo aveva bisogno, il suo drumming denuncia un’urgenza espressiva debordante che arricchisce il suono del trio. La selezione si apre con “New Tone” fraseggio incalzante di Amado e contrappunti chitarristici di Serries nonché drumming debordante di Lisle, ritmo che prima lievita poi tende a placarsi per mutare in una ballad dove il sax lirico di Amado da luogo ad un rarefatto dialogo con la batteria di Lisle. “Tapestry” ripropone nell’intro ancora il sax lirico di Amado ma presto il ritmo lievita e il dialogo fra i tre musicisti è fitto e dal ritmo incalzante. E ancora tra pause rarefatte, dialoghi a tre e a due, arrivano i suoni eterei e ricercati che spezzano il ritmo. Si chiude con la title track, un riff del sassofono che si sviluppa prima in crescendo poi rallentando, lasciando così spazio ad un solo di batteria. A seguire porzioni improvvisative e ancora sono i suoni ricercati quelli che, complice l’elettronica, chiudono il brano. Album certamente da ascoltare, per apprezzare e capire questa originale formazione tutta europea.\" Scrivere Di Jazz - Italy\n\n\n\n\"4,5/5 rating !! O que poderemos esperar do resultado de uma colaboração entre o guitarrista belga Dirk Serries, o saxofonista português Rodrigo Amado e o baterista inglês Andrew Lisle? Muito. Tudo. Se o podíamos antecipar, dadas as credenciais dos três, o resultado do labor do consórcio supera as expetativas. “The Invisible”, acabado de lançar pela Klanggalerie, é a prova de como a música improvisada muitas vezes subverte a lógica aritmética, catalisando interações, vindo o cômputo superior à soma das parcelas. Poderia não ser assim, mas a teia de relações e cumplicidades é pivotal para o que se escuta. «É essa a beleza da cena da improvisação e do jazz livres», começa por dizer Dirk Serries em conversa com a  jazz.pt.  «Na sua maior parte, é uma comunidade com muitos jogadores de equipa. E quando a música se encaixa, automaticamente voltamos a juntar-nos. Quando o Rodrigo e eu tocámos aquele concerto em duo, que aconteceu de forma tão espontânea devido a um dia livre na agenda de ambos, encontrámos um espírito afim que o tornaria suficientemente interessante para continuarmos.» Ao longo do álbum fica clara a complementaridade particular entre os três. Serries concorda: «Três linguagens musicais diferentes que nos impulsionaram a criar uma nova. Dando-lhe um lugar descontraído neste trio para experimentar coisas diferentes e talvez até sair das zonas de conforto.»\n\n\n\nArtista multifacetado, Serries está na linha da frente dos guitarristas experimentais europeus, explorando há quatro décadas o difuso campo entre a vanguarda, o industrial, o experimental e o ambiental. Lançou os seus primeiros trabalhos sob o pseudónimo vidnaObmana até 2007, altura em que encerrou este projeto, deixando uma extensa discografia. Interessado sobretudo no jazz de feição mais livre, passou em certo momento a focar-se na improvisação, principalmente na guitarra, de uma crescente abstração, fortemente influenciado por Derek Bailey. Muito ativo nacional e internacionalmente, Amado é um dos mais relevantes saxofonistas na cena do jazz vivo e desafiante, desdobrando a sua atividade por diversas formações e configurações instrumentais. Nos tempos mais recentes, avultam o soberbo “Refraction Solo (Live at Church of The Holy Ghost)” e “Love Ghosts”, ambos de 2022, este último com trio The Attic (onde oficiam também Gonçalo Almeida e Onno Govaert) e “Beyond the Margins” (2023), do superlativo quarteto The Bridge, com Alexander von Schlippenbach, Ingebrigt Håker Flaten e Gerry Hemingway. Quase a chegar está “La Grande Crue”, em que ao trio The Attic se junta a pianista francesa Eve Risser. Nascido e criado em Northumberland, Andrew Lisle vive atualmente em Londres. O seu toque é rápido e altamente textural, repleto de complexidade rítmica, fazendo dele um membro muito requisitado na fértil comunidade do jazz e da música improvisada. Tão propulsivo como abstrato, Lisle tem trabalhado com muitas vozes importantes na cena musical improvisada do Reino Unido e do resto da Europa.\n\n\n\nAmado e Serries juntaram-se para apresentações ad-hoc em duo no verão de 2018 (o resultado está numa edição esgotada em cassete na Raw Tonk e em CD na Klanggalerie). O rastilho estava aceso. Ficou claro para ambos que poderiam continuar como trio, faltando apenas um baterista para completar um xadrez instrumental que não sendo inaudito, também não abunda. (Entre os trios de saxofone-guitarra-bateria, Serries destaca o de Derek Bailey com Han Bennink e Evan Parker; por seu lado, Amado aponta como referência o de Joe Lovano, Bill Frisell e Paul Motian.) A escolha não demorou: Lisle, baterista de «estilo único», como se lhe refere Serries, que ambos conheciam e com quem partilhavam afinidades estilísticas e criativas. Guitarrista e baterista – juntamente com o saxofonista Colin Webster – formaram o Kodian Trio e Amado conheceu e tocou com o britânico quando este residiu durante algum tempo em Lisboa. A preparação para a sessão de estúdio incluiu uma pequena digressão de quatro concertos. «Este estúdio em Anderlecht é perfeito para este tipo de trios ao vivo», explica o guitarrista. «Embora os concertos ao vivo ajudem definitivamente a encontrar o nosso “estilo”, ir para estúdio nem sempre é fácil, uma vez que a situação ao vivo é algo que não se pode imitar. Só temos de encontrar outra forma de o fazer funcionar», acrescenta. «Conhecíamos os estilos uns dos outros. Era apenas uma questão de encontrar o ponto ideal onde nos sentíssemos confortáveis enquanto trio», sublinha o belga. «Gosto quando um trio como este trabalha a inspiração em todas as direções.»\n\n\n\nA música do trio, sem rede, explora a amplitude de possibilidades propiciadas pelo formato, tirando partido das particularidades do som de cada músico. Ao saxofone fortemente enraizado na tradição do jazz de Amado (num jogo de sucessivas aproximações e distanciamentos), juntam-se a guitarra abstrata e textural – em diferentes registos – de Serries e a bateria versátil de Lisle, uma espécie de ponte que une os diferentes contributos. O trio logra uma notável gestão da tensão, em vários planos, apostando em sinusoides de acumulação e libertação. O resultado pode soar mais etéreo (não raras vezes melódico) ou mais abrasivo, sem perda de foco ou coerência. As três peças que apresentam, todas relativamente longas, desnudam diferentes atmosferas, em permanente mutação. “New Tone” logo estabelece o alto padrão energético, com os três instrumentos a desenvolverem as suas linhas em permanente articulação. Amado sopra com foco e assertividade, com um olho no som dos mestres e outro na exploração de novas possibilidades. Serries trabalha harmonias e texturas e Lisle tanto fornece intensa propulsão como é capaz de desacelerar e oferecer precisão e detalhe. A dado momento, tudo se aquieta e Amado traz um discurso mais sereno e espiritual (veio-me à memória o derradeiro concerto em solo americano do lendário quarteto de Davis S. Ware, a que assisti na edição de 2006 do Vision Festival, em Nova Iorque), que os outros dois sublinham e contrastam com propósito. Os vuímetros voltam ao vermelho até estabilizarem na secção final, só com guitarra e bateria, conduzindo a peça ao seu clímax.\n\n\n\n“Tapestry”, a peça mais extensa, com mais de 23 minutos, urdida a três, é brevemente introduzida pela guitarra, logo entrando o saxofone relaxado, seja em frases curtas ou discurso mais alongado, e a bateria espaçosa; de modo paulatino, cresce a intensidade até altos níveis, após o que regressa uma atmosfera apenas aparentemente tranquila, de onde se elevam picos de tensão, que se vão resolvendo ou direcionando a improvisação a jusante. Sensivelmente a meio, abre-se uma secção onde prevalece uma estranha serenidade, no limiar do indizível, evoluindo a partir daí em absoluto contraste, com os três músicos a puxarem pelos músculos. A peça que dá título ao álbum também começa em modo de interação cordata, com os três músicos a estudarem-se e a perceber o que cada um traz; decidem intensificar o nível de energia e a interação aumenta de vigor. Um solo de Lisle leva a peça noutra direção; Amado remete para um Rollins em modo flamejante, como até a esse momento não o fora, com erupções súbitas, intercaladas com algumas passagens mais mornas. Serries entra, desacompanhado, em modo mais textural, logo se juntando o saxofone sussurrante, a tender para o silêncio.\n\n\n\n“The Invisible” é um álbum notabilíssimo, com Dirk Serries, Rodrigo Amado e Andrew Lisle a surgirem no pináculo das suas capacidades enquanto criadores em tempo real.\"  Jazz.pt\n\n\n\n \"7,5/10 Il rinascimento musicale europeo del nuovo millennio passa anche per i vicoli di Lisbona dove l’etichetta portoghese Clean Feed scuote le fondamenta del (free-)jazz da quasi 25 anni. Rodrigo Amado è stato tra i fondatori di quell’etichetta-movimento esploso poi negli anni a seguire in tutta Europa. L’incontro tra l’incontenibile Amado e il belga Dirk Serries è avvenuto sul palco di un festival nell’estate del 2018. Immediata l’intesa, fotografata su musicassetta (ancora disponibile) e compact disc (esaurito) con il titolo “Jazzblazzt”.\n\n\n\nAl mosaico variopinto ed estremamente cangiante del duo mancava però ancora un elemento per essere completamente a fuoco, la batteria di Andrew Lisle, già sodale del chitarrista belga nel Kodian Trio (con Colin Webster) e vecchia conoscenza dello stesso Amado per via di una breve residenza portoghese ad inizio millennio. I tre musicisti si sono infine incontrati il 22 novembre del 2021 ad Anderlecht, in Belgio, per registrare il loro album d’esordio, “The Invisible”.\n\n\n\nLa sessione di registrazione è stata editata in tre lunghe tracce di sedici, ventitre e diciassete minuti. Il calore del sassofono di Rodrigo Amado è l’assoluto protagonista della scena. La chitarra astratta di Serries sembra seguirlo da lontano, mentre la batteria aiuta a definire gli spazi su “New Tone”. Intorno alla boa dei sei minuti la corsa rallenta l’incedere per lasciar lo spazio ad Amado di improntare un blues siderale. Lentamente anche la sei corde di Serries torna ad occupare il primo piano della scena musicale, mentre Lisle suona un tappeto pronto a contenere l’esuberenza dei due compagni di viaggio. La tensione viene quindi nuovamente accumulata e prontamente rilasciata sotto forma di schegge di lucida follia creativa.\n\n\n\nL’intesa si mantiene immutata per l’intera durata della lunghissima “Tapestry”, dove Serries può sperimentare un incedere ai limiti del mantra post-industriale sotto l’inafferabile leggerezza della batteria di Lisle e la voce sempre rassicurante del sassofno di Amado. La magia si ripete anche nel finale dell’omonima “The Invisible”, con una coda suonata in punta di piedi che potrebbe durare un’eternità.\" Ondarock - Italy\n\n\n\n\"\"Een samenwerking die niet helemaal uit de lucht gevallen komt (Lisle is een van Serrie' meest frequente internationale partners en met Amado werkte hij ook al samen, zie hun duo-release Jazzblazzt uit 2019), maar die toch verrast. Serries is nauw verwant aan de Britse improvisatie-scene waar Lisle deelt van uitmaakt, terwijl Amado ondanks een focus op vrije muziek sterker in de jazz geworteld is.\n\nZijn robuuste spel draagt sporen in zich van de klassieke tenoren, binnen en buiten de vrije vleugel. De goede luisteraar beseft snel dat het trio er een bijzondere interactie op nahoudt, die beweegt tussen densiteit en spaarzaamheid, finesse en rauwe kracht, abstractie en spanning, maar vooral getuigt van een eb- en vloedbeweging waarbij de drie samen die massa van geluid controleren. En als dat iets zegt over de coherentie van dit verhaal, dan kan je net zo goed richten op een van de drie en vervolgens horen hoe die muzikale driehoeksverhouding voortdurend blijft transformeren. Een uurtje vrije meeslependheid is het resultaat\" Jazz & Mo - Belgium\n\n\n\n\"Three experienced musicians: Dirk Serries, Rodrigo Amado on tenor sax and Andrew Lisle on drums. Series is a familiar name here at Vital Weekly as the label owner of A New Wave of Jazz and Sunny Side Inc. studio in Brussels. He’s a member of several ensembles: YODOK III, Fear Falls Burning and the Kodian trio. The latter has Andrew Lisle on drums. Dirk Serries and Andrew Lisle also played in larger ensembles and, most recently, were on stage with Martina Verhoeven (Serries’ spouse, by the way), as documented on Martina Invites. Serries and Amado played as a duo at Jazzblast in Neeritter in the south of the Netherlands.\n\nThat resulted in a limited cassette release on\n\nRaw Tonk, still available through the duo’s respective Bandcamp pages. Here, the duo is joined by Andrew Lisle. They recorded at least three pieces at Serries’ studio in Brussels after three public performances, one of which was at Jazzblast, Neeritter. Instead of two sets, we have three pieces in nearly an hour. Since there’s now double bass the lower strings of the guitar fill the lower spectrum, the lower register of the tenor sax and the two toms and the bass drum of the drum kit. It’s Manonfriendly music (my wife keeps surprising me with her musical tastes) in that it’s not cacophonous. Amado keeps coming up with melodic lines, sometimes meandering, sometimes short, sometimes long. Series treats the guitar sometimes as a percussive instrument, strumming away with abstract progressions or short successive notes. Lisle comes up with rapidly changing rhythms in conjunction with what he hears or the other two let him do the talking, or instead playing. It’s anadvantageous release, which merits a closer look/listen at each piece rather than playing this from the beginning until the end. The trio presents different moods, textures and interplay (all possible duos with three musicians come along).\" Vital Weekly\n\n\n\n\"3 out of 5 rating. The Invisible is a free-jazz record that shifts between the expressive & moody, to manic and dense, through to the abstract and angular. This three-length track album brings together Belgian guitarist Dirk Serries, Portuguese sax player Rodrigo Amado, and English drummer Andrew Lisle.\n\nThe album appears in the form of a CD on Vienna’s Klanggalerie- with the disc presented in a glossy digipak featuring atmospheric photos of brooding grey skies, barren waterways, and desolate rock formations.\n\nEach of the tracks has runtimes between fifteen and twenty-three minutes, and each is fairly varied/ shifting in its unfolding. We open with “New Tone” where we move from blends of expressively cascading sax work, snapping/ shifting percussion, and manically chugging guitar work. Though to smoky horn wailings, lighter guitar struts/ simmers, and pared-back percussive darts.\n\nOn “Tapestry” the longest track here- where we shift from the jagged strum, steadily forlorn horn bay and shimmering percussion fills. Though to shifting honk, cascading smash ‘n’ crash, and more urgent guitar strut ‘n’ bound.\n\nLastly, we have the title track. It opens abstract and skittering-paced with bobbing honks, snaping ‘n’ darting percussion hits, and angularly guitar strumming. As it moves on things become denser, shifting, and more baying- with more noisily pronounced/ jagged guitar tones, rapidly rolling honks, and shifting percussive detail. Though to the moodily simmering, broodingly wailing, and atmospherically jangling.\n\nThe Invisible finds this three-piece on top form, managing to shift tone and emotion easily. If you enjoy your free jazz that moves between manic and dense, to more moody & expressive this will most certainly be your thing.\" Musique Machine\n\n\n\n\"Expanding his collaborations with other creative musicians here, Belgian guitarist Dirk Serries is part of two trios which each feature a different Portuguese saxophonist. Equally compelling, though recorded almost two years apart, The Invisible couples the guitarist with tenor saxophonist Rodrigo Amado, an Iberian veteran in numerous international combinations, plus regular Serries associate UK drummer Andrew Lisle. \n\nThe presence of a percussionist defines how each session evolves. Lisle’s drum ruffs, rumbles and rebounds plus cymbal clanks and scratches give the other two a shifting but solid foundation on which to express themselves. Even Lisle’s brief unaccompanied solo on the title track adds to the overall structure rather than focusing attention on itself. Often knitting together simple and repeated notes and patterns, the saxophonist and guitarist also create their own motifs, reflecting tempos and connections. Amado’s expressions range from the technical to the traditional. Throughout he stretches timbres with multiphonic slurs, doits and spiraling vibrations. while there are points where his output is more languid and linear. During those interludes half-swallowed tones. pauses and straight-ahead elaborations of songbook standards hover, but never long enough to be fully defined. Still these characteristics are elaborated on the lengthy “Tapestry” , which also provides space for the string strategies Serries pursues throughout. Positioning himself between Lisle and Amado, his playing veers from powerful drones and metallic clanks to string-ringing and horizontal comping. On “Tapestry” these devices serve as challenges to reed motifs. As Amado’s slides from note-bending tonguing and emphasized honks to almost vibrato-less trills and nearly inaudible timbral smears, Serries provides the proper rejoinder, or pushes the other musicians with jagged frails or vibrant string stings to dedicated theme variations.\" Jazzword\n\n\n\n\"Connu pour ses alias Fear Falls Burning et Vidna Obmana (et particulièrement apprécié de votre serviteur pour l’association de ce dernier avec Bass Communion aka Steven Wilson le temps des deux fabuleux longs-formats doomesques de Continuum entre 2005 et 2007), le pionnier belge du dark ambient nous a une nouvelle fois gâtés cette année, de l’onirisme contemplatif à l’élégie opaque et abrasive. Et le jazz dans tout ça ? Eh bien suite au plus que fameux Density Dots de son Impetus Group en 2023, on attendait le musicien, de nouveau à la guitare électrique, sur un terrain free des plus chaotiques et dissonants, autant dire que The Invisible nous a relativement surpris avec son jazz en trio sax/guitare/batterie certes toujours un brin déglingué et largement improvisé mais beaucoup plus construit voire par moments posé, sur trois longs serpentins aux durées comprises entre 16 et 23 minutes évoquant aussi bien les mélodies tourmentées d’Ornette Coleman que les intenses fulgurances électrifiées de Fire ! ou certains travaux en formation jazz du guitariste Marc Ribot.\" Indierock Magazine",
      "license": "all rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a0810517228_0",
      "trackinfo": [
        {
          "title": "New Tone",
          "duration": "15:59",
          "lyrics": null
        },
        {
          "title": "Tapestry",
          "duration": "23:08",
          "lyrics": null
        },
        {
          "title": "The Invisible",
          "duration": "17:37",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://dirkserries.bandcamp.com/album/schneider-serries",
      "title": "Schneider Serries",
      "artist": "Schneider / Serries",
      "classification": "paid",
      "tags": [
        "Experimental",
        "ambient",
        "freejazz",
        "improvisation",
        "minimal",
        "Antwerp"
      ],
      "item_id": 2523012193,
      "datePublished": "01 Sep 2024 00:00:00 GMT",
      "about": "Recorded June 2023 at the Loundry Room, Hückelhoven Germany.\n\nRecorded, mixed and mastered by Peter Koerfer at the Unknown, Döhr Germany",
      "credits": "released September 1, 2024\n            \n            Dirk Serries : guitar\n\nJörg A. Schneider : drums\n\n\n\nOriginally released on Schneider Collaborations, 2024.\n\n\n\n\"As I finished the previous review, the one about Left Limbs, true story, the last mailman of the day handed me this album. It was the end of the day, so I postponed listening to it. Had I done it straight away, I may have lumped this LP together with Left Limbs one, as there are similarities and differences. Two men again, drums and guitar, and again rock meets improvisation. I'll get to the differences. Dirk Serries, on guitar, isn't a one-trick pony (I may have used these exact same words before), as with his guitar he can play very much the sort of chaotic improvised music we know from free improvisation, but also thoughtful ambient music (and here too he has various sub directions) or metal-inspired music. The latter we find on this LP he recorded in June 2023 with drummer Jörg A. Schneider. I don't think I heard his music before, or the many groups he's part of (Gaffa, Glimmen, Jealousy Mountain Duo, Les Hommes Qui Wear Espandrillos, Nicoffeine, Roji, SWWS, Tarngo, Teen Prime, The Nude Spur). he has several collaborative projects, mostly with guitar slingers, such as Thisquietarmy, N, Mikel Vega, Aidan Baker and others. If Left Limbs combines rock and improvisation, they do it from a more punky perspective, while Serries and Schneider operate from a metal music perspective. The opening piece, 'Muscle Steam', rips right in with much distortion and banging on the drums. I am the first to admit that I don't know much about metal music (or nothing at all), but even I hear it's nothing traditional. It's the idea of something with guitars and volume, but straight away, Schneider plays his drums in a more improvised manner. He's all over the kit. In other tracks, Serries maintains force by using several sound effects. Still, it can be open and dirty yet spacious, such as in 'Enhance The Machine', sparse notes, still brutal, whereas 'Mechanical Collapse' ups the speeds and aggression. If Left Limbs plays their music in a free improv way, they have a different, perhaps friendlier atmosphere than Schneider and Serries. Their music is much darker, sealed off from the outside world. The last piece, 'Force Regeneration', is the album's jazziest affair, in which both players find their way to play their version of jazz music. It's also the album's lightest piece if you can imagine such an album having a lighter side. It also shows the amount of approaches they take on the notion of 'let's play some loud drum and guitar music'. A tour de force\" Vital Weekly - Netherlands\n\n\n\n\"De Belgische gitarist Dirk Serries zoekt op vele verschillende manieren de grenzen op van wat hij met de gitaar kan doen. Vaak gebruikt hij daarbij de akoestische gitaar, maar af en toe neemt hij ook de elektrische gitaar op en dan houdt hij zich niet bepaald in – de opnames die hij maakte met de Duitse drummer Jörg A Schneider laten dat overduidelijk horen – het gaat hier van krankzinnige dark metalherrie tot enerverende soundscapes, waarbij hij zijn gitaar dingen laat doen die je werkelijk nog nooit eerder hebt gehoord. Drummer Schneider probeert hem te volgen, maar het is wat mij betreft overduidelijk Serries die hier aangeeft waar de reis heengaat. Een muzikaal avontuur dat zijn weerga niet kent. Spannend, enerverend, bij vlagen bloedmooi, en dan weer rauw scheurend uit de bocht vliegend. De stevigste hardrockers doen het dit duo niet gemakkelijk na. Goed voor een stevige dosis adrenaline – laat deze muziek maar eens lekker hard door de ruimte knallen! Zorg er dan wel voor dat er geen mensen met zwakke zenuwen in de buurt zijn. Haha.\" Moors Magazine - Netherlands\n\n\n\n\"De Belgische gitarist en improwizard Dirk Serries zat vorig jaar in de studio met de Duitse drummer Jörg A. Schneider, indertijd oprichter van het alternatieve BluNoise Records. Wie een rustig luistermoment met akoestische improvisatie verwacht, is eraan voor de moeite. Fans van een hardcore interactie tussen elektrische gitaar en drums daarentegen zullen duidelijk in de wolken zijn. Alles begint met ‘Muscle Steam’: een helse intro van overstuurde gitaarnoise en trashy drumslagen, de titel waardig. In contrast hiermee is het daaropvolgende ‘Enhance The Machine’, een donker americana tableau met zwaarmoedige gitaarakkoorden en heel veel slagwerk met cymbalen. Serries zorgt door zijn pedalenwerk af en toe voor uiterst ontwrichtende klankeffecten. Uiteindelijk al even verontrustend als de openingstrack. ‘Mechanical Collapse’ sluit dan weer aan bij de start van het album. Denk hierbij vooral aan de waarden van een festival als het Tilburgse Roadburn of de groep Xiu Xiu om maar een paar referenties te citeren. Kant B opent met het loodzware en in gitzwarte ambient gedrenkte ‘Complex Particle System’, waarbij het duo overgaat tot het ontleden van deze decibelmassa. Ze ontrafelen, puzzelen en ontwerpen een kringvormige basisstructuur ter voorbereiding van ‘Force Regenaration’. Een gelaagde aaneenschakeling van repetitieve gitaarspielereien en een hyperkinetisch drumspel. Tenslotte een coherent en gezamenlijk verhaal uitgebouwd rond circulaire patronen. Heftige impact verzekerd mede door het volume.\" Jazzenzo magazine\n\n\n\n\"Zufälle gibt’s: Aus nicht rekonstruierbaren Gründen findet der Rezensent seine Mailadresse plötzlich im Verteiler von Dirk Serries wieder und hört sich seitdem gern durch dessen Oeuvre. Ein der Industrial-Szene entwachsener Impro-Gitarrist aus Antwerpen, der mit haufenweise Leuten zusammenarbeitet, mit Tomas Järmyr, dem Ex-Drummer von Motorpsycho, etwa als The Void Of Expansion. Als der Text dazu zur Veröffentlichung auf dieser Plattform anstand, erzählte Freund Arni, dass er von Serries einige Platten habe, nämlich vom Projekt Continuum, das Serries mit Steven Wilson von Porcupine Tree betreibt. Sowas. Wer in Serries‘ Impro-Reihe indes fehlte, war Schneider, und darauf angesprochen, erzählte der: Ja, Dirk kommt morgen zu mir, wir spielen das zweite Album ein. Ist das noch Zufall oder schon Koinzidenz? Danke, lieber Weltengeist! Das erste gemeinsame Album gibt’s nun auf Vinyl, und darauf finden beide Musizierende stillere Töne, als man erwartet hätte. Beide halten sich zurück, der gemeinsame Rausch umfängt die Hörenden wie nebulöse Watte, in der feste Strukturen zu erahnen sind. Für „Enhance The Machine“ etwa wählte Serries einen leicht angezerrten Sound, den er akkurat und behutsam anschlägt und damit Töne erzeugt, die ähnlich auch auf „Laughing Stock“ von Talk Talk zu hören gewesen sein könnten. Zwar haut Schneider dazu auch auf seine Felle, lässt aber die Hi-Hats dominieren und sie den Eindruck von Rausch unterstreichen. Bald kippt Serries trunken ins Schräge und Schneider intensiviert sein Spiel, der Track erfährt dadurch eine Neigung, keine Steigerung. Aber keine Angst, die beiden können Lärm, die beiden machen auch Lärm. Zumindest ist „Mechanical Collapse“ die Umsetzung des Titels in Sound und ein noisiger Abschluss der A-Seite. Dafür beginnen sie die B-Seite mit „Complex Particle System“ umso chilliger, wenn auch ebenso wenig auf herkömmliche Weise strukturiert: Drones können schließlich auch leise sein, steigern kann man sich immer noch, und das passiert hier auch, gemächlich und gemütlich ins Unbequeme. Für „Force Regeneration“ zersägt das Duo Hawai’i-Musik, ein lysergsaurer Dick Dale taumelt am Strand herum und rempelt ständig die Surfer an, aber mit dem Tempo einer Flipperkugel, und damit ist nicht der Delphin gemeint. Insgesamt weniger Drone als erwartet, aber deshalb nicht weniger gut gelungen – auf das zweite gemeinsame Album darf man äußerst gespannt sein.\"Krautnik Magazine\n\n\n\n\"The duo album of Serries and German experimental, free-improv, avant-rock and noise drummer Jörg A. Schneider (known from the free jazz-drone-dub duo Roji with Portuguese bassist Gonçalo Almeida, a frequent collaborator of Serries) was recorded at Schneider’s home base, the Loundry Room in Hückelhoven, Germany, in June 2023. This is the most radical and varied album of these three new duos. Series plays a distortion-heavy, mean electric guitar and pushes Schneider’s manic, primitive drumming to extreme terrains on the opening piece “Muscle Steam” but on the following “Enhance The Machine”, Serries suggests a much more reserved, twisted kind of ballad, accompanied by fragmented rhythmic patterns of Schneider. “Mechanical Collapse” threatens to drown in another manic, noisy freak-out and “Complex Particle System” experiments with a dark and noisy cinematic soundscape. The album ends with the sparsely melodic “Force Regeneration”, and already calls for continuous chapters of this stimulating duo.\" Freejazz Blog\n\n\n\n\"Es kratzt und drescht und rumpelt derart zu Beginn des eröffnenden “Muscle Steam”, dass unmissverständlich klar ist, dass man sich mit der ersten Kollaboration von Drummer Jörg A Schneider und Gitarrendröhner Dirk Serries auf eine Reise durch steiniges Gelände mit allerlei struppigem Wurzelwerk eigelassen hat. Wenig ist hier von den entspannten Ambientwelten Vidna Obmanas und dem eher luftigen Jazz zu hören, für die Serries bekannt ist, stattdessen herrscht hier eine aufgewühlte Freakoutstimmung, die auch deshalb herausfordernd ist, weil sie nie ganz klar macht, ob sie treibend oder auf der Stelle tretend sein will. Ein aufgewecktes, aber zunächst tastendes Gitarrenmotiv eröffnet das knapp neunminütige “Enhance the Machine”. Hier lassen die beiden sich mehr Zeit, auch wenn die Becken spannungsvoll zu zischeln beginnen und einzelne Rumpler auf den wuchtigeren Trommeln deutliche Wegweiser in Richtung einer neuen Jagd anzeigen, die dann nach einigen Minuten auch losgeht. Ein langsames Steigerstück, bei dem man derart stetig zum finalen Klimax geführt wird, dass man ihn irgendwo im letzten Drittel erst registriert, wenn er sich schon ereignet hat und sich die Musik in Knarren und Tremolieren auflöst. Man könnte über vieles reden – über das wunde Knarren und die funkensprühenden Becken und die hämmernde Drumarbeit im apokalyptisch anmutenden “Mechanical Collapse”; über die kriechende Dröhnung, die in “Complex Particle System” von stetigen Eruptionen durchlöchert und in ein Felsengebirge verwandelt wird; über das abschließende “Force Regeneration”, das zwischen all dem Schaben und Zisseln auch ganz deutlich harmonisch-melodische Details in seinem knarrigen Saitenspiel inklusive schwülen Twang-Ansätzen aufweist. Letztlich empfiehlt sich aber, dieses Debüt als eine Einheit zu rezipieren. Ein tolles Werk wie aus einem Guss, das viele überzeugen wird, die metallisch angehauchte Dröhnung und Jazz gleichermaßen lieben. (A.Kaudaht)\" African Paper\n\n\n\n\"Belgijskiego gitarzystę Serriesa znamy na tych łamach doskonale – zarówno jak wrażliwego, improwizującego akustyka, jak i dark-ambientowego elektryka. Tu, w duecie z niemieckim perkusistą Schneiderem, mamy niepowtarzalną okazję poznać go jako instrumentalistę niemalże noise rocka. To z pewnością jeden z jego najgłośniejszych albumów. Pierwsza odsłona albumu świetnie dokumentuje fakty zasugerowane zdanie wcześniej. Noise rockowa gitara skulona w kłębie post-bluesa wraz z samonapędzającą się maszyną circle drums systematycznie buduje tu ścianę dźwięku. To także rodzaj prog-rocka w stanie agonii, w chmurze dogorywającej psychodelii. Kolejny utwór pogłębia ów stan, ciekawie balansując pomiędzy ginącą melodią i kreatywnym hałasem. Ta część albumu przywołuje w pamięci nagrania Fear Falls Burning, ale zagubione w nieznośnym upale południowego Texasu, zatopione w magmie repetycji. Trzecią część wypełnia płonąca gitara hard-rocka, a kumulujący się wokół niej drumming dopełnia miana power duo. W czwartym epizodzie Serries przypomina epigona ambientu, dla którego jedynym ratunkiem jest ucieczka w psychodelię. W ostatniej części jego gitara wpada w wieczną pętlę powtórzenia. Jej brzmienie zagęszcza się z każdą sekundą, skutecznie tłamsząc melodykę, choć samo frazowanie wydaje się najłagodniejsze z możliwych.\" Spontaneous Music Tribune\n\n\n\n\"Dirk Serries heeft een lange weg afgelegd sinds vidnaObmana (en Ratbau volledigheidshalve want nog net daarvoor). Er waren en zijn niet alleen Fear Falls Burning, YODOK III, Loud As Giants (met Justin Broadrick), Continuum (met Steven Wilson) en massa’s andere samenwerkingsprojecten, maar ook flink wat releases onder eigen naam. Grosso modo het afgelopen decennium focuste hij zich voornamelijk op vrije vormoefeningen, meestal (grotendeels) gestoeld op improvisatie en geluidsexperimenten. Raakvlakken met freejazz en avant-garde werden daarbij veelvuldig geëxploreerd. Ook die periode wordt in grote mate gekenmerkt door collaboraties en kruisverbanden, met onder andere saxofonist Colin Webster als frequent opduikende kompaan. Ditmaal gaat zijn gitaar de confrontatie aan - en dat mag letterlijk genomen worden - met het drumstel van de Duitse stilistische veelvraat Jörg Alexander Schneider. Die houdt er, onder de noemer ‘Schneidercollaboration’ zelf ook flink wat samenwerkingen op na, onder andere met Thisquietarmy en Aidan Baker. Serries is geen conventionele gitarist; Hij gaat de geluiden die hij uit zijn instrument puurt te lijf met real-time gemanipuleerde effecten, terwijl Schneider een bombastische basis legt. Beide muzikanten flirten met chaos, maar proberen tegelijkertijd met alle macht op de gemeenschappelijke rails te blijven. Precies omdat dat lukt, blijft de rit spannend. Ietwat gevaarlijk soms, maar altijd onder controle en nooit ontspoord. Elementen uit abstracte (post)metal worden gekruist met freejazz en dat levert, voor de zoveelste maal, een onnavolgbare stijloefening op. (Swat)\" Gonzo Circus",
      "license": "all rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a1845845594_0",
      "trackinfo": [
        {
          "title": "Muscle Steam",
          "duration": "04:15",
          "lyrics": null
        },
        {
          "title": "Enhance The Machine",
          "duration": "08:58",
          "lyrics": null
        },
        {
          "title": "Mechanical Collapse",
          "duration": "05:32",
          "lyrics": null
        },
        {
          "title": "Complex Particle System",
          "duration": "07:16",
          "lyrics": null
        },
        {
          "title": "Force Regeneration",
          "duration": "09:45",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://dirkserries.bandcamp.com/album/zonal-disturbances-bandcamp-version",
      "title": "Zonal Disturbances (bandcamp version)",
      "artist": "Dirk Serries",
      "classification": "paid",
      "tags": [
        "Experimental",
        "ambient",
        "freejazz",
        "improvisation",
        "minimal",
        "Antwerp"
      ],
      "item_id": 2481566239,
      "datePublished": "09 Oct 2024 00:00:00 GMT",
      "about": "All performed real-time at the home studio in October 2024. Mixed and mastered by Dirk Serries.",
      "credits": "released October 9, 2024\n            \n            Dirk Serries : electric guitar, effects.\n\n\n\n\n\n\"This is an amazing, semi-ambient excursion from Mr. Serries. At once caustic & experimental, Dirk deviates into a sonic world of sublimely drone-scaped melancholy contained within an ambient substructure that resonates not so subtle undertones of deliberate aural chaos.\n\n\n\nThe sounds that Serries pries from his guitar are astounding; if you dig your #ambient with an edge, you owe it to yourself to give Zonal Disturbances an intentional listen!\" Ambient Landscape\n\n\n\n\"Dirk Serries is een buitengewoon veelzijdige Belgische gitarist die meestal op een archtop gitaar met anderen geïmproviseerde jazz maakt, maar hij heeft ook een zwak voor ambient, en dan haalt hij zijn elektrische gitaar tevoorschijn, en zijn effectenpedalen, en dan gaat hij los op een onnavolgbare manier.\n\nDenk dan niet aan kalme drones en rustgevende ambient, want wat je hier te horen krijgt is ambient met een ruw randje, regelmatig aanschurend tegen wat wij hier wel genietend “heerlijke pokkeherrie” noemen.\n\nZonal Disturbances heeft Serries in één keer in zijn eigen homestudio opgenomen in oktober 2024, gemixed en gemastered en meteen uitgebracht. Bij een eerste beluistering mag het wellicht wat weerbarstige muziek lijken, maar als je vaker luistert (de drie fragmenten die ik je hier laat horen zou ik zeker drie keer beluisteren) hoor je de details en de kleine finesses die er in verstopt zitten, en kom je er achter hoe spannend en tegelijk melancholiek deze muziek is. Het is overigens bijna ongelofelijk dat Serries alles wat we hier horen aan zijn gitaar weet te ontlokken. Verbazingwekkend.\" Moors Magazine",
      "license": "all rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a1023359832_0",
      "trackinfo": [
        {
          "title": "I8YAC24X",
          "duration": "15:45",
          "lyrics": null
        },
        {
          "title": "IIZF4R49",
          "duration": "15:54",
          "lyrics": null
        },
        {
          "title": "IIIGH8L5",
          "duration": "16:39",
          "lyrics": null
        },
        {
          "title": "IV5QS95L",
          "duration": "14:08",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://dirkserries.bandcamp.com/album/defiance-of-self",
      "title": "Defiance Of Self",
      "artist": "Dirk Serries",
      "classification": "paid",
      "tags": [
        "Experimental",
        "ambient",
        "freejazz",
        "improvisation",
        "minimal",
        "Antwerp"
      ],
      "item_id": 1339002799,
      "datePublished": "02 May 2024 00:00:00 GMT",
      "about": "All performed real-time at the home studio, January 2024. Mixed and mastered by Dirk Serries.",
      "credits": "released May 2, 2024\n            \n            Dirk Serries : electric guitar, effects.\n\n\n\nOriginally released on Silentes/13, 2024.",
      "license": "all rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a0895467031_0",
      "trackinfo": [
        {
          "title": "Mantle",
          "duration": "11:28",
          "lyrics": null
        },
        {
          "title": "Crumbling",
          "duration": "13:36",
          "lyrics": null
        },
        {
          "title": "Perception",
          "duration": "10:40",
          "lyrics": null
        },
        {
          "title": "Reckoning",
          "duration": "10:32",
          "lyrics": null
        },
        {
          "title": "Vigil",
          "duration": "10:48",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://dirkserries.bandcamp.com/album/second-edition",
      "title": "Second Edition",
      "artist": "Colin Webster Large Ensemble",
      "classification": "paid",
      "tags": [
        "Experimental",
        "ambient",
        "freejazz",
        "improvisation",
        "minimal",
        "Antwerp"
      ],
      "item_id": 1827068182,
      "datePublished": "31 Jul 2024 00:00:00 GMT",
      "about": "Recorded live at Cafe Oto, London on 15th October 2023\n\nRecorded by kyle acab\n\nMixed and mastered by Dirk Serries",
      "credits": "released July 31, 2024\n            \n            Colin Webster - alto sax\n\nRachel Musson - tenor sax\n\nCath Roberts - baritone sax\n\nCharlotte Keeffe - trumpet / flugelhorn\n\nGraham Dunning - electronics\n\nDirk Serries - guitar\n\nCaius Williams - bass\n\nAndrew Lisle - drums \n\n\n\nArtwork by Colin Webster\n\nLayout by Rutger Zuydervelt\n\n\n\nOriginally released on cd, Raw Tonk Records 2024",
      "license": "all rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a0942773960_0",
      "trackinfo": [
        {
          "title": "Set 1",
          "duration": "32:25",
          "lyrics": null
        },
        {
          "title": "Set 2",
          "duration": "34:11",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://dirkserries.bandcamp.com/album/floating-similarities",
      "title": "Floating Similarities",
      "artist": "Christian Vasseur &amp; Dirk Serries",
      "classification": "paid",
      "tags": [
        "Experimental",
        "ambient",
        "freejazz",
        "improvisation",
        "minimal",
        "Antwerp"
      ],
      "item_id": 3644471450,
      "datePublished": "17 Sep 2024 00:00:00 GMT",
      "about": "Performed at the Kapel Oude Klooster (Brecht, Belgium) on January 20th, 2024. Recorded, mixed and mastered by Dirk Serries.",
      "credits": "released September 17, 2024\n            \n            Christian Vasseur : eleven string classical guitar tuned in quarter-tone, voice\n\nDirk Serries : archtop guitar \n\n\n\nPhotography by Christian Vasseur.\n\nGraphic design by Carlos Santos.\n\nProduction by Ernesto Rodrigues. \n\n\n\nchristianvasseur.weebly.com\n\n  newwaveofjazz.com\n\n\n\n Originally released on Creative Sources, 2024.\n\n\n\n\"Floating Similarities is the meeting of two European improv-focused guitarists- Belgian’s Dirk Serries and France’s Christian Vasseur. The seven-track CD album shifts between the abstract, manic, and moody. The CD comes presented in a mini white gatefold- this features colour cover art of two rowboats sat next to each other on a calm/ picturesque river- which I guess is very much ironic, as there’s not much formally pretty, peaceful, or calm about the sonics inside. For the album, Serries is playing an archtop guitar, and Vasseur- an eleven-string classical guitar tuned in quarter tone. The set was recorded at Kapel Oude Klooster in Brecht Belgium on the 20th of January 2024. With track runtimes between two and nine minutes a piece. We move the brooding simmer, fork ‘n’ slice meets eerier pluck of “Celestial Peat”. Onto the rapidly darting pitch wavering pinpricks, jittering scrap, and general manic angularity of “Path To Peaks”. In its second half, we go from erratic scuttling pick ‘n’ shimmer, darting twang, and sudden angular shimmer ‘n’ twang of “Djinn’s Jokes”. To the low-key, at times eerier shuffling, fiddling strum, darting twang, and shorting dart of “The Traveller Surprised By His Dream” which later on features moments of uneven/ da-da chanting from Vasseur. If you enjoy improv at its more abstract, at points busy and manic, to off-kilter moody- then I can see Floating Similarities is an album that will appeal.\" Musique Machine\n\n\n\n\"On saluera volontiers le raffinement acoustique (The Chatty Pilgrims) de ces deux guitaristes et activistes infatigables de l’improvisation unissant leurs efforts pour sept remarquables duos dont les développements se révèlent imprévisibles. Comme points de références on trouve des albums en duo du guitariste Pascal Marzan avec Roger Smith (Two Spanish Guitars 2006-2007) et John Russell (Translations 2011) publiés par Emanem CD ou The Guitar Lesson par Eugene Chadbourne et Henry Kaiser (Victo 1999). Nos deux acolytes originaires respectivement des agglomérations lilloises et anversoises parcourent une maximum de possibilités expressives, sonores, bruitistes pour capter sans relâche notre attention, voire notre fascination au travers d’une recherche exponentielle systématique mais joyeusement ludique, exacerbée, obstinée. Ça a l’air d’être sans queue ni tête, mais au fil de leurs improvisations improbables, Dirk Serries & Christian Vasseur nous livrent un précis très exhaustif de toutes les facéties alternatives de la six cordes en face à face. Ça percute, bourdonne, gratte, grésille, éclate, tournique, mugit, crisse, s’emporte, grince, bruite sous toutes les coutures, fréquences, ou résonne dans le silence… Il n’y a pas de système, de démarche particulière, de « style » ici : il s’agit d’une volonté d’ouverture à de nombreuses possibilités de rendre expressive la six cordes au-delà des conventions, même celles de l’avant-garde. Il suffit de comparer les deux premiers morceaux The Celestial Peat ou The Chatty Pilgrims avec le dernier, The Traveller Surprised by His Dream et ses extraordinaires ostinatos délirants. On n'a pas le temps de s’ennuyer, leur connivence merveilleuse sublime l’art d’inventer à la guitare. Que ceux qui ne parlent que de Derek Bailey, Fred Frith, Hans Reichel ou Bill Frisell etc.. portent une oreille sur ces étranges Floating Similarities et leurs fluctuations sonores insaisissables. Un album à marquer d’une pierre blanche. \"  orynx-improvandsounds.blogspot.com\n\n\n\n \"Teraz dla odmiany zanurzymy się w bezkresie gitarowej akustyki. Serries przesiada się na swój ulubiony archtop, a jego partner Vasseur sięga po instrument klasyczny, ale stroi go dalece nietypowo. Efekt jest więcej niż udany – bystra dramaturgia, moc soczystego brzmienia i niczym nieskrępowana kreatywność, na koniec ubarwiona efektownymi wokalizami.\n\n\n\nMuzycy zdają się tu toczyć batalię o najpiękniejszy dźwięk, a zaczynają ją od smyczkowego frazowania. Jedna gitara śpiewa, druga rzęzi jak gruźlik. Moc kreacji jest z nimi w każdym momencie, zarówno wtedy, gdy cedzą dźwięki w trybie minimalistycznymi, jak i wtedy, gdy ekspresja niesie ich na wysokie wzgórze. Lubią rytm, potrafią być naprawdę delikatni, ale nie przestają kąsać ciętymi ripostami. W trzeciej odsłonie śpiewają razem rozdygotaną mantrę, w części kolejnej pachną onirycznym post-bluesem, nie bez autoagresji, by w epizodzie piątym pieścić struny, poszukiwać zjawisk definitywnie post-akustycznych i ostatecznie popaść w intrygującą repetycję. W części szóstej artyści koncentrują się na dźwiękach preparowanych. Najpierw szemrają po kątach, potem nabierają dynamiki i sieją zamęt. Ostatnia improwizacja jest tą najdłuższą i mieni się wszystkimi kolorami tęczy. Flażolety, drobne szarpnięcia, brzmienia niemal gamelanowe, a w ramach reasumpcji wokaliza mezuina, niesiona bystrym rytmem.\" Spontaneous Music Tribune",
      "license": "all rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a1716619470_0",
      "trackinfo": [
        {
          "title": "Celestial Peat",
          "duration": "06:34",
          "lyrics": null
        },
        {
          "title": "The Chatty Pilgrims",
          "duration": "05:33",
          "lyrics": null
        },
        {
          "title": "Path To The Peaks",
          "duration": "08:13",
          "lyrics": null
        },
        {
          "title": "Give Me This Stuff",
          "duration": "02:42",
          "lyrics": null
        },
        {
          "title": "Djinn's Jokes",
          "duration": "06:06",
          "lyrics": null
        },
        {
          "title": "Hahuman Mimicking A Human",
          "duration": "05:03",
          "lyrics": null
        },
        {
          "title": "The Traveller Surprised By His Dream",
          "duration": "09:18",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://dirkserries.bandcamp.com/album/streams-of-consciousness-compiled",
      "title": "Streams Of Consciousness Compiled",
      "artist": "Dirk Serries",
      "classification": "paid",
      "tags": [
        "Ambient",
        "Drone",
        "Experimental",
        "New Age",
        "ambient",
        "freejazz",
        "improvisation",
        "minimal",
        "Antwerp"
      ],
      "item_id": 3413801286,
      "datePublished": "27 Aug 2024 00:00:00 GMT",
      "about": "Available through Projekt Records :  projektrecords.bandcamp.com/album/streams-of-consciousness-compiled",
      "credits": "released August 27, 2024\n            \n            Streams of Consciousness is Dirk Serries' homage and return (after the closure of vidnaObmana in 2007) to pure harmonic sonic moments. A mix of deep ambient and drone, this collection presents a nearly-3-hour selection of tracks from the 17 releases available at:  streamsofconsciousness.bandcamp.com  Created in real-time on electric guitar and a handful of effects in Dirk's home studio, it’s a slowflow inner exploration of sonics and emotional states. Single notes and reverberating washes of guitars ebb and flow over the course of these longform pieces. Begun in 2013, the first three Streams of Consciousness albums were pressed in ultra limited quantities on vinyl. The series then continued digitally.\n\n\n\nSome Bandcamp fan quotes:\n\n\n\n\"Ambient guitar drone at its best from none other than the best.”\n\n\n\n\"Whatever your definition of bliss is, Dirk Serries has the power to change it forever.\"\n\n\n\n\"From the depths of his inner world to the ears of our sensory world, Dirk Serries is a master at the top of his game. A must have…”\n\n\n\n\"For me, Dirk Series literally walks on water. He has an amazing talent and uses it well. From his days as vidnaObmana to operating under his own name, the quality of the audio experience has always been exceptional.”\n\n\n\n\"This is one of those albums where you really begin to question what is more important, the note or the space between the notes. Perhaps it is the SOUND between the notes, the sound of the previously played note fading. Regardless, Dirk Serries paints a very gentle picture of blissful yet slightly lonely place, a place of silent introspection and reflection. Simply fantastic.”\n\n\n\n\"Sensational drones from the undisputed master of the genre.” \n\ncredits\n\nreleased February 20, 2024\n\n\n\n1. meandering - taken from 172209 :  streamsofconsciousness.bandcamp.com/album/172209\n\n 2. harmonious flare - taken from 131910 :  streamsofconsciousness.bandcamp.com/album/131910\n\n 3. remote delight - taken from 231908 :  streamsofconsciousness.bandcamp.com/album/231908\n\n 4. principal origin - taken from 131106 :  streamsofconsciousness.bandcamp.com/album/131106\n\n 5. glow horizon - taken from 232202 :  streamsofconsciousness.bandcamp.com/album/232202\n\n 6. solstice of murmur - taken from 152401 :  streamsofconsciousness.bandcamp.com/album/152401\n\n 7. weather divide - taken from 132406 :  streamsofconsciousness.bandcamp.com/album/132406\n\n 8. the whispering scale - taken from 232504 :  streamsofconsciousness.bandcamp.com/album/232504",
      "license": null,
      "coverUrl_0": "https://f4.bcbits.com/img/a1041418140_0",
      "trackinfo": []
    },
    {
      "url": "https://dirkserries.bandcamp.com/album/martina-verhoeven-invites",
      "title": "Martina Verhoeven Invites",
      "artist": "Martina Verhoeven Invites",
      "classification": "paid",
      "tags": [
        "Experimental",
        "ambient",
        "freejazz",
        "improvisation",
        "minimal",
        "Antwerp"
      ],
      "item_id": 1415017119,
      "datePublished": "24 Jul 2024 00:00:00 GMT",
      "about": "Andrew Lisle : drums\n\nBenedict Taylor : viola\n\nCath Roberts : baritone sax\n\nCharlotte Keeffe : trumpet\n\nColin Webster : alto sax\n\nDaniel Thompson : acoustic guitar\n\nDirk Serries : electric guitar\n\nMartina Verhoeven : grand piano\n\nTom Jackson : clarinet\n\nTom Ward : bass clarinet, flute",
      "credits": "released July 24, 2024\n            \n            Performed live At Cafe Oto, London UK, July 23rd 2023.\n\nLive mix and recording by Billy Steiger.\n\nMixed and mastered by Dirk Serries.\n\n\n\nCover paintings by Gina Southgate created live during the concert.\n\nLayout by Rutger Zuydervelt. \n\n\n\nartistginasouthgate.com\n\n  dirkserries.com\n\n  newwaveofjazz.com\n\n\n\n \"Belgian pianist, photographer and bass player (electric and double) Martina Verhoeven had carte blanche at Café Oto in London last year. Two\n\nhours of free improvisation by like-minded musicians invited by Martina. The members of this ad hoc ensemble: Andrew Lisle (drums), Benedict Taylor (viola), Cath Roberts (baritone saxophone), Charlotte Keefe (trumpet), Colin Webster (alto saxophone), Daniel Thompson (acoustic guitar), Dirk Serries (electric guitar & spouse of Martina), Tom Jackson (clarinet) & Tom Ward (bass clarinet & flute) and of course Martina Verhoeven (grand piano). I could introduce all the ensemble members by copy-pasting their introductions on the cafe OTO page. But that would be lazy. Andrew Lisle is a drummer based in London and is a member of several ensembles: Alex Ward Item 10, Alex Ward Item 4, Alex Ward Item 6, Alex Ward Item 7, Colin Webster Large Ensemble, Dikeman Lisle Serries Webster Quartet, Dikeman Lisle Serries Webster Wilkinson Quintet, Kodian Trio, Shatner's Bassoon and The Spring Trio. The Alex Ward Item, each number is the number of players in the item, share several members in this ad hoc\n\nensemble. Dirk Serries is not a new name at Vital Weekly and doesn’t need any introduction. Martina herself switched from electric bass to double bass and on to solely piano, although occasionally she plays the double bass. She began her recorded musical journey with 3 seconds of air. A bass and two guitars trio with Dirk Serries and Paul van den Berg. Her quintet played in front of an enthusiastic audience at Roadburn 2022. Not an audience known to enjoy free impro. That performance is captured on Driven – Live at Roadburn 2022. Benedict Taylor is a member of Alex Ward Item 10, ARCO, Impetus Group, Alex Ward Item 6, London Improvisers Orchestra, Orchestra Entropy, & SETT. Cath Roberts is member of Alex Ward Item 10, Alex Ward Item 7, Article XI, Colin Webster Large Ensemble, Quadraceratops, cr-ow-tr-io, Favourite Animals, Impetus Group, London Improvisers Orchestra, Madwort Saxophone Quartet, Moonmot, Olie Brice Octet, Ripsaw Catfish, Saxoctopus, Sloth Racket & Word Of Moth.\n\nColin Webster is member of Anthony Joseph & The Spasm Band, Dikeman Lisle Serries Webster Quartet, Dikeman Lisle Serries Webster Wilkinson Quintet, DunningWebsterUnderwood, Impetus Group, Colin Webster Large Ensemble, Kodian Trio, KTHXBYE, Martina Verhoeven Quintet, Saxoctopus, Serries Verhoeven Webster Trio, Sex Swing, The Uniteam All Stars &Wart Biter. He also has a label, Raw Tonk. Daniel Thompson is a member of Impetus Group, SETT, The Bellowing Earwigs, The Runcible Quintet, The Seen & The Spring Trio. Charlotte Keefe is a member of Alex Ward Item 10, Alex Ward Item 4, Alex Ward Item 6, Charlotte Keeffe Quartet, Colin Webster Large Ensemble, Alex Ward Item 7, Impetus Group, London Improvisers Orchestra, Mopomoso Workshop Group & Paul Dunmall Ensemble. On to the two Tom’s: Tom Jackson is a member of Alex Ward Quintet, Alex Ward Sextet, Alex Ward Trio, ARCO & Sugarstick & Xerox. And Tow Ward. He’s a member of AKW, Beats And Pieces Big Band, Favourite Animals, Impetus Group,\n\nLondon Improvisers Orchestra, Cotovelo, Madwort Saxophone Quartet, Orchestra Entropy, Porpoise Corpus, Quadraceratops & Saxoctopus. All membership info comes from Discogs. So, it may not be accurate anymore. Anyhow, all musicians assembled here have joined the stage in one way or another and/or have music released on Raw Tonk and/or New Wave of Jazz. So this night at Café OTO was a great opportunity to get all these musicians together in one room. This release has two long pieces: aptly named 'Set One' and 'Set Two'. The first is almost half an hour long, and the second is nearly three-quarters of an hour. And what music this is. This is not music for lazy listeners. With ten musicians on stage, this could easily have gotten into a frenzy of loud sounds, building a wall of sound. Something like Luna Surface by Alan Silva and his Celestrial Communication Orchestra. But no: we get an entity of ten people who play eleven instruments (Tom Ward doubles on flute and bass clarinet) that\n\nweave an intricate tapestry of sound with different textures and tonal colours. Each individual excels at his or her instrument and is no stranger to playing in bigger ensembles. It’s not about ego, as I wrote many times before, but about creating an experience for the musicians. The audience is a bonus. Although an attentive audience helps, of course. As a listener we take a journey in time. Music can only exist in time. Let us get into the philosophical discussion: does music or a sound exist even without a listener? And yes, music is about communication. And these ten musiciancs have created two pieces of music that reward many repeated listening rounds. There are solos, duos, trios, and many more constellations within the ten musicians that occupy different layers (low, middle, high, highest) of the musical range of the instruments. Terrific stuff on this release. The cover is the painting that Gina Southgate made of the ten musicians while they were performing. It captures the spirit and mood of the evening very well. (MDS)\" Vital Weekly - The Netherlands\n\n\n\n\"De Belgische pianiste en fotografe Martina Verhoeven kreeg op 23 juli 2023 carte blanche in Cafe OTO, het Londense vrijbuitersnest voor jazzcats die improvisatie hoog in het vaandel voeren. Een exquisiet gezelschap naast Verhoeven daar op het podium met Andrew Lisle, Colin Webster, Benedict Taylor, Cath Roberts, Charlotte Keeffe, Daniel Thompson, Dirk Serries, Tom Jackson en Tom Ward. Voor wie het programma van Cafe OTO regelmatig inkijkt en zeker bij diegenen die de releases van improvisatielabels als New Wave Of Jazz, Klanggalerie of Raw Tonk Records opvolgen, klinken al deze namen bekend in de oren. Dit zijn muzikanten die vrijheid maar vooral ook wederzijds respect als vaste leidraad hanteren. De cd is onderverdeeld in twee sets van respectievelijk zesentwintig en drieënveertig minuten. Het thema van het event: ‘Free is The Space’. Een eerste kennismaking gebeurt aan de hand van het volledige instrumentarium dat rustig aan zet is, alsof je een concertzaal binnenstapt waar het orkest aan het stemmen is. Vergis u niet, iedereen staat hier al op scherp en hanteert zijn instrument op zeer persoonlijke wijze. Dat is misschien niet volgens de regels van een klassieke leerschool maar het zorgt wel voor een uiterst avontuurlijk en intrigerend klankenensemble. Gradueel vormt zich een vast patroon en zetten ze expliciete ankerpunten uit. Te vergelijken met een cijfertekening waarbij alle punten met elkaar verbonden moeten worden en finaal een afgewerkte afbeelding opduikt.\n\nVerhoeven en Co doen dit met (losse) noten en sonoriteiten die ze meestal op onorthodoxe wijze naar voor schuiven. Niemand eist daarbij een prominente rol op, ook al krijgt elkeen wel een moment om een persoonlijk idee voorop te zetten. Dit gebeurt echter steeds in de context van een gezamenlijke ontplooiing. Een democratisch rollenpatroon zoals dat bij goede improvisatie geldt. In enkele passages laten ze het geheel ontsporen om vervolgens alles te resetten en sluimerend een volgende zet te bedenken. Extra aandacht gaat naar de hoesillustratie van Gina Southgate die bekendstaat in de Londense improscene om de werken die ze sinds drie decennia instant schildert tijdens de concerten. Uitgebracht als uitvouwbare eco digipack.\" Jazzenzo - The Netherlands\n\n\n\nMoors Magazine : \"Martina Verhoeven is een Vlaamse pianiste die het muzikale avontuur graag opzoekt, in verschillende bezettingen. Het album Martina Verhoeven Invites bevat twee sessies die opgenomen werden in Cafe Oto in Londen op 23 juli 2023. Gina Southgate maakte tijdens het concert het schilderij dat op de cover van het hoesje staat, en dat de actie van de musici perfect weet vast te leggen, wat mij betreft – veel kleur, veel beweging, en een bijzondere manier van samenspel. Twee lange improvisaties – Set One een klein half uur, Set Two zo’n drie kwartier, waarin de musici van schijnbare chaos naar subtiele harmonie en weer terug reizen. Geen muziek om als achtergrond te gebruiken, zoals een toevallige bezoeker hier constateerde – je moet hier echt even voor gaan zitten en aandachtig luisteren, dan hoor je hoe al die virtuoze musici samen muzikaal de grenzen opzoeken en hoe spannend dat is.\n\n Naast Martina Verhoeven op vleugel hoor je Andrew Lisle op drums, Benedict Taylor op altviool, Cath Roberts op baritonsax, Charlotte Keeffe op trompet, Colin Webster op altsax, Daniel Thompson op akoestische gitaar en Dirk Serries op elektrische gitaar, Tom Jackson op klarinet en Tom Ward op basklarinet en fluit. Voorwaar een geweldig gezelschap, dat het klappen van de zweep al kent, en hier scherp en met passie zit te spelen. Luister maar eens naar de fragmenten die ik laat horen, en beluister ze vooral een paar keer, want het gaat altijd om de details en de subtiele samenwerking.\"\n\n\n\n\"Ook ‘Martina Verhoeven Invites’ bevat volledig geïmproviseerde muziek, vandaar dat de twee delen simpelweg ‘Set 1’ en ‘Set 2′ als titel hebben meegekregen. Klanken komen van alle kanten, vormen zeer geleidelijk een bouwwerk. We horen de blazers in samenhang en tegelijkertijd ook weer niet, horen Lisle’s slagen, Ward erdoor heen priemen op fluit en de gitaristen en de altviool zijn aanwezig met ietwat stug snarenspel. De muziek krijgt vaart, het tumult neemt toe, Verhoeven laat zich echter geenszins tegenhouden en breekt erdoor heen met krachtig spel. Dan doet toch weer de rust zijn intrede, of we in een duister woud zijn beland, zo klinkt het hier. Verderop komt de dynamiek echter weer terug en belanden we in een redelijk chaotische noise explosie. En met een tentet betekent dat vanzelfsprekend een overdaad aan klanken. Creatieve blazersbewegingen, heftig snarenspel, terwijl piano en drums het geheel afmaken. Na de volgende rustige frase ontstaat er ineens ritmiek, als dat van een trein, terwijl de spanning wederom oploopt en die ritmiek als vanzelf oplost in de chaos.\" Nieuwe Noten\n\n\n\n\"Ledwie tydzień temu omawialiśmy na tych łamach nagranie ośmioosobowego Large Ensemble Colina Webstera, zarejestrowane w londyńskim Cafe Oto w październiku ubiegłego roku. Teraz cofamy się w czasie o trzy miesiące i na tej samej scenie spotykamy tentet firmowany nazwiskiem belgijskiej pianistki Martiny Verhoeven.\n\nZauważmy, iż w ujęciu personalnym aż pięciu muzyków uczestniczyło w obu nagraniach – Colin Webster, Cath Roberts, Dirk Series, Charlotte Keeffe i Andrew Lisle. W tentecie Martiny poza nią samą spotykamy jeszcze Daniela Thompsona, Benedicta Taylora, Toma Warda i Toma Jacksona. Dobrze zapamiętany z zeszłotygodniowej pogadanki free jazzowy ansamble Webstera został tu poszerzony o zaciąg definitywnie free chamber (altówka, gitara akustyczna, klarnety, flet). I taka jest dwusetowa ekspozycja formacji Martiny – dużo w niej free jazzu, ale i pełne garście wysmakowanej kameralistyki. Na prawie 70 minut oddajmy się temu strumieniowi dźwiękowemu.\n\nZgodnie z nakreśloną w preambule recenzji dwubiegunowością, koncert otwarty zostaje w aurze kameralnej (drobne frazy w pobliżu ciszy, mroczne, acz leniwe i wystudzone), by już po kilku minutach płonąć ogniem free jazzu. Z jednej strony barytonistka i alcista w roli szalbierców ekspresji, z drugiej altowiolinista, klarnecista i flecista po stronie kojących emocje. Jakby po środku tych pozornie przeciwstawnych frakcji dwaj różnobarwni gitarzyści i pianistka, która czuwa nad dramaturgią, a jeśli trzeba dolać oliwy do ognia, czyni to z dalece post-klasyczną nutą. W fazie kameralnej narracja skrzy się ogromem akustycznej urody altówki, gitary, niekiedy także trąbki. W fazie free jazzowego wulkanu do ognia dokładają tu wszyscy, nie sposób wszakże nie podkreślić roli gitary elektrycznej i silnie unerwionej perkusji. Niezależnie wszakże od poziomu zadanej ekspresji, każdy z uczestników spektaklu wchodzi z partnerami w wyłącznie udane interakcje. Nim ponad 26-minutowy set pierwszy dokona swojego żywota, artyści dostarczą nam jeszcze moc różnorodnych zdarzeń – fazę cmokającej ciszy, ekstatyczny duet altówki i gitary akustycznej, wreszcie kilka kolejnych akcji piana, które w tym tyglu niekończących się akcji i reakcji zdaje się dysponować najbardziej rozbudowanym arsenałem środków wyrazu.\n\nDrugi set trwa ponad 40 minut i przynosi jeszcze większą porcję emocji i silnie kontrastujących ze sobą faz. Ognisty, kompulsywny początek wydaje się pewnym zaskoczeniem. Piano pachnie tu Schlippenbachem, akcje dętych mocą kolejnej reinkarnacji Machine Gun. Równie zaskakujące jest szybkie wytłumienie wprost w objęcia permanentnie kreatywnej altówki. Chwila ballady, a zaraz potem struga post-aylerowskich melodii. W tej fazie koncertu pianistka powraca z post-klasycznym sznytem, z kolei gitarzyści raz po raz szyją ściegiem, którego byśmy się po nich nie spodziewali. Z tym ostatnimi często po drodze ma trębaczka, która chyba najczęściej staje okrakiem na najważniejszej tego wieczoru dychotomii – chamber/ free jazz! Po upływie kwadransa improwizacja wspina się na jeden z bardziej ekspresyjnych szczytów, a na etapie falling down przypomina watahę rannych kojotów po przedawkowaniu. I znów kilka chwili wystarczy, by z plejady separatywnych półokrzyków uformować free jazzowy lej gorącej lawy, który zastygnie po niedługiej chwili w martwej melodii. Ostatni kwadrans koncertu, to prawdziwa huśtawka nastrojów. Gdy już widać kameralną finalizację, nagle z szeregu wypada kolejny muzyk i rwie ansambl do lotu (brawo saksofon altowy!). Z kolei fazy kameralnych podmuchów zimnego powietrza (brawo altówka!) w ułamku sekundy potrafią skrzyć się nowymi emocjami. Ostatecznie tentet umiera po podwójnym pokonaniu dużego wzniesienia. Perfekcyjne ugaszony flow wpada wprost w deszcz rzęsistych oklasków, których na albumie jednak nie słyszymy. \" Spontaneous Music Tribune\n\n\n\n\"Dirk Serries can also be found on another live album alongside his wife Martina Verhoeven (on grand piano) as the part of an even larger ensemble of ten players, which includes the Large Ensemble members Colin Webster (alto sax), Andrew Isle (drums), Cath Roberts (baritone sax) and Charlotte Keefe (trumpet) as well. With Martina's piano, Tom Jackson on clarinet and Tom Ward on bass clarinet however, the two performances immortalized here develop a different, playfully whirling flavour, at times building up to downright orchestral magnitude.\n\nThere's no way for me to describe all the shifts, dynamics, dramatic ups and downs and instances of magical communication in these two improvisations of twenty-six and forty-three minutes length.\n\nEven though ten people in full Avantgarde Free Jazzploitation mode is a lot, it is obvious that everyone knows everyone and they've all made music together in countless different constellations before. This one quite likely is among the most maximalist gatherings of this circle - a breathtaking journey, which hardly could reward the listener's attention more. \" Audiovisual Ohlsen Overkill\n\n\n\n\"Belgian pianist-photographer (and bassist and mindfulness trailer) Martina Verhoeven began her career as a free improviser only seven years ago, most of the time joining the projects of her partner, prolific Belgian guitarist Dirk Serries, who expanded in the last fifteen years his cosmic ambient and drone sonic palette to free improvisation and avant-garde. On July 2023, London’s Café OTO gave Verhoeven a carte blanche to invite her kindred spirits and collaborative musicians and host an afternoon of free improv event, without borders, rules, and/or commitments, with the theme: Free is The Space. \n\n\n\nThe ten-musician ensemble, with Verhoeven on grand piano, Serries on electric guitar (all other musicians play acoustic instruments), and a few of London’s finest free scene improvisers (all took part in countless collaborative projects and all are regulars of Café OTO programs), was recorded live, with a live mix by Billy Steiger, and its performance was later mixed and mastered by Serries. The beautiful cover artwork of British visual artist Gina Southgate, created live during the performance, corresponds with American, musicWitness® paintings of Jeff Schlanger. The album offers two extended improvisations that capture both sets, about 70 minutes of fiery, urgent, and intense music, as expected from such an ad-hoc performance and ensemble. The music flows with its own, risk-taking, inner logic, but it is also layered and nuanced and sketches a rich tapestry of sounds and textures. There are echoes of the first wave of British and German free jazz orchestras but this ensemble has its independent sound that rarely references jazz music, and relies on the accumulated, collaborative experiences of its musicians, their fearless yet trusting dynamics, and their profound affinity. You immediately notice that these ten improvisers’ mindfulness is set into a truly collective, deep listening art of the moment, where the sonic sum, as well as its diverse and subtle combinations and alternating levels of energy, is bigger than its parts.\" Eyal Hareuveni/Percorsi Musicali.",
      "license": "all rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a2878846521_0",
      "trackinfo": [
        {
          "title": "Set One",
          "duration": "26:12",
          "lyrics": null
        },
        {
          "title": "Set Two",
          "duration": "43:13",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://dirkserries.bandcamp.com/album/at-future-dawn",
      "title": "At Future Dawn",
      "artist": "Dirk Serries",
      "classification": "paid",
      "tags": [
        "Experimental",
        "ambient",
        "freejazz",
        "improvisation",
        "minimal",
        "Antwerp"
      ],
      "item_id": 3295331758,
      "datePublished": "02 May 2024 00:00:00 GMT",
      "about": "All performed real-time at the home studio between April and December 2023. Mixed and mastered by Dirk Serries.",
      "credits": "released May 2, 2024\n            \n            Dirk Serries : electric guitar, effects.\n\n\n\nPhotography by Martina Verhoeven /  www.martinaverhoeven.com\n\n\n\n Originally released on Cloudchamber Recordings, 2024.",
      "license": "all rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a0084999576_0",
      "trackinfo": [
        {
          "title": "Stretching Zero",
          "duration": "18:40",
          "lyrics": null
        },
        {
          "title": "Blank Resurgence",
          "duration": "07:04",
          "lyrics": null
        },
        {
          "title": "A Bitter Grace",
          "duration": "07:08",
          "lyrics": null
        },
        {
          "title": "Semblance",
          "duration": "11:18",
          "lyrics": null
        },
        {
          "title": "The Sole Comportment",
          "duration": "09:28",
          "lyrics": null
        },
        {
          "title": "At Future Dawn",
          "duration": "13:52",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://dirkserries.bandcamp.com/album/live-at-oude-klooster-kapel-brecht",
      "title": "Live At Oude Klooster Kapel Brecht",
      "artist": "Hugo Costa/Dirk Serries/Friso Van Wijck",
      "classification": "paid",
      "tags": [
        "Experimental",
        "ambient",
        "freejazz",
        "improvisation",
        "minimal",
        "Antwerp"
      ],
      "item_id": 2745429139,
      "datePublished": "23 Apr 2024 00:00:00 GMT",
      "about": "Performed live in concert at Oude Klooster\n\nKapel (Brecht, Belgium) on September 23rd,\n\n2023.\n\nRecorded, mixed and mastered by Dirk Serries.",
      "credits": "released April 23, 2024\n            \n            Hugo Costa : alto sax\n\nDirk Serries : archtop guitar\n\nFriso Van Wijck : percussion\n\n\n\nOriginally released on Subcontinental Records.\n\n\n\n\"Serries produced and released albums for Portuguese, Rotterdam-based alto sax player Hugo Costa via his label A New Wave of Jazz (The Art of Crashing, with German drummer Philipp Ernsting, 2022, and Tongues of Flames of Gardua Trio with Rodrigo Pinheiro, 2024), and recorded before a trio album with Dutch percussionist Friso Van Wijck (Le Sud, Creative Sources, 2023, with British violist Benedict Taylor). Live At Oude Klooster Kapel Brecht / Belgium documents the second time this trio played together in September 2023, a year after its first performance.\n\nThe two free improvised pieces stress the open dynamics of this trio, allowing the spacious and ethereal pieces to flow and evolve naturally and easily, in their own accord and with their own inner logic, while exploring the unique acoustics of the chapel. The spirit of these collective improvisations is introspective and contemplative and Serries and Van Wijck color beautifully the melodic, lyrical sax flights of Costa with subtle and abstract ambient touches that correspond with the serene, spiritual space. Only towards the second piece, «Olber’s Paradox» (an argument in astrophysics and physical cosmology that says that the darkness of the night sky conflicts with the assumption of an infinite and eternal static universe), the trio erupts with full force.\" Salt Peanuts",
      "license": "all rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a3885595496_0",
      "trackinfo": [
        {
          "title": "Atopia",
          "duration": "28:15",
          "lyrics": null
        },
        {
          "title": "Olbers's Paradox",
          "duration": "19:33",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://dirkserries.bandcamp.com/album/governed-by-decay",
      "title": "Governed By Decay",
      "artist": "The Void Of Expansion",
      "classification": "paid",
      "tags": [
        "Experimental",
        "ambient",
        "freejazz",
        "improvisation",
        "minimal",
        "Antwerp"
      ],
      "item_id": 442246449,
      "datePublished": "12 Feb 2019 00:00:00 GMT",
      "about": null,
      "credits": "released February 12, 2019\n            \n            Tomas Järmyr : drums \n\nDirk Serries : electric guitar \n\n \n\n\n\nPerformed and recorded at Sunny Side Inc. Studio, Anderlecht (Belgium) on May 25th 2017. Mixed & mastered by Dirk Serries. \n\n\n\nArtwork and design by Juliane Schütz.\n\n\n\nReleased on vinyl/cd by Dunk! Records, 2019.",
      "license": "all rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a0831438862_0",
      "trackinfo": [
        {
          "title": "Material",
          "duration": "21:06",
          "lyrics": null
        },
        {
          "title": "Discord",
          "duration": "18:44",
          "lyrics": null
        },
        {
          "title": "Decay",
          "duration": "28:36",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://dirkserries.bandcamp.com/album/vectorial-spaces",
      "title": "Vectorial Spaces",
      "artist": "Andrew Lisle &amp; Dirk Serries",
      "classification": "paid",
      "tags": [
        "Experimental",
        "ambient",
        "freejazz",
        "improvisation",
        "minimal",
        "Antwerp"
      ],
      "item_id": 3852991750,
      "datePublished": "02 Apr 2024 00:00:00 GMT",
      "about": "Recorded, mixed and mastered at Sunny Side Inc. Studio, Anderlecht, Belgium, 30 January 2023",
      "credits": "released April 2, 2024\n            \n            Andrew Lisle - snare drum, cymbals\n\nDirk Serries - archtop guitar \n\n\n\nFourth release in Confront's CD EP length series, released on Confront Recordings. \n\nDesign by Mark Wastell. \n\n\n\nconfrontrecordings.bandcamp.com",
      "license": "all rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a0346741121_0",
      "trackinfo": [
        {
          "title": "I",
          "duration": "06:48",
          "lyrics": null
        },
        {
          "title": "II",
          "duration": "07:46",
          "lyrics": null
        },
        {
          "title": "III",
          "duration": "06:59",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://dirkserries.bandcamp.com/album/obsidian",
      "title": "Obsidian",
      "artist": "Benedict Taylor &amp; Dirk Serries",
      "classification": "paid",
      "tags": [
        "Experimental",
        "ambient",
        "freejazz",
        "improvisation",
        "minimal",
        "Antwerp"
      ],
      "item_id": 2065185476,
      "datePublished": "14 Jan 2024 00:00:00 GMT",
      "about": null,
      "credits": "released January 14, 2024",
      "license": "all rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a3642021102_0",
      "trackinfo": [
        {
          "title": "I",
          "duration": "07:20",
          "lyrics": null
        },
        {
          "title": "II",
          "duration": "05:12",
          "lyrics": null
        },
        {
          "title": "III",
          "duration": "11:26",
          "lyrics": null
        },
        {
          "title": "IV",
          "duration": "11:26",
          "lyrics": null
        },
        {
          "title": "V",
          "duration": "06:38",
          "lyrics": null
        },
        {
          "title": "VI",
          "duration": "08:42",
          "lyrics": null
        },
        {
          "title": "VII",
          "duration": "07:41",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://dirkserries.bandcamp.com/album/live-at-deep-listening-3",
      "title": "Live At Deep Listening #3",
      "artist": "Dirk Serries",
      "classification": "paid",
      "tags": [
        "Experimental",
        "ambient",
        "freejazz",
        "improvisation",
        "minimal",
        "Antwerp"
      ],
      "item_id": 1757192380,
      "datePublished": "02 Apr 2024 00:00:00 GMT",
      "about": "Performed live at Deep Listening #3 (Kapel Oude Klooster, Brecht Belgium) on March 24th, 2024. The Deep Listening series are curated by Martina Verhoeven.",
      "credits": "released April 2, 2024\n            \n            DIRK SERRIES : electric guitar, effects\n\n\n\nMixed and mastered by Dirk Serries.\n\n\n\nPhoto by Jan Kees Helms",
      "license": "all rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a3582715782_0",
      "trackinfo": [
        {
          "title": "Live At Deep Listening #3",
          "duration": "45:28",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://dirkserries.bandcamp.com/album/ashes-and-blues",
      "title": "Ashes And Blues",
      "artist": "The Void Of Expansion",
      "classification": "paid",
      "tags": [
        "Experimental",
        "ambient",
        "freejazz",
        "improvisation",
        "minimal",
        "Antwerp"
      ],
      "item_id": 2211850197,
      "datePublished": "13 Jun 2014 00:00:00 GMT",
      "about": null,
      "credits": "released June 13, 2014\n            \n            Tomas Järmyr : drums \n\nDirk Serries : electric guitar \n\n\n\nAshes and Blues was performed and recorded at Sunny Side Inc. Studio, Anderlecht, Belgium, February 15, 2014. Recorded and mixed by Nicolas Lefèvre. \n\nMastering by Dirk Serries. \n\n\n\nCD released on Substrata, 2018.\n\nVinyl edition originally released on Tonefloat's A New Wave Of Jazz, 2014",
      "license": "all rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a2263417787_0",
      "trackinfo": [
        {
          "title": "Paradox",
          "duration": "11:37",
          "lyrics": null
        },
        {
          "title": "Damper",
          "duration": "13:26",
          "lyrics": null
        },
        {
          "title": "Consecration",
          "duration": "15:44",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://dirkserries.bandcamp.com/album/earthworks",
      "title": "Earthworks",
      "artist": "Colin Webster &amp; Dirk Serries",
      "classification": "paid",
      "tags": [
        "Experimental",
        "ambient",
        "freejazz",
        "improvisation",
        "minimal",
        "Antwerp"
      ],
      "item_id": 2707372982,
      "datePublished": "25 Oct 2023 00:00:00 GMT",
      "about": "Recorded, mixed and mastered at Sunny Side Inc. Studio, Anderlecht (Belgium) on 9th May 2022",
      "credits": "released October 25, 2023\n            \n            Colin Webster - baritone saxophone\n\nDirk Serries - archtop guitar\n\n\n\nArtwork by Colin Webster\n\n\n\nOriginally released on Raw Tonk Records, 2023",
      "license": "all rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a3699905115_0",
      "trackinfo": [
        {
          "title": "I",
          "duration": "03:12",
          "lyrics": null
        },
        {
          "title": "II",
          "duration": "04:02",
          "lyrics": null
        },
        {
          "title": "III",
          "duration": "02:59",
          "lyrics": null
        },
        {
          "title": "IV",
          "duration": "01:58",
          "lyrics": null
        },
        {
          "title": "V",
          "duration": "03:24",
          "lyrics": null
        },
        {
          "title": "VI",
          "duration": "02:59",
          "lyrics": null
        },
        {
          "title": "VII",
          "duration": "04:09",
          "lyrics": null
        },
        {
          "title": "VIII",
          "duration": "06:33",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://dirkserries.bandcamp.com/album/escaper",
      "title": "Escaper",
      "artist": "The Void Of Expansion",
      "classification": "paid",
      "tags": [
        "Experimental",
        "ambient",
        "freejazz",
        "improvisation",
        "minimal",
        "Antwerp"
      ],
      "item_id": 4180316347,
      "datePublished": "29 Apr 2024 00:00:00 GMT",
      "about": "The Void Of Expansion: \n\nDirk Serries - guitar \n\nTomas Järmyr - drums\n\n\n\nPerformed and recorded at the Sunny Side Inc. Studio (Anderlecht, Belgium) on November 17th, 2022. Mixed by Tomas Järmyr. Mastered by Dirk Serries.",
      "credits": "released April 29, 2024\n            \n            Thanks to Frank Jacobs at Pearl Drums Europe, Jarle Johansen at CRS, Vidar Kolberg at 4Sound Trondheim and to Wout of DUNK! Records.\n\n\n\nPhotography by Martina Verhoeven.\n\nDesign by Rutger Zuydervelt.\n\n\n\nOriginal release on DUNK! Records.",
      "license": "all rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a2330073507_0",
      "trackinfo": [
        {
          "title": "Visage",
          "duration": "14:19",
          "lyrics": null
        },
        {
          "title": "Murmur",
          "duration": "11:56",
          "lyrics": null
        },
        {
          "title": "Draught",
          "duration": "13:41",
          "lyrics": null
        },
        {
          "title": "Vessel",
          "duration": "14:20",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://dirkserries.bandcamp.com/album/le-sud",
      "title": "Le Sud",
      "artist": "Dirk Serries / Benedict Taylor / Friso Van Wijck",
      "classification": "paid",
      "tags": [
        "Experimental",
        "ambient",
        "freejazz",
        "improvisation",
        "minimal",
        "Antwerp"
      ],
      "item_id": 164459075,
      "datePublished": "26 May 2023 00:00:00 GMT",
      "about": "Live in concert at Koffie & Ambacht’s Le Sud (Rotterdam, The Netherlands) on September 29th, 2022.",
      "credits": "released May 26, 2023\n            \n            Dirk Serries : archtop guitar\n\nBenedict Taylor : viola\n\nFriso Van Wyck : drums and percussion\n\n\n\nRecorded, mixed and mastered by Dirk Serries. \n\nPaintings by Friso Van Wyck.\n\n\n\nLayout by Carlos Santos\n\nProduction by Ernesto Rodrigues.\n\n\n\nOriginally released on Creative Sources, 2023.",
      "license": "all rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a3885843964_0",
      "trackinfo": [
        {
          "title": "Part One",
          "duration": "37:30",
          "lyrics": null
        },
        {
          "title": "Part Two",
          "duration": "32:50",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://dirkserries.bandcamp.com/album/dripping",
      "title": "Dripping",
      "artist": "Ernesto Rodrigues / Dirk Serries / João Madeira / José Oliveira",
      "classification": "paid",
      "tags": [
        "Experimental",
        "ambient",
        "freejazz",
        "improvisation",
        "minimal",
        "Antwerp"
      ],
      "item_id": 3319488642,
      "datePublished": "25 Oct 2023 00:00:00 GMT",
      "about": "Recorded on May 7th, 2023 in Lisbon.\n\nRecorded, mixed, and mastered by João Madeira.",
      "credits": "released October 25, 2023\n            \n            Ernesto Rodrigues : viola and crackle box\n\nDirk Serries : archtop guitar\n\nJoão Madeira: double bass\n\nJosé Oliveira : percussion\n\n\n\nWater drawings by Dilar Pereira.\n\nGraphic design by Carlos Santos.\n\nProduction by Ernesto Rodrigues.\n\n\n\nOriginally released on Creative Sources, 2023.",
      "license": "all rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a4135841715_0",
      "trackinfo": [
        {
          "title": "I",
          "duration": "05:44",
          "lyrics": null
        },
        {
          "title": "II",
          "duration": "06:37",
          "lyrics": null
        },
        {
          "title": "III",
          "duration": "05:48",
          "lyrics": null
        },
        {
          "title": "IV",
          "duration": "08:27",
          "lyrics": null
        },
        {
          "title": "V",
          "duration": "03:58",
          "lyrics": null
        },
        {
          "title": "VI",
          "duration": "02:44",
          "lyrics": null
        },
        {
          "title": "VII",
          "duration": "08:11",
          "lyrics": null
        },
        {
          "title": "VIII",
          "duration": "07:04",
          "lyrics": null
        },
        {
          "title": "IX",
          "duration": "07:28",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://dirkserries.bandcamp.com/album/density-dots",
      "title": "Density Dots",
      "artist": "Impetus Group",
      "classification": "paid",
      "tags": [
        "Experimental",
        "ambient",
        "freejazz",
        "improvisation",
        "minimal",
        "Antwerp"
      ],
      "item_id": 1947315725,
      "datePublished": "09 Oct 2023 00:00:00 GMT",
      "about": "Tom Jackson : clarinet\n\nColin Webster : alto sax\n\nMartina Verhoeven : piano\n\nDirk Serries : archtop guitar, amplified \n\nTeun Verbruggen : drums",
      "credits": "released October 9, 2023\n            \n            Performed, recorded, mixed and mastered at the Sunny Side Inc. Studio, Anderlecht (Belgium) on February 26th, 2022.\n\n\n\nPhotography by Martina Verhoeven. \n\nDesign by Rutger Zuydervelt.\n\n\n\nCD released on Klanggalerie, 2023.",
      "license": "all rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a2958629086_0",
      "trackinfo": [
        {
          "title": "Unitary Mark",
          "duration": "04:36",
          "lyrics": null
        },
        {
          "title": "Subfield",
          "duration": "08:09",
          "lyrics": null
        },
        {
          "title": "Inflow",
          "duration": "05:12",
          "lyrics": null
        },
        {
          "title": "Linguistic Fortune",
          "duration": "11:30",
          "lyrics": null
        },
        {
          "title": "Swampy",
          "duration": "06:12",
          "lyrics": null
        },
        {
          "title": "Region Mash",
          "duration": "08:36",
          "lyrics": null
        },
        {
          "title": "Density Dot",
          "duration": "05:39",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://dirkserries.bandcamp.com/album/the-disintegration-of-silence",
      "title": "The Disintegration Of Silence",
      "artist": "Dirk Serries",
      "classification": "paid",
      "tags": [
        "Experimental",
        "ambient",
        "freejazz",
        "improvisation",
        "minimal",
        "Antwerp"
      ],
      "item_id": 2399698038,
      "datePublished": "23 Sep 2023 00:00:00 GMT",
      "about": "Performed, recorded, mixed and mastered by Dirk Serries 2023.",
      "credits": "released September 23, 2023\n            \n            Dirk Serries : electric guitar, effects.\n\n\n\nCover artwork by Stefano Gentile.\n\n\n\nOriginally released on Silentes/13, 2023.",
      "license": "all rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a2876717784_0",
      "trackinfo": [
        {
          "title": "Granulate",
          "duration": "12:08",
          "lyrics": null
        },
        {
          "title": "Weathering",
          "duration": "09:35",
          "lyrics": null
        },
        {
          "title": "Omission",
          "duration": "06:00",
          "lyrics": null
        },
        {
          "title": "Seclude",
          "duration": "08:29",
          "lyrics": null
        },
        {
          "title": "Reflection",
          "duration": "21:10",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://dirkserries.bandcamp.com/album/the-fluctuation-of-being",
      "title": "The Fluctuation Of Being",
      "artist": "Dirk Serries",
      "classification": "paid",
      "tags": [
        "Experimental",
        "ambient",
        "freejazz",
        "improvisation",
        "minimal",
        "Antwerp"
      ],
      "item_id": 2319105178,
      "datePublished": "05 May 2023 00:00:00 GMT",
      "about": "Performed, recorded, mixed and mastered by Dirk Serries throughout 2019 – 2022.",
      "credits": "released May 5, 2023\n            \n            Dirk Serries : electric guitar, effects.\n\n\n\nPhotography by Martina Verhoeven.  \n\nwww.martinaverhoeven.com\n\n\n\n  www.dirkserries.com\n\n\n\n Officially released on Midira Records, 2023.",
      "license": "all rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a3310556232_0",
      "trackinfo": [
        {
          "title": "Nothingness",
          "duration": "12:33",
          "lyrics": null
        },
        {
          "title": "The Fluctuation",
          "duration": "08:30",
          "lyrics": null
        },
        {
          "title": "Confinement",
          "duration": "07:45",
          "lyrics": null
        },
        {
          "title": "Despairing Object",
          "duration": "16:00",
          "lyrics": null
        },
        {
          "title": "Impasse",
          "duration": "10:35",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://dirkserries.bandcamp.com/album/nocturnal-discord",
      "title": "Nocturnal Discord",
      "artist": "Dirk Serries",
      "classification": "paid",
      "tags": [
        "Experimental",
        "ambient",
        "freejazz",
        "improvisation",
        "minimal",
        "Antwerp"
      ],
      "item_id": 2108664184,
      "datePublished": "17 Feb 2023 00:00:00 GMT",
      "about": "All performed real-time in January 2023 at the home studio.",
      "credits": "released February 17, 2023\n            \n            Dirk Serries : electric guitar, effects.  \n\n\n\nwww.dirkserries.com\n\n\n\n Officially released on cassette on Cloudchamber Recordings, 2023.",
      "license": "all rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a2832561153_0",
      "trackinfo": [
        {
          "title": "Displacement",
          "duration": "16:29",
          "lyrics": null
        },
        {
          "title": "Eye Of The Conscious",
          "duration": "11:36",
          "lyrics": null
        },
        {
          "title": "Environmental Input",
          "duration": "10:47",
          "lyrics": null
        },
        {
          "title": "The Moral Stage",
          "duration": "12:14",
          "lyrics": null
        },
        {
          "title": "Nocturnal Discord",
          "duration": "08:01",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://dirkserries.bandcamp.com/album/empty-homes",
      "title": "Empty Homes",
      "artist": "Loud As Giants",
      "classification": "paid",
      "tags": [
        "Experimental",
        "ambient",
        "electronic",
        "freejazz",
        "improvisation",
        "minimal",
        "new wave",
        "postrock",
        "shoegaze",
        "Antwerp"
      ],
      "item_id": 3572732302,
      "datePublished": "28 Apr 2023 00:00:00 GMT",
      "about": "Justin K. Broadrick and Dirk Serries have been musically in sync since the early eighties when they both were active in the underground cassette network, individually producing experimental, industrial, and noise music. \n\nBoth with the highest appreciation for each other’s work for almost two decades, they finally met during a joined tour where Dirk, as Fear Falls Burning, supported JESU during the CONQUEROR Tour. \n\n\n\nFinding out that they both had a huge admiration for each other’s immense discography and versatile musical activities, working together was only a matter of time. Remixes (for Vidna Obmana), reconstructions (for Continuum), collaborations (with Dirk Serries’ Microphonics and Fear Falls Burning), and helping each other out at concerts became a constant until finally, they unleashed LOUD AS GIANTS.",
      "credits": "released April 28, 2023\n            \n            LOUD AS GIANTS is Justin K Broadrick and Dirk Serries.\n\n\n\nAlbum is out on Consouling Sounds.",
      "license": "all rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a3833201461_0",
      "trackinfo": [
        {
          "title": "Monument",
          "duration": "12:30",
          "lyrics": null
        },
        {
          "title": "Estranged",
          "duration": "10:53",
          "lyrics": null
        },
        {
          "title": "Room Three",
          "duration": "12:11",
          "lyrics": null
        },
        {
          "title": "Isolation",
          "duration": "10:49",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://dirkserries.bandcamp.com/album/out-of-nowhere",
      "title": "Out Of Nowhere",
      "artist": "John Edwards / Andrew Lisle / Dirk Serries / Colin Webster",
      "classification": "paid",
      "tags": [
        "Experimental",
        "ambient",
        "freejazz",
        "improvisation",
        "minimal",
        "Antwerp"
      ],
      "item_id": 3404110537,
      "datePublished": "14 Feb 2023 00:00:00 GMT",
      "about": "John Edwards - double bass\n\nAndrew Lisle - drums\n\nDirk Serries - acoustic guitar\n\nColin Webster - alto saxophone",
      "credits": "released February 14, 2023\n            \n            Recorded at Cafe Oto, London on 30th January 2022\n\n\n\nRecorded by Shaun Crook\n\nMixed and mastered by Dirk Serries\n\n\n\nArtwork by Colin Webster\n\nLayout by Rutger Zuydervelt\n\n\n\nRaw Tonk Records 2023\n\nRT064",
      "license": "all rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a3862101298_0",
      "trackinfo": [
        {
          "title": "Out Of Nowhere",
          "duration": "35:48",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://dirkserries.bandcamp.com/album/cerebral-wired",
      "title": "Cerebral Wired",
      "artist": "Dirk Serries",
      "classification": "paid",
      "tags": [
        "Experimental",
        "ambient",
        "freejazz",
        "improvisation",
        "minimal",
        "Antwerp"
      ],
      "item_id": 3246081305,
      "datePublished": "27 Nov 2022 00:00:00 GMT",
      "about": "Recorded and mixed in March 2013. Restructured and mastered by Dirk Serries, November 2022.",
      "credits": "released November 27, 2022\n            \n            Dirk Serries : electric guitar, effects.\n\n\n\nPhotogaphy by Dirk Serries.",
      "license": "all rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a1011682558_0",
      "trackinfo": [
        {
          "title": "Cerebral Wired",
          "duration": "29:50",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://dirkserries.bandcamp.com/album/oud-klooster",
      "title": "Oud Klooster",
      "artist": "Colin Websteri/Dirk Serries/Emilie Škrijelj/Martina Verhoeven/Tom Malmendier",
      "classification": "paid",
      "tags": [
        "Experimental",
        "ambient",
        "freejazz",
        "improvisation",
        "minimal",
        "Antwerp"
      ],
      "item_id": 2472650229,
      "datePublished": "06 Oct 2022 00:00:00 GMT",
      "about": "Recorded at Oud Klooster, Brecht, Belgium on 5th May 2022\n\nMixed and mastered by Dirk Serries",
      "credits": "released October 6, 2022\n            \n            Colin Webster - Baritone Saxophone\n\nDirk Serries - Acoustic Guitar\n\nEmilie Škrijelj - Accordion\n\nMartina Verhoeven - Double Bass\n\nTom Malmendier - Percussion\n\n\n\nArtwork by Colin Webster\n\n\n\nRaw Tonk Records 2022\n\nRT061",
      "license": "all rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a1053477368_0",
      "trackinfo": [
        {
          "title": "Oud Klooster",
          "duration": "44:56",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://dirkserries.bandcamp.com/album/regeneration-live-at-hundred-years-gallery",
      "title": "Regeneration - Live At Hundred Years Gallery",
      "artist": "Dirk Serries",
      "classification": "paid",
      "tags": [
        "Experimental",
        "ambient",
        "freejazz",
        "improvisation",
        "minimal",
        "Antwerp"
      ],
      "item_id": 2581390071,
      "datePublished": "22 Jan 2023 00:00:00 GMT",
      "about": "Performed live at Hundred Years Gallery (London, UK) on October 27th 2022.",
      "credits": "released January 22, 2023\n            \n            DIRK SERRIES : electric guitar, effects\n\n\n\nMixed and mastered by Dirk Serries.\n\nPhotography : Dirk Serries.\n\n\n\nExtreme gratitude to Shaun Cullen and Graham MacKeachan.\n\n\n\nOriginally released on Hundred Years Gallery 2023.",
      "license": "all rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a2773399120_0",
      "trackinfo": [
        {
          "title": "Regeneration - Live At Hundred Years Gallery",
          "duration": "56:32",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://dirkserries.bandcamp.com/album/brecht",
      "title": "Brecht",
      "artist": "Ernesto Rodrigues, Guilherme Rodrigues, Nuno Torres &amp; Dirk Serries",
      "classification": "paid",
      "tags": [
        "Experimental",
        "ambient",
        "freejazz",
        "improvisation",
        "minimal",
        "Antwerp"
      ],
      "item_id": 3903356972,
      "datePublished": "23 Dec 2022 00:00:00 GMT",
      "about": "Recorded on November 4th 2022 at the Kapel Oude Klooster, Brecht, Belgium.",
      "credits": "released December 23, 2022\n            \n            Recorded, mixed and mastered by Dirk Serries.\n\n\n\nErnesto Rodrigues - viola\n\nGuilherme Rodrigues - cello\n\nNuno Torres - alto saxophone\n\nDirk Serries - archtop guitar\n\n\n\nGraphic design by Carlos Santos.\n\nProduction by Ernesto Rodrigues",
      "license": "all rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a4120962037_0",
      "trackinfo": [
        {
          "title": "Part One",
          "duration": "03:06",
          "lyrics": null
        },
        {
          "title": "Part Two",
          "duration": "37:18",
          "lyrics": null
        },
        {
          "title": "Part Three",
          "duration": "10:58",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://dirkserries.bandcamp.com/album/driven-live-at-roadburn-festival-2022",
      "title": "Driven - Live At Roadburn Festival 2022",
      "artist": "Martina Verhoeven Quintet",
      "classification": "paid",
      "tags": [
        "Experimental",
        "ambient",
        "freejazz",
        "improvisation",
        "minimal",
        "Antwerp"
      ],
      "item_id": 2885590353,
      "datePublished": "14 Oct 2022 12:06:33 GMT",
      "about": "Martina Verhoeven : piano \n\nGonçalo Almeida : double bass \n\nOnno Govaert : drums\n\nDirk Serries : guitar\n\nColin Webster : sax",
      "credits": "released October 14, 2022\n            \n            Recorded live in concert at Roadburn Festival 2022, Paradox (Tilburg, The Netherlands) on April 24th. This concert was part of Dirk Serries’ 4 days artist in residency. \n\n\n\nLive sound : Ronald Mariën\n\nMixing and mastering : Dirk Serries\n\n\n\nPhotography by Martina Verhoeven \n\nDesign by Rutger Zuydervelt\n\n\n\nThank you : Ronald Mariën, Walter Hoeijmakers and Roadburn crew, Bartho van Straaten and Paradox crew.",
      "license": "all rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a4137454522_0",
      "trackinfo": [
        {
          "title": "Driven",
          "duration": "49:31",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://dirkserries.bandcamp.com/album/the-listening-place",
      "title": "The Listening Place",
      "artist": "Dirk Serries",
      "classification": "paid",
      "tags": [
        "Experimental",
        "ambient",
        "freejazz",
        "improvisation",
        "minimal",
        "Antwerp"
      ],
      "item_id": 3790824849,
      "datePublished": "23 Oct 2022 00:00:00 GMT",
      "about": "live performance as part of MARTINA VERHOEVEN BUTTERFLY ZI's mindfulness session #6 at Kapel Oud Klooster (Brecht, Belgium), 10am on Saturday October 22nd, 2022.\n\n\n\nRecorded, mixed and mastered by Dirk Serries.",
      "credits": "released October 23, 2022\n            \n            Dirk Serries : electric guitar, effects.\n\n\n\nPhoto by Dirk Serries.",
      "license": "all rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a0298833820_0",
      "trackinfo": [
        {
          "title": "The Listening Place",
          "duration": "41:59",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://dirkserries.bandcamp.com/album/epitaph-live-at-roadburn-redux-2021",
      "title": "Epitaph. Live At Roadburn Redux 2021",
      "artist": "Dirk Serries",
      "classification": "paid",
      "tags": [
        "Experimental",
        "ambient",
        "freejazz",
        "improvisation",
        "minimal",
        "Antwerp"
      ],
      "item_id": 4278955495,
      "datePublished": "13 Apr 2022 00:00:00 GMT",
      "about": null,
      "credits": "released April 13, 2022",
      "license": "all rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a0115625993_0",
      "trackinfo": [
        {
          "title": "Part One",
          "duration": "15:32",
          "lyrics": null
        },
        {
          "title": "Part Two",
          "duration": "16:50",
          "lyrics": null
        },
        {
          "title": "Part Three",
          "duration": "20:33",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://dirkserries.bandcamp.com/album/live-at-roadburn-2022",
      "title": "Live At Roadburn 2022",
      "artist": "Dirk Serries",
      "classification": "paid",
      "tags": [
        "Experimental",
        "ambient",
        "freejazz",
        "improvisation",
        "minimal",
        "Antwerp"
      ],
      "item_id": 229812838,
      "datePublished": "25 Apr 2022 00:00:00 GMT",
      "about": "Live at Roadburn 2022, Paradox (Tilburg, The Netherlands) on April 21, 2022.",
      "credits": "released April 25, 2022\n            \n            Dirk Serries : electric guitar, effects\n\n\n\nLive mixing and recording : Ronald Mariën.\n\nMixed and mastered by Dirk Serries.\n\n\n\nThank you : Walter and the Roadburn crew, Bartho and the Paradox crew.\n\n\n\nPhoto by Tomasz Kasiarz",
      "license": "all rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a2290508109_0",
      "trackinfo": [
        {
          "title": "Live At Roadburn 2022",
          "duration": "53:05",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://dirkserries.bandcamp.com/album/the-sage-flower",
      "title": "The Sage Flower",
      "artist": "Guilherme Rodrigues &amp; Dirk Serries",
      "classification": "paid",
      "tags": [
        "Experimental",
        "ambient",
        "freejazz",
        "improvisation",
        "minimal",
        "Antwerp"
      ],
      "item_id": 4280121433,
      "datePublished": "12 Jul 2022 00:00:00 GMT",
      "about": "Recorded, mixed and mastered at the Sunny Side Inc. Studio (Anderlecht, Belgium) on March 13th, 2022. Released on Creative Sources.",
      "credits": "released July 12, 2022\n            \n            Guilherme Rodrigues : cello\n\nDirk Serries : archtop guitar\n\n\n\nPhotography by Martina Verhoeven.  www.martinaverhoeven.com\n\n\n\n  www.creativesourcesrec.com\n\n  www.newwaveofjazz.com\n\n  www.guilhermerodrigues.net",
      "license": "all rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a0200119849_0",
      "trackinfo": [
        {
          "title": "Landing I",
          "duration": "03:36",
          "lyrics": null
        },
        {
          "title": "Rejoinder",
          "duration": "03:53",
          "lyrics": null
        },
        {
          "title": "Bloom",
          "duration": "02:18",
          "lyrics": null
        },
        {
          "title": "Punctuation Marks",
          "duration": "08:44",
          "lyrics": null
        },
        {
          "title": "The Woody Stems",
          "duration": "05:23",
          "lyrics": null
        },
        {
          "title": "Unfold",
          "duration": "06:09",
          "lyrics": null
        },
        {
          "title": "A Palm",
          "duration": "01:44",
          "lyrics": null
        },
        {
          "title": "Landing II",
          "duration": "05:05",
          "lyrics": null
        },
        {
          "title": "Temperal",
          "duration": "02:28",
          "lyrics": null
        },
        {
          "title": "Shrubs",
          "duration": "03:11",
          "lyrics": null
        },
        {
          "title": "To Perfection",
          "duration": "02:02",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://dirkserries.bandcamp.com/album/die-h-fner-akten",
      "title": "Die Höfner Akten",
      "artist": "Dirk Serries &amp; Asmus Tietchens",
      "classification": "paid",
      "tags": [
        "Experimental",
        "ambient",
        "freejazz",
        "improvisation",
        "minimal",
        "Antwerp"
      ],
      "item_id": 3933683409,
      "datePublished": "13 Jun 2022 00:00:00 GMT",
      "about": null,
      "credits": "released June 13, 2022\n            \n            Dirk Serries : acoustic guitar\n\nAsmus Tietchens : processing\n\n\n\n\n\nIris Pompesius – photo \n\nKarajew – graphic art \n\n\n\nwww.newwaveofjazz.com \n\n  www.tietchens.de\n\n  www.aufabwegen.com \n\n GEMA LC 02191",
      "license": "all rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a4091305048_0",
      "trackinfo": [
        {
          "title": "Höfner Akte 1A",
          "duration": "03:20",
          "lyrics": null
        },
        {
          "title": "Höfner Akte 2",
          "duration": "01:30",
          "lyrics": null
        },
        {
          "title": "Höfner Akte 3",
          "duration": "03:37",
          "lyrics": null
        },
        {
          "title": "Höfner Akte 3A",
          "duration": "03:52",
          "lyrics": null
        },
        {
          "title": "Höfner Akte 3B",
          "duration": "03:39",
          "lyrics": null
        },
        {
          "title": "Höfner Akte 3C",
          "duration": "03:33",
          "lyrics": null
        },
        {
          "title": "Höfner Akte 4",
          "duration": "02:10",
          "lyrics": null
        },
        {
          "title": "Höfner Akte 4A",
          "duration": "01:45",
          "lyrics": null
        },
        {
          "title": "Höfner Akte 5",
          "duration": "02:01",
          "lyrics": null
        },
        {
          "title": "Höfner Akte 7A",
          "duration": "02:31",
          "lyrics": null
        },
        {
          "title": "Höfner Akte 8",
          "duration": "03:45",
          "lyrics": null
        },
        {
          "title": "Höfner Akte 8A",
          "duration": "04:30",
          "lyrics": null
        },
        {
          "title": "Höfner Akte 9",
          "duration": "01:51",
          "lyrics": null
        },
        {
          "title": "Höfner Akte 10",
          "duration": "02:15",
          "lyrics": null
        },
        {
          "title": "Höfner Akte 11",
          "duration": "05:08",
          "lyrics": null
        },
        {
          "title": "Höfner Akte 12",
          "duration": "04:21",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://dirkserries.bandcamp.com/album/the-chapters-of-the-eclipse",
      "title": "The Chapters Of The Eclipse",
      "artist": "Alio Die &amp; Dirk Serries",
      "classification": "paid",
      "tags": [
        "Experimental",
        "ambient",
        "freejazz",
        "improvisation",
        "minimal",
        "Antwerp"
      ],
      "item_id": 2726821934,
      "datePublished": "01 Jul 2022 00:00:00 GMT",
      "about": "All tracks composed and played by Stefano Musso (Bmi) and Dirk Serries in 2014 and 2022, at Lunae studio, Italy and in Belgiun.",
      "credits": "released July 1, 2022\n            \n            Alio Die: Psaltery, zither, drones and loops. \n\nDirk Serries: electric guitar, effects.\n\n\n\nCover pictures by Hic Sunt Leones , artwork by Sam Rosenthal.",
      "license": "all rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a1100406547_0",
      "trackinfo": [
        {
          "title": "Without the Light of the Sky, Time Is Lost",
          "duration": "24:06",
          "lyrics": null
        },
        {
          "title": "The Shadow Is Slow, The Hour Is Fleeting",
          "duration": "17:56",
          "lyrics": null
        },
        {
          "title": "The Sun From The Point Of View Of The Earth",
          "duration": "19:42",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://dirkserries.bandcamp.com/album/the-ruin-of-all-space",
      "title": "The Ruin Of All Space",
      "artist": "Dirk Serries",
      "classification": "paid",
      "tags": [
        "Experimental",
        "ambient",
        "freejazz",
        "improvisation",
        "minimal",
        "Antwerp"
      ],
      "item_id": 831282970,
      "datePublished": "29 Mar 2022 00:00:00 GMT",
      "about": "Unreleased long form piece that was initially recorded in 2017. Recovered and mastered in March 2022.",
      "credits": "released March 29, 2022\n            \n            Dirk Serries : electric guitar, effects.\n\n\n\nPhotography by Martina Verhoeven.",
      "license": "all rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a2938164023_0",
      "trackinfo": [
        {
          "title": "The Ruin Of All Space",
          "duration": "40:47",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://dirkserries.bandcamp.com/album/smothered-hope-infinite-daze-2",
      "title": "Smothered Hope. Infinite Daze",
      "artist": "Dirk Serries",
      "classification": "paid",
      "tags": [
        "Experimental",
        "ambient",
        "freejazz",
        "improvisation",
        "minimal",
        "Antwerp"
      ],
      "item_id": 3403460111,
      "datePublished": "25 Feb 2022 00:00:00 GMT",
      "about": "Originally planned as a release on Substrata (Mexico). Redrawn by the artist and parts were reworked for other projects. This is the original recording.",
      "credits": "released February 25, 2022\n            \n            instruments : electric guitar, analog, and digital effects. recorded June 2016, mixed and mastered by Dirk Serries.\n\n\n\nphotography by Martina Verhoeven.",
      "license": "all rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a2173879543_0",
      "trackinfo": [
        {
          "title": "Part One",
          "duration": "20:20",
          "lyrics": null
        },
        {
          "title": "Part Two",
          "duration": "16:45",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://dirkserries.bandcamp.com/album/the-short-noise-we-left-behind",
      "title": "The Short Noise We Left Behind",
      "artist": "Dirk Serries",
      "classification": "paid",
      "tags": [
        "Experimental",
        "ambient",
        "freejazz",
        "improvisation",
        "minimal",
        "Antwerp"
      ],
      "item_id": 2993369704,
      "datePublished": "30 Mar 2022 00:00:00 GMT",
      "about": "Unreleased solo recording session.",
      "credits": "released March 30, 2022\n            \n            Performed and recorded at Sunny Side Inc. Studio, Anderlecht (Belgium) on August 19th & 20th 2017. Mastered in March 2022.\n\n\n\nDirk Serries: electric guitar, effects, amps.\n\n\n\nPhotography by Dirk Serries.",
      "license": "all rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a3860421215_0",
      "trackinfo": [
        {
          "title": "I",
          "duration": "19:40",
          "lyrics": null
        },
        {
          "title": "II",
          "duration": "14:11",
          "lyrics": null
        },
        {
          "title": "III",
          "duration": "20:03",
          "lyrics": null
        },
        {
          "title": "IV",
          "duration": "40:51",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://dirkserries.bandcamp.com/album/live-at-lokerse-jazzclub",
      "title": "Live At Lokerse Jazzclub",
      "artist": "Peter Jacquemyn &amp; Dirk Serries",
      "classification": "paid",
      "tags": [
        "Experimental",
        "ambient",
        "freejazz",
        "improvisation",
        "minimal",
        "Antwerp"
      ],
      "item_id": 3210260454,
      "datePublished": "05 Oct 2021 00:00:00 GMT",
      "about": "Originally released on Raw Tonk Records, 2021.",
      "credits": "released October 5, 2021\n            \n            Peter Jacquemyn : double bass\n\nDirk Serries : guitar\n\n\n\nLive performance at the Lokerse Jazzblub, Lokeren (Belgium) on September 5th, 2020.\n\nRecorded, mixed and mastered by Dirk Serries.\n\n\n\nDesign by Colin Webster",
      "license": "all rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a1144746855_0",
      "trackinfo": [
        {
          "title": "Live At Lokerse Jazzclub",
          "duration": "54:20",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://dirkserries.bandcamp.com/album/cb",
      "title": "CB",
      "artist": "Scatterwound",
      "classification": "paid",
      "tags": [
        "Experimental",
        "ambient",
        "freejazz",
        "improvisation",
        "minimal",
        "Antwerp"
      ],
      "item_id": 2081383447,
      "datePublished": "28 May 2021 00:00:00 GMT",
      "about": "Tape originally released on Midira Records.",
      "credits": "released May 28, 2021\n            \n            SCATTERWOUND - CB \n\n\n\nSide A : live performed at Castle Bouckenborgh (Merksem, Belgium) on April 24th, 2018.\n\nSound & Recording : Johan Vigoureux, Bo Engelen & Fredje De Roeck\n\nMastered by Dirk Serries. \n\nSide B : remixed by Duane Pitre.\n\n\n\nSCATTERWOUND :\n\n\n\nDirk Serries : electric guitar, effects, amps\n\nHellmut Neidhardt : electric guitar, effects, amps",
      "license": "all rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a0016559277_0",
      "trackinfo": [
        {
          "title": "Merksem",
          "duration": "15:08",
          "lyrics": null
        },
        {
          "title": "Merksem (Remixed By Duane Pitre)",
          "duration": "17:34",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://dirkserries.bandcamp.com/album/chapel",
      "title": "Chapel",
      "artist": "George Hadow &amp; Dirk Serries",
      "classification": "paid",
      "tags": [
        "Experimental",
        "ambient",
        "freejazz",
        "improvisation",
        "minimal",
        "Antwerp"
      ],
      "item_id": 2084603519,
      "datePublished": "05 Oct 2021 00:00:00 GMT",
      "about": "Originally released on Creative Sources, 2021.",
      "credits": "released October 5, 2021\n            \n            George Hadow : drums\n\nDirk Serries : guitar\n\n\n\nLive at GROELS KAPEL (Bocholt, Belgium) on September 4th, 2021. A Jazzblazzt event.\n\n\n\nRecorded by Dirk Serries. Mixed and mastered at the Sunny Side Inc. Studio (Anderlecht, Belgium).\n\n\n\nPhotography by Martina Verhoeven. Layout : Carlos Santos.\n\n\n\nGratitude to Jazzblazzt and J.P.",
      "license": "all rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a3875569843_0",
      "trackinfo": [
        {
          "title": "Live At Groels Kapel",
          "duration": "49:43",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://dirkserries.bandcamp.com/album/peck-and-fleet",
      "title": "Peck And Fleet",
      "artist": "John Edwards/Andrew Lisle/Dirk Serries/Colin Webster",
      "classification": "paid",
      "tags": [
        "Experimental",
        "ambient",
        "freejazz",
        "improvisation",
        "minimal",
        "Antwerp"
      ],
      "item_id": 2301170850,
      "datePublished": "31 May 2021 00:00:00 GMT",
      "about": "Limited vinyl release on Raw Tonk Records.",
      "credits": "released May 31, 2021\n            \n            John Edwards : double bass\n\nAndrew Lisle : percussion\n\nDirk Serries : acoustic guitar\n\nColin Webster : alto sax\n\n\n\nRecorded at the Dave Hunt Studio, London on February 8th 2020 \n\nMixed by Dave Hunt. Mastered at Sunny Side Inc. Studio\n\n\n\nArtwork by Colin Webster. Layout by Rutger Zuydervelt",
      "license": "all rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a2003696745_0",
      "trackinfo": [
        {
          "title": "Peck",
          "duration": "22:11",
          "lyrics": null
        },
        {
          "title": "Fleet",
          "duration": "24:24",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://dirkserries.bandcamp.com/album/live-at-ozo-land",
      "title": "Live At OZO Land",
      "artist": "Gonçalo Almeida &amp; Dirk Serries",
      "classification": "paid",
      "tags": [
        "Experimental",
        "ambient",
        "freejazz",
        "improvisation",
        "minimal",
        "Antwerp"
      ],
      "item_id": 1668681129,
      "datePublished": "05 Oct 2021 00:00:00 GMT",
      "about": "Originally released on Cylinder Recordings, 2021.",
      "credits": "released October 5, 2021\n            \n            Gonçalo Almeida : double bass\n\nDirk Serries : guitar\n\n\n\nRecorded live on June 5, 2021 at OZO Land (Hunsel, NL) during JazzBlazzt series. \n\nMixed by Dirk Serries. Mastered At The Sunny Side Inc. Studio (Anderlecht, Belgium)\n\n\n\nPhoto by Pedro dos Reis.",
      "license": "all rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a3128659613_0",
      "trackinfo": [
        {
          "title": "Live At OZO Land",
          "duration": "01:09:09",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://dirkserries.bandcamp.com/album/keeper-of-the-flame",
      "title": "Keeper Of The Flame",
      "artist": "Dirk Serries",
      "classification": "paid",
      "tags": [
        "Experimental",
        "ambient",
        "freejazz",
        "improvisation",
        "minimal",
        "Antwerp"
      ],
      "item_id": 2187813342,
      "datePublished": "01 Dec 2021 00:00:00 GMT",
      "about": "Unreleased long form piece recorded in 2018. Restructured, mixed, and mastered in November 2021.",
      "credits": "released December 1, 2021\n            \n            Dirk Serries : electric guitar, effects.\n\n\n\nPhoto by Dirk Serries.",
      "license": "all rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a3403687356_0",
      "trackinfo": [
        {
          "title": "Keeper Of The Flame",
          "duration": "41:19",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://dirkserries.bandcamp.com/album/live-at-walk-the-line-festival",
      "title": "Live At Walk The Line Festival",
      "artist": "Dirk Serries",
      "classification": "paid",
      "tags": [
        "Experimental",
        "ambient",
        "freejazz",
        "improvisation",
        "minimal",
        "Antwerp"
      ],
      "item_id": 1202407918,
      "datePublished": "22 Aug 2021 00:00:00 GMT",
      "about": null,
      "credits": "released August 22, 2021\n            \n            Improvised and performed live at Walk The Line Festival (Tivoli-Vredenburg Theater, Utrecht - The Netherlands) on August 8th, 2021.\n\n\n\nDirk Serries : electric guitar, effects.\n\n\n\nLive sound engineer and recording by Ronald Mariën.\n\nMixed and mastered by Dirk Serries.\n\n\n\nConcert photo by Tim Van Veen.",
      "license": "all rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a1307330997_0",
      "trackinfo": [
        {
          "title": "Live At Walk The Line Festival",
          "duration": "01:18:08",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://dirkserries.bandcamp.com/album/low",
      "title": "Low",
      "artist": "Dirk Serries",
      "classification": "paid",
      "tags": [
        "Experimental",
        "ambient",
        "freejazz",
        "improvisation",
        "minimal",
        "Antwerp"
      ],
      "item_id": 2874130543,
      "datePublished": "26 Oct 2021 00:00:00 GMT",
      "about": "Music originally recorded for a collaborative EP with an indie band, unfortunately never completed.",
      "credits": "released October 26, 2021\n            \n            Performed and recorded at the home studio, July 2020.\n\n\n\nDirk Serries : electric guitar, effects.\n\n\n\nMixed and mastered by Dirk Serries.\n\nAll hiss and noises are intentional.\n\n\n\nPhotography by Dirk Serries.",
      "license": "all rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a1734497927_0",
      "trackinfo": [
        {
          "title": "Low I",
          "duration": "05:29",
          "lyrics": null
        },
        {
          "title": "Low II",
          "duration": "05:56",
          "lyrics": null
        },
        {
          "title": "Low III",
          "duration": "05:31",
          "lyrics": null
        },
        {
          "title": "Low IV",
          "duration": "05:08",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://dirkserries.bandcamp.com/album/aesthetics",
      "title": "Aesthetics",
      "artist": "Serries/Verhoeven/Webster",
      "classification": "paid",
      "tags": [
        "Experimental",
        "ambient",
        "freejazz",
        "improvisation",
        "minimal",
        "Antwerp"
      ],
      "item_id": 2407606060,
      "datePublished": "18 May 2021 00:00:00 GMT",
      "about": "Limited edition cassette released on Fort Evil Tapes.",
      "credits": "released May 18, 2021\n            \n            Dirk Serries : acoustic guitar\n\nMartina Verhoeven : cello\n\nColin Webster : alto sax\n\n\n\nI-III : performed, recorded, mixed at the Sunny Side Inc.\n\nStudio, Anderlecht (Belgium) on December 15th 2018.\n\n\n\nIV : live in concert at Jurgen Moortgat’s living room\n\nconcert series (Mechelen, Belgium) on December 15th\n\n2018. Recorded and mixed by Dirk Serries.\n\n\n\nMastered at the Sunny Side Inc. Studio, Anderlecht\n\n(Belgium).\n\n\n\nFront cover design by Colin Webster",
      "license": "all rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a3896161531_0",
      "trackinfo": [
        {
          "title": "Aesthetics I",
          "duration": "07:54",
          "lyrics": null
        },
        {
          "title": "Aesthetics II",
          "duration": "08:23",
          "lyrics": null
        },
        {
          "title": "Aesthetics III",
          "duration": "07:29",
          "lyrics": null
        },
        {
          "title": "Aesthetics IV",
          "duration": "29:43",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://dirkserries.bandcamp.com/album/intermediate-obscurities-iii-live-at-spontaneous-music-festival-2019",
      "title": "Intermediate Obscurities III - Live At Spontaneous Music Festival 2019",
      "artist": "TONUS",
      "classification": "paid",
      "tags": [
        "Experimental",
        "ambient",
        "freejazz",
        "improvisation",
        "minimal",
        "Antwerp"
      ],
      "item_id": 210771833,
      "datePublished": "10 Oct 2020 00:00:00 GMT",
      "about": null,
      "credits": "released October 10, 2020\n            \n            TONUS - INTERMEDIATE OBSCURITIES III\n\nLive at Spontaneous Music Festival October 5th 2019\n\n\n\nPawel Doskocz (acoustic guitar)\n\nAndrew Lisle (percussion)\n\nOstap Mańko (violin)\n\nWitold Oleszak (piano)\n\nDirk Serries (acoustic guitar)\n\nAnna Szmatola (cello)\n\nBenedict Taylor (viola)\n\nColin Webster (alto sax)\n\n\n\nGraphic score by Dirk Serries.\n\n\n\nRecorded by Bartel Olszewski. Mixed and mastered by Witold Oleszak.",
      "license": "all rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a1876837293_0",
      "trackinfo": [
        {
          "title": "Intermediate Obscurities III",
          "duration": "40:21",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://dirkserries.bandcamp.com/album/live-at-br-kfest",
      "title": "Live at BRÅKFEST",
      "artist": "Kodian Trio",
      "classification": "paid",
      "tags": [
        "Experimental",
        "ambient",
        "freejazz",
        "improvisation",
        "minimal",
        "Antwerp"
      ],
      "item_id": 2366502777,
      "datePublished": "16 Mar 2021 00:00:00 GMT",
      "about": null,
      "credits": "released March 16, 2021\n            \n            Colin Webster : saxophone\n\nDirk Serries : guitar\n\nAndrew Lisle : drums \n\n\n\nRecorded at BRÅK Festival of Improvised Music, Hundred Years Gallery, 29 February 2020.\n\n\n\nProduced by Martin Clarke. Released on OEM Records.",
      "license": "all rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a0294763937_0",
      "trackinfo": [
        {
          "title": "Live at BRÅKFEST",
          "duration": "24:20",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://dirkserries.bandcamp.com/album/modulation-grid-ii",
      "title": "Modulation Grid II",
      "artist": "TONUS",
      "classification": "paid",
      "tags": [
        "Experimental",
        "ambient",
        "freejazz",
        "improvisation",
        "minimal",
        "Antwerp"
      ],
      "item_id": 2895336167,
      "datePublished": "15 Jan 2021 00:00:00 GMT",
      "about": "Limited edition cassette released on Midira Records.",
      "credits": "released January 15, 2021\n            \n            TONUS - MODULATON GRID II\n\nLive At Moving Noises 2019\n\n\n\nSide A : concert\n\nSide B : deconstruction\n\n\n\nMartina Verhoeven : concertina\n\nDirk Serries : accordeon\n\n\n\nLive At Moving Noises at Christuskirche (Bochum, Germany), February 2nd 2019.\n\nRecorded by Christoph Scheidel.\n\nMixed by Dirk Serries.\n\n\n\nDeconstructed by A-Sun Amissa\n\nReworked and reshaped in real time using the original live recording, 4-track tape manipulation and fx processing.\n\nRecorded in July 2020 by Richard Knox at Cloud Blunt Moon, Dark Peak, UK. \n\nwww.slowsecret.com\n\n\n\n Mastered by Dirk Serries.",
      "license": "all rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a1219191792_0",
      "trackinfo": [
        {
          "title": "Modulation Grid II - Live At Moving Noises Festival",
          "duration": "23:31",
          "lyrics": null
        },
        {
          "title": "Modulation Grid II (A-Sun-Amissa deconstruction)",
          "duration": "28:26",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://dirkserries.bandcamp.com/album/monograph-50",
      "title": "Monograph 50",
      "artist": "TONUS",
      "classification": "paid",
      "tags": [
        "Experimental",
        "ambient",
        "freejazz",
        "improvisation",
        "minimal",
        "Antwerp"
      ],
      "item_id": 419378104,
      "datePublished": "02 Oct 2020 00:00:00 GMT",
      "about": "Tonus is an ensemble project formed by Dirk Serries, focusing on the improvised relationship between sound and silence, often based upon a graphic score. It originated in 2017 at Serries' residency at Jazzcase in Limburg, Belgium, for which he brought together a sextet to work around a slow piano motif by Martina Verhoeven. \n\nThe literal translation of Tonus is muscle strength, but in this context defines a musical system that places equal importance on the space between notes. Both definitions apply here as the music is an exercise in discipline and anticipation while controlling the clarity, sustain and effect of each single note played. Tonus acts as a vehicle to explore and perform these exercises, as well as a general classification for his ongoing study in minimalism and free improvisation. \n\nMonograph 50 captures a two-set sextet performance at De Singer in Belgium organised to mark Serries' 50th birthday. Joining Serries on guitar and accordion are: Patrick De Groote (trumpet), Nils Vermeulen (double bass) Benedict Taylor (viola), Colin Webster (alto sax), and Martina Verhoeven (piano).\n\n\n\nLimited edition cassette available from Fort Evil Tapes  \n\nfortevilfruit.bandcamp.com/album/monograph-50",
      "credits": "released October 2, 2020\n            \n            Recorded live in concert on October 13th, 2018 at De Singer, Rijkevorsel (Belgium) by Nicolas Lefèvre and Glenn Willems.\n\nMixed and mastered at the Sunny Side Inc. Studio (Anderlecht, Belgium).\n\n\n\nPerformance based upon the graphic scores by Dirk Serries.\n\n\n\n\n\nTONUS :\n\n\n\nPatrick De Groote : trumpet, bugel\n\nDirk Serries : acoustic guitar, accordeon\n\nBenedict Taylor : viola\n\nMartina Verhoeven : piano\n\nNils Vermeulen : double bass\n\nColin Webster : alto sax \n\n\n\nwww.newwaveofjazz.com\n\n\n\n FEF96",
      "license": "all rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a1814767224_0",
      "trackinfo": [
        {
          "title": "50.1",
          "duration": "37:41",
          "lyrics": null
        },
        {
          "title": "50.2",
          "duration": "35:25",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://dirkserries.bandcamp.com/album/black-frost",
      "title": "Black Frost",
      "artist": "Chihei Hatakeyama &amp; Dirk Serries",
      "classification": "paid",
      "tags": [
        "Experimental",
        "ambient",
        "freejazz",
        "improvisation",
        "minimal",
        "Antwerp"
      ],
      "item_id": 2691212888,
      "datePublished": "30 Oct 2020 00:00:00 GMT",
      "about": "Four years after their initial collaborative debut, Chihei and Dirk return with a 2nd album that clearly solidifies their unique blend of ‘The Storm Of Silence’. An album that received worldwide praise. ‘Black Frost’ is that follow-up that expands their duo sound, made with electric guitars and various electronics,. Four new pieces embracing the Nordic theme of Glacial Movements once again : that of a secluded place equally desolate and beautiful. This is where Chihei Hatakeyama & Dirk Serries excel in.",
      "credits": "released October 30, 2020\n            \n            Music by Chihei Hatakeyama & Dirk Serries.\n\nMixed by Dirk Serries. Mastered by Chihei Hatakeyama.\n\nPhoto by Bjarne Riesto.\n\nSleeve by Oleg Galay.\n\n\n\nA Glacial Movements Records release. October 2020",
      "license": "all rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a1375005004_0",
      "trackinfo": [
        {
          "title": "Sprakk",
          "duration": "08:52",
          "lyrics": null
        },
        {
          "title": "Hvit Tåke",
          "duration": "14:04",
          "lyrics": null
        },
        {
          "title": "Breen",
          "duration": "12:10",
          "lyrics": null
        },
        {
          "title": "Frossen Luft",
          "duration": "07:59",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://dirkserries.bandcamp.com/album/live-at-br-k",
      "title": "Live At BRÅK",
      "artist": "Martina Verhoeven &amp; Colin Webster",
      "classification": "paid",
      "tags": [
        "Experimental",
        "ambient",
        "freejazz",
        "improvisation",
        "minimal",
        "Antwerp"
      ],
      "item_id": 1240052698,
      "datePublished": "23 Sep 2020 00:00:00 GMT",
      "about": null,
      "credits": "released September 23, 2020\n            \n            Martina Verhoeven - Cello\n\nColin Webster - Alto Saxophone\n\n\n\nRecorded at waterintobeer, London on 6th April 2019\n\n\n\nRecorded mixed and mastered by Dirk Serries\n\nArtwork by Colin Webster\n\n\n\nRaw Tonk Records 2020\n\nRT047",
      "license": "all rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a0488621155_0",
      "trackinfo": [
        {
          "title": "Live At BRÅK",
          "duration": "28:09",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://dirkserries.bandcamp.com/album/ii-2",
      "title": "II",
      "artist": "Continuum",
      "classification": "paid",
      "tags": [
        "Experimental",
        "ambient",
        "freejazz",
        "improvisation",
        "minimal",
        "Antwerp"
      ],
      "item_id": 1540760566,
      "datePublished": "10 Jun 2016 00:00:00 GMT",
      "about": null,
      "credits": "released June 10, 2016\n            \n            Continuum is Dirk Serries and Steven Wilson.\n\n\n\nContinuum I was originally released on Soleilmoon Recordings 2007.\n\n\n\nThe Continuum Recyclings, Volume II : All recyclings by Justin K. Broadrick. Originally released on vinyl by Tonefloat 2010.\n\n\n\nPhotography and graphic design by Carl Glover for Aleph Studios.",
      "license": "all rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a2846328036_0",
      "trackinfo": [
        {
          "title": "Construct IV",
          "duration": "22:45",
          "lyrics": null
        },
        {
          "title": "Construct V",
          "duration": "17:28",
          "lyrics": null
        },
        {
          "title": "Construct VI",
          "duration": "18:31",
          "lyrics": null
        },
        {
          "title": "I - The Continuum Recyclings Vol. 2",
          "duration": "17:54",
          "lyrics": null
        },
        {
          "title": "II - The Continuum Recyclings Vol. 2",
          "duration": "18:50",
          "lyrics": null
        },
        {
          "title": "III - The Continuum Recyclings Vol. 2",
          "duration": "21:52",
          "lyrics": null
        },
        {
          "title": "IV - The Continuum Recyclings Vol. 2",
          "duration": "15:24",
          "lyrics": null
        },
        {
          "title": "bonus track : Continuum I (Andrew Liles mix)",
          "duration": "21:48",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://dirkserries.bandcamp.com/album/live-at-de-loods-stramproy-nl",
      "title": "Live At De Loods, Stramproy (NL)",
      "artist": "Dirk Serries",
      "classification": "paid",
      "tags": [
        "Experimental",
        "ambient",
        "dark ambient",
        "drone",
        "freejazz",
        "improvisation",
        "minimal",
        "Antwerp"
      ],
      "item_id": 2412813114,
      "datePublished": "28 Sep 2020 00:00:00 GMT",
      "about": null,
      "credits": "released September 28, 2020\n            \n            Improvised and performed live in concert on September 12th, 2020, at a farmer's warehouse in Stramproy (The Netherlands). Organized by Jazzblazzt.\n\n\n\nDirk Serries : electric guitar, effects.\n\n\n\nLive sound engineer and recording by Ronald Mariën.\n\n\n\nMixed and mastered by Dirk Serries.\n\n\n\nConcert photo by Jacky Bakerman De Reviere.",
      "license": "all rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a3492780275_0",
      "trackinfo": [
        {
          "title": "Live At Stramproy 2020",
          "duration": "01:24:50",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://dirkserries.bandcamp.com/album/i",
      "title": "I",
      "artist": "Continuum",
      "classification": "paid",
      "tags": [
        "Experimental",
        "ambient",
        "freejazz",
        "improvisation",
        "minimal",
        "Antwerp"
      ],
      "item_id": 4157844799,
      "datePublished": "10 Jun 2016 00:00:00 GMT",
      "about": null,
      "credits": "released June 10, 2016\n            \n            Continuum is Dirk Serries and Steven Wilson.\n\n\n\nContinuum I was originally released on Soleilmoon Recordings 2005.\n\nT\n\nhe Continuum Recyclings, Volume I: All recyclings by vidnaOBmana based upon Bass Communion's Construct III - Immersion Mix. Originally released on vinyl by Tonefloat 2006.\n\n\n\nPhotography and graphic design by Carl Glover for Aleph Studios.",
      "license": "all rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a2065937957_0",
      "trackinfo": [
        {
          "title": "Construct I",
          "duration": "19:54",
          "lyrics": null
        },
        {
          "title": "Construct II",
          "duration": "21:30",
          "lyrics": null
        },
        {
          "title": "Construct III",
          "duration": "19:45",
          "lyrics": null
        },
        {
          "title": "I - The Continuum Recyclings Vol. 1",
          "duration": "19:35",
          "lyrics": null
        },
        {
          "title": "II - The Continuum Recyclings Vol. 1",
          "duration": "19:47",
          "lyrics": null
        },
        {
          "title": "III - The Continuum Recyclings Vol. 1",
          "duration": "19:41",
          "lyrics": null
        },
        {
          "title": "IV - The Continuum Recyclings Vol. 1",
          "duration": "19:48",
          "lyrics": null
        },
        {
          "title": "bonus track : Construct III (Bass Communion Immersion mix)",
          "duration": "01:00:00",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://dirkserries.bandcamp.com/album/endless-void",
      "title": "Endless Void",
      "artist": "Dead Neanderthals",
      "classification": "paid",
      "tags": [
        "Experimental",
        "ambient",
        "freejazz",
        "improvisation",
        "minimal",
        "Antwerp"
      ],
      "item_id": 47913570,
      "datePublished": "06 Jun 2015 00:00:00 GMT",
      "about": null,
      "credits": "released June 6, 2015\n            \n            Recorded live at Incubate, Theaters Tilburg by Marlon Wolterink, 21 September 2014\n\n\n\nMixed and mastered by Marlon Wolterink and Dead Neanderthals at White Noise Studio\n\n\n\nArtwork by Rutger Zuydervelt\n\n\n\nRené Aquarius - drums, percussion\n\nOtto Kokke - saxophone\n\nThomas Ekelund - voice, electronics\n\nPeter Johan Nÿland - string percussion\n\nDirk Serries - guitar\n\nSteven Vinkenoog - guitar\n\nColin Webster - saxophone, clarinet\n\nRutger Zuydervelt - electronics\n\n\n\nThanks to Vincent Koreman, Miguel Navarro, Frans de Waard, Prins Bernhard Cultuurfonds\n\n\n\nAR-056LP & AR-056CD\n\nc&p Dead Neanderthals / Alone Records",
      "license": "all rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a3699537392_0",
      "trackinfo": [
        {
          "title": "Endless Void",
          "duration": "01:21:42",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://dirkserries.bandcamp.com/album/distant-curving-horizon-the-primal-broken-passage-beneath-the-scorching-sun",
      "title": "Distant Curving Horizon. The Primal Broken Passage. Beneath The Scorching Sun",
      "artist": "Havnes / Järmyr / Serries",
      "classification": "paid",
      "tags": [
        "Experimental",
        "ambient",
        "freejazz",
        "improvisation",
        "minimal",
        "Antwerp"
      ],
      "item_id": 2296425208,
      "datePublished": "23 Mar 2018 00:00:00 GMT",
      "about": null,
      "credits": "released March 23, 2018\n            \n            Drums – Tomas Järmyr\n\nGuitars – Dirk Serries, Eirik Havnes\n\n\n\nPerformed and recorded at Olavshallen, Trondheim (Norway) on May 16th 2015. Mixed and mastered by Dirk Serries.\n\n\n\nArtwork – Katharina Woltering \n\nPhotography By – Sylwia Bartyzel\n\n\n\nReleased on Midira Records, 2018.",
      "license": "all rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a1876115429_0",
      "trackinfo": [
        {
          "title": "Distant Curving Horizon. The Primal Broken Passage. Beneath The Scorching Sun",
          "duration": "54:43",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://dirkserries.bandcamp.com/album/the-origin-reversal",
      "title": "The Origin Reversal",
      "artist": "Dirk Serries",
      "classification": "paid",
      "tags": [
        "Experimental",
        "ambient",
        "freejazz",
        "improvisation",
        "minimal",
        "Antwerp"
      ],
      "item_id": 4105486598,
      "datePublished": "19 Sep 2014 00:00:00 GMT",
      "about": null,
      "credits": "released September 19, 2014\n            \n            All improvisations : streams of consciousness 142406-142007.\n\n\n\nDirk Serries : electric guitar, effects.\n\n\n\nPhotography by Martina Verhoeven.\n\n\n\nOriginally released on Projekt Records, 2014.",
      "license": "all rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a0188279429_0",
      "trackinfo": [
        {
          "title": "Radiant Down",
          "duration": "10:53",
          "lyrics": null
        },
        {
          "title": "Remission",
          "duration": "15:55",
          "lyrics": null
        },
        {
          "title": "The Dead Air Reprise",
          "duration": "11:44",
          "lyrics": null
        },
        {
          "title": "Notion Of The Invert",
          "duration": "12:36",
          "lyrics": null
        },
        {
          "title": "Transfuse The Phantom",
          "duration": "21:19",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://dirkserries.bandcamp.com/album/mn",
      "title": "MN",
      "artist": "Scatterwound",
      "classification": "paid",
      "tags": [
        "Experimental",
        "ambient",
        "freejazz",
        "improvisation",
        "minimal",
        "Antwerp"
      ],
      "item_id": 25412475,
      "datePublished": "15 Mar 2019 00:00:00 GMT",
      "about": null,
      "credits": "released March 15, 2019\n            \n            Recorded at Christuskirche Bochum during Moving Noises Festival 2017 on February 4th, 2017 by Christoph Scheidel.\n\nMixed and mastered by Fear Falls Burning.\n\n\n\nSCATTERWOUND :\n\n\n\nDirk Serries : electric guitar, effects, amps\n\nHellmut Neidhardt : electric guitar, effects, amps\n\n\n\nCD released on Midira Records.",
      "license": "all rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a1465737659_0",
      "trackinfo": [
        {
          "title": "SCMN",
          "duration": "37:57",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://dirkserries.bandcamp.com/album/epitaph-home-concert-stream",
      "title": "Epitaph : Home Concert Stream",
      "artist": "Dirk Serries",
      "classification": "paid",
      "tags": [
        "Experimental",
        "ambient",
        "freejazz",
        "improvisation",
        "minimal",
        "Antwerp"
      ],
      "item_id": 3414007352,
      "datePublished": "26 Apr 2020 00:00:00 GMT",
      "about": null,
      "credits": "released April 26, 2020\n            \n            Two hour live concert performed at home on April 5th 2020, during the first week of COVID19 lockdown in Belgium.\n\n\n\nDirk Serries : electric guitar, effects.\n\n\n\nRemastered April 2020.\n\n\n\nPhotography by Martina Verhoeven.",
      "license": "all rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a1197969211_0",
      "trackinfo": [
        {
          "title": "Part One",
          "duration": "46:45",
          "lyrics": null
        },
        {
          "title": "Part Two",
          "duration": "01:09:53",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://dirkserries.bandcamp.com/album/disorientation-flow",
      "title": "Disorientation Flow",
      "artist": "Dirk Serries",
      "classification": "paid",
      "tags": [
        "Experimental",
        "ambient",
        "freejazz",
        "improvisation",
        "minimal",
        "Antwerp"
      ],
      "item_id": 3625896682,
      "datePublished": "12 May 2015 00:00:00 GMT",
      "about": null,
      "credits": "released May 12, 2015\n            \n            All improvisations: streams of consciousness 140811 - 150802\n\n\n\nDirk Serries : electric guitar, effects\n\n\n\nPhotography by Martina Verhoeven.\n\n\n\nOriginally released on Projekt, 2015.",
      "license": "all rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a1443321437_0",
      "trackinfo": [
        {
          "title": "The Imperative Edge",
          "duration": "13:40",
          "lyrics": null
        },
        {
          "title": "Metamorphosis",
          "duration": "12:52",
          "lyrics": null
        },
        {
          "title": "Disorientation Flow",
          "duration": "15:47",
          "lyrics": null
        },
        {
          "title": "Blistering",
          "duration": "09:02",
          "lyrics": null
        },
        {
          "title": "The Lament Broke",
          "duration": "13:30",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://dirkserries.bandcamp.com/album/hell",
      "title": "Hell",
      "artist": "Thisquietarmy + Dirk Serries + Tom Malmendier",
      "classification": "paid",
      "tags": [
        "Experimental",
        "ambient",
        "freejazz",
        "improvisation",
        "minimal",
        "Antwerp"
      ],
      "item_id": 1420896903,
      "datePublished": "15 Mar 2019 00:00:00 GMT",
      "about": null,
      "credits": "released March 15, 2019\n            \n            Guitar : Thisquietarmy\n\nGuitar : Dirk Serries\n\nDrums : Tom Malmendier\n\n\n\nPerformed live at Christuskirche Bochum (Germany) on October 21st, 2017. Recorded by Christoph Scheidel.\n\nMixed by Dirk Serries.\n\nMastered by Eric Quach.\n\n\n\nPhotography By – Cosima Clemmensen\n\n \n\nReleased on Midira Records",
      "license": "all rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a0919720201_0",
      "trackinfo": [
        {
          "title": "Hell",
          "duration": "41:09",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://dirkserries.bandcamp.com/album/gratitude",
      "title": "Gratitude",
      "artist": "Martina Verhoeven",
      "classification": "paid",
      "tags": [
        "Experimental",
        "ambient",
        "freejazz",
        "improvisation",
        "minimal",
        "Antwerp"
      ],
      "item_id": 2017026937,
      "datePublished": "24 Apr 2020 00:00:00 GMT",
      "about": null,
      "credits": "released April 24, 2020\n            \n            Martina Verhoeven : piano\n\n\n\nComposed, performed & arranged by Martina Verhoeven.\n\nRecorded & mixed at the Sunny Side Inc. studio, Anderlecht (Belgium) on march 17th 2018 \n\nMastered by Dirk Serries\n\n\n\ngratitude : Nicolas Lefèvre and especially to my husband Dirk Serries\n\n\n\nGratitude Live At De Singer (Rijkevorsel, Belgium) on October 30th, 2018\n\nRecorded by Kris Roevens. Mixed and mastered by Dirk Serries.",
      "license": "all rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a1704336355_0",
      "trackinfo": [
        {
          "title": "Gratitude",
          "duration": "33:18",
          "lyrics": null
        },
        {
          "title": "(BONUS TRACK) Gratitude - Live At De Singer October 30th, 2018",
          "duration": "27:45",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://dirkserries.bandcamp.com/album/origin",
      "title": "Origin",
      "artist": "Dirk Serries",
      "classification": "paid",
      "tags": [
        "Experimental",
        "ambient",
        "freejazz",
        "improvisation",
        "minimal",
        "Antwerp"
      ],
      "item_id": 1082482528,
      "datePublished": "02 Nov 2019 16:17:24 GMT",
      "about": "Originally released on Ambient Nation 5, 3xCD compilation, Art For Ears 2019",
      "credits": "released November 2, 2019\n            \n            Recorded & performed in 2014, re-arranged in 2018.\n\n\n\nDirk Serries : electric guitars, electronics, effects.",
      "license": "all rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a3812109534_0",
      "trackinfo": [
        {
          "title": "Origin",
          "duration": "07:38",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://dirkserries.bandcamp.com/album/frontier",
      "title": "Frontier",
      "artist": "Dirk Serries",
      "classification": "paid",
      "tags": [
        "Experimental",
        "ambient",
        "freejazz",
        "improvisation",
        "minimal",
        "Antwerp"
      ],
      "item_id": 201237978,
      "datePublished": "06 Jan 2020 20:36:25 GMT",
      "about": "Unreleased longform piece recorded in 2014. Completed and mastered in January 2020.",
      "credits": "released January 6, 2020\n            \n            Dirk Serries : electric guitar, effects.\n\n\n\nPhotography by Martina Verhoeven.",
      "license": "all rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a0563911699_0",
      "trackinfo": [
        {
          "title": "Frontier",
          "duration": "59:32",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://dirkserries.bandcamp.com/album/live-in-leeds",
      "title": "Live In Leeds",
      "artist": "Kodian Trio",
      "classification": "paid",
      "tags": [
        "Experimental",
        "ambient",
        "freejazz",
        "improvisation",
        "minimal",
        "Antwerp"
      ],
      "item_id": 1333834973,
      "datePublished": "29 Feb 2020 00:00:00 GMT",
      "about": null,
      "credits": "released February 29, 2020\n            \n            Andrew Lisle - drums\n\nDirk Serries - electric guitar\n\nColin Webster - alto saxophone\n\n\n\nRecorded at LS6 Cafe, Leeds on 30th March 2019\n\n\n\nRecorded and mixed by Chris Sharkey\n\nMastered by Dirk Serries\n\n\n\nArtwork by Colin Webster\n\n\n\nRaw Tonk Records 2020\n\nRT045",
      "license": "all rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a3609272128_0",
      "trackinfo": [
        {
          "title": "Live In Leeds",
          "duration": "28:27",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://dirkserries.bandcamp.com/album/epitaph",
      "title": "Epitaph",
      "artist": "Dirk Serries",
      "classification": "paid",
      "tags": [
        "Experimental",
        "ambient",
        "freejazz",
        "improvisation",
        "minimal",
        "Antwerp"
      ],
      "item_id": 2867577270,
      "datePublished": "18 Apr 2018 00:00:00 GMT",
      "about": null,
      "credits": "released April 18, 2018\n            \n            Dirk Serries : electric guitars, analog and digital effects.\n\nAll improvisations : streams of consciousness 161506 - 170410\n\nMixed and mastered by Dirk Serries.\n\n\n\nPhotography by Martina Verhoeven\n\nLayout by Le 7e Oeil.\n\n\n\nOriginally released on both vinyl and cd by Consouling Sounds, 2018.",
      "license": "all rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a2885664107_0",
      "trackinfo": [
        {
          "title": "Spectral Gray Walls",
          "duration": "08:50",
          "lyrics": null
        },
        {
          "title": "Shining Form Constellation",
          "duration": "07:35",
          "lyrics": null
        },
        {
          "title": "Alternation And Return",
          "duration": "08:27",
          "lyrics": null
        },
        {
          "title": "Eaves In Dusk",
          "duration": "06:55",
          "lyrics": null
        },
        {
          "title": "The Profusion Of Daze",
          "duration": "08:48",
          "lyrics": null
        },
        {
          "title": "Torrential Aether Shadows",
          "duration": "09:05",
          "lyrics": null
        },
        {
          "title": "Formations Of Grace",
          "duration": "12:33",
          "lyrics": null
        },
        {
          "title": "The Nebulous Chords",
          "duration": "08:30",
          "lyrics": null
        },
        {
          "title": "Brittle Air Elegy",
          "duration": "12:31",
          "lyrics": null
        },
        {
          "title": "And All The Murmur Fell",
          "duration": "07:45",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://dirkserries.bandcamp.com/album/epitaph-companion",
      "title": "Epitaph Companion",
      "artist": "Dirk Serries",
      "classification": "paid",
      "tags": [
        "Experimental",
        "ambient",
        "freejazz",
        "improvisation",
        "minimal",
        "Antwerp"
      ],
      "item_id": 3751165875,
      "datePublished": "26 Dec 2019 00:00:00 GMT",
      "about": "This album features music, recorded in preparation for scoring the EPITAPH album on Consouling Sounds.\n\nThe music was performed real-time at the Sunny Side Inc. studio in Anderlecht (Belgium) August 2017.\n\n\n\nDirk Serries : electric guitar, effects, amplifiers\n\n\n\nPhotography by Martina Verhoeven.",
      "credits": "released December 26, 2019\n            \n            Sunny Side Inc. studio notes :\n\n\n\nThe choice of microphones, placement and routing through preamplifiers and outboard gear for this solo guitar session was almost\n\nentirely made in advance and imagined, based on previous solo recordings and having worked regularly together over the last few\n\nyears.\n\nShared experience in music and recording brings consciousness of space, and with mutual respect leaves more room for\n\nessentialism : to reach for what matters.\n\nWith time and experience, a good collaboration can evolve up to the point where the recorded artist is fully at home in the studio,\n\ntrusting of the sound in the room, the recorded sound and the process in general.\n\nThis allows him or her to be able to completely remove any obstacle or potentially disruptive factor in the process of truly expressing\n\noneself : no fear : of a new setup, different environment and acoustics, all kinds of unfamiliarities that can eat away at the artist’s\n\nexpression, effectively diminishing the potential great result of a recording session or worse leave the artist frustrated with the\n\nrecording experience. It also dilutes inhibition or doubt towards exposing one’s inner voice under many a sonic microscope and\n\nexternal ears.\n\nFrom the studio engineer’s perspective, a regular and positive collaboration shows him or her what sound is desired, unwanted,\n\nworks or doesn’t, what textures the artist is after, the image of the sound, the general feel and esthetic. Over time it helps making\n\ndecisions and commit to a sound that will be closer to an end-result even before the recording, as the mere thought of an upcoming\n\nsession combined with the previous experiences will allow the engineer to confidently prepare a setup mentally, based on sonic\n\nmemory, that might achieve the shortest path between studio performance and a finished record.\n\nWith this recording, that is exactly what happened : a blossoming over time into a harmonious experience, where the finalization of a\n\nrecord-making happens at the recording, capturing the performance with all the right and necessary information, no more no less.\n\nTo rejoin the improvised performance in its naturalism, organicity and purity, unadulterated by postprocessing, a true communion\n\nbetween music and equipment, space and time, sparked by an evolved syntonicity of minds.\n\n\n\nThe technical bits :\n\n\n\nTwo amps were used (Fender Twin reissue and Marshall MG100-hdfx) : the Fender left side for subs and robust low mids, the\n\nMarshall right, on the clean channel, for a clean forward sound and the treble.\n\n\n\nMicrophones : 3 setups\n\nFor the close microphones (only part decided on the day itself) : an AEA R84 for the Fender slightly off-center from the cone, about 4\n\ninches away, and angled as to protect the ribbon from low frequency air bursts, was chosen to further emphasise the low end and\n\nsubs thanks to the proximity effect of the figure of eight microphone pattern. The R84 proved itself in this scenario, capturing a lush\n\nsound in the nether regions of the spectrum.\n\nFor the Marshall, a trusted cream-colored vintage Sennheiser MD421 was chosen for its high-mid/high detail and sparkle, without\n\never getting too aggressive; placed here at 2 inches from one of the 10 inch speakers, slightly off-center as well for more intrigue.\n\nTo capture the ambience of the sound - pretty much in-between the direct sound and the reverberated one from the room, early\n\nreflections territory where much life resides - and a good natural stereo image from the room, we chose a pair of Line Audio CM-3\n\ncardioid small-diaphragm-condenser microphones for their linear, open sound, which constitutes the first layer of depth.\n\nPlaced at a distance of 90cm, in ORTF setup, in the middle of the two amps, at 1 meter height.\n\nThe left side slightly closer to the Fender, to make up for the difference of loudness perception between bass and highs.\n\nThe space, width and third layer of depth, possibly the most influential in the sound, was captured with a pair of custom ribbon\n\nmicrophones with Lundahl transformers, Nohype Audio LRM-2, in blumlein configuration, at a height of 140 cm and 3 meters away\n\nfrom the amps.\n\n\n\nPreamplifiers and outboard :\n\nThanks to our ULN-8 converters which have a very clean dynamic range, with little to no noise, we were able to go for an almost\n\nuncompressed sound on the way in the recording, capturing the full range confidently from the breaking point of silence - above the\n\nguitar amplifiers self noise that is - up to the soaring loud heights as is.\n\n\n\nFor the close microphones :\n\nAEA R84 : we went for a deep color and vibe with Universal Audio LA-610 tube preamp, and took advantage of the internal tube\n\nequalizer by adding a subtle but present 1.5 dB boost at 70Hz for ample bottom. In case the subs and lowmids would swell too much,\n\na hint of optical compressor was used on the way in, with about maximum 2dB of gain reduction on the loudest parts.\n\nSennheiser MD421 : here we chose a more upfront sound with Telefunken v676a preamp, the built-in highpass filter cannot be\n\nswitched off which is desired here, and is at 40 Hz to make sure no rumble or subs will reach the recording as the Fender + AEA are\n\ntaking care of that. To open up the higher frequencies and air, a Siemens equalizer added a sweet shelf 3dB boost at 15KHz.\n\nFor the ambience stereo setup : we chose to go neutral and capture a pristine stereo air with Metric Halo ULN-8’s built-in microphone\n\npreamplifiers, providing ample clean volume for the gain-hungry CM-3’s.\n\nFor the blumlein room stereo setup we choose to add a layer of thickness and heart with Mercury M72s stereo preamplifier, an\n\nincredible tone box based on Telefunken V72 design. It has a slight roll-off up high, so to compensate this the Mercury went straight\n\ninto a Chandler Ltd. Curve Bender Mastering equalizer, with a 2dB shelf boost at 16KHz and 1dB wide bell boost at 8KHz.\n\n30Hz lowcut was engaged in case of insanely low room rumble.\n\nWith proper gainstaging at the soundcheck, we recorded the session at 48KHz. Once the sound was recorded and upon listening,\n\nthe levels were spot-on in the DAW, so not a iota of gain was changed after recording and the only digital processing in the session,\n\ncalibrated before the recording, are a safety saturator/compressor on each of the 3 pairs of microphones, provided by Empirical Labs\n\nArousor’s incredibly musical tone, keeping rogue peaks in check and at highest loudness tickling the compressor circuits by\n\nmaximum 1-2 dB.\n\nAn experience where the technology acted for the music by accompanying the sound or staying out of the way of the music wherever\n\nneeded; all in one long natural breath, unadulterated by any action or interaction while unfolding.\n\nA feature we hope you will experience by listening to this mesmerizing session.\n\n\n\nNico\n\nSunny Side Inc",
      "license": "all rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a3089337314_0",
      "trackinfo": [
        {
          "title": "Pitch Circle",
          "duration": "12:26",
          "lyrics": null
        },
        {
          "title": "Magnetosphere",
          "duration": "08:59",
          "lyrics": null
        },
        {
          "title": "Ephemeris",
          "duration": "11:20",
          "lyrics": null
        },
        {
          "title": "Air Drag",
          "duration": "11:33",
          "lyrics": null
        },
        {
          "title": "Lateral",
          "duration": "15:54",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://dirkserries.bandcamp.com/album/deformation-haze",
      "title": "Deformation Haze",
      "artist": "Dirk Serries",
      "classification": "paid",
      "tags": [
        "Experimental",
        "ambient",
        "freejazz",
        "improvisation",
        "minimal",
        "Antwerp"
      ],
      "item_id": 2549718782,
      "datePublished": "02 Nov 2019 16:11:12 GMT",
      "about": "Originally released on compilation cassette 'Music For A Few People, Vol. 2', Non-Interrupt Tapes 2019",
      "credits": "released November 2, 2019\n            \n            Recorded live at the Sunny Side Inc. studio (Anderlecht, Belgium), 2017. Assembled 2019.\n\n\n\nDirk Serries : electric guitar, pedal effects and amplifiers.",
      "license": "all rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a4008770619_0",
      "trackinfo": [
        {
          "title": "Deformation Haze",
          "duration": "14:14",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://dirkserries.bandcamp.com/album/horizon-short-film-soundtrack",
      "title": "Horizon - Short Film Soundtrack",
      "artist": "Dirk Serries",
      "classification": "nyp",
      "tags": [
        "Experimental",
        "ambient",
        "freejazz",
        "improvisation",
        "minimal",
        "Antwerp"
      ],
      "item_id": 2764375653,
      "datePublished": "29 Mar 2020 00:00:00 GMT",
      "about": null,
      "credits": "released March 29, 2020\n            \n            HORIZON\n\nA short film by Katharina Conradi & Sergio Gridelli\n\n\n\n1. De Stad\n\n2. Aankomst\n\n3. WTC + Tunnel Scene\n\n4. Toronto Brug + Tramrails\n\n5. Alert + Kalverstraat + Korte Acties + Steeg Scene\n\n6. Muurgevecht + Droom Scene\n\n7. Het Einde \n\n\n\nSoundtrack composed, performed & recorded by Dirk Serries in 2012/2013.\n\nAll city sounds by Sergio Gridelli.\n\n\n\n\n\nChoreography : Katharina Conradi\n\nCamera, editing: Sergio Gridelli\n\nDance : Marieke Dermul\n\n\n\n\n\nSupport by Amsterdams Fonds voor de Kunst, Provincie West-Vlaanderen\n\n\n\nScreenings : Kinepolis Brugge en Kortrijk 2013 | Shakalaka Brugge 2014 | Cinedans 2014 Amsterdam | World Urban Forum 2014 Medelin | Metro Movies Festival Amsterdam 2014 | Broadcasted on AT5 (regional TV station) | 24 uur Cultuur 2014 Rotterdam | InShadow Festival 2014 Lissabon | BIEFF Festival 2014 Boekarest | Athens Video Dance Project 2015 Athene. \n\n\n\nwww.sergiogridelli.nl",
      "license": "all rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a1729852638_0",
      "trackinfo": [
        {
          "title": "Horizon",
          "duration": "28:00",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://dirkserries.bandcamp.com/album/iii",
      "title": "III",
      "artist": "Kodian Trio",
      "classification": "paid",
      "tags": [
        "Experimental",
        "ambient",
        "freejazz",
        "improvisation",
        "minimal",
        "Antwerp"
      ],
      "item_id": 328001338,
      "datePublished": "27 Sep 2019 00:00:00 GMT",
      "about": null,
      "credits": "released September 27, 2019\n            \n            Dirk Serries - electric guitar\n\nColin Webster - saxophone\n\nAndrew Lisle - drums\n\n\n\nArtwork by Lasse Marhaug\n\nMixed and mastered by Marlon Wolterink at White Noise Studio, Winterswijk, NL\n\nPublished by Cien Fuegos\n\n\n\nTrost Records 2019\n\nTR188",
      "license": "all rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a2262255652_0",
      "trackinfo": [
        {
          "title": "I",
          "duration": "08:38",
          "lyrics": null
        },
        {
          "title": "II",
          "duration": "09:04",
          "lyrics": null
        },
        {
          "title": "III",
          "duration": "14:55",
          "lyrics": null
        },
        {
          "title": "IV",
          "duration": "08:10",
          "lyrics": null
        },
        {
          "title": "V",
          "duration": "08:11",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://dirkserries.bandcamp.com/album/smothered-hope-infinite-daze",
      "title": "Smothered Hope.Infinite Daze",
      "artist": "Dirk Serries",
      "classification": "paid",
      "tags": [
        "Experimental",
        "ambient",
        "freejazz",
        "improvisation",
        "minimal",
        "Antwerp"
      ],
      "item_id": 3400973931,
      "datePublished": "29 Mar 2020 15:14:05 GMT",
      "about": null,
      "credits": "released March 29, 2020\n            \n            1. Part One\t20:19\n\n2. Part Two\t16:44\n\n\n\nalbum originally scored for SUBSTRATA (Mexico) but never released.\n\n\n\ninstruments : electric guitar, analog and digital effects. recorded june 2016, mixed and mastered by dirk serries.\n\n\n\n3. Smothered Hope. Infinite Daze\n\n\n\nreworked shorter version for SUBSTRATA's benefit compilation to the victims of the September 17th & 19th 2017 earthquakes in Mexico. \n\nsubstratamx.bandcamp.com/album/waves-of-redemption-contemporary-sounds-in-solidarity-with-mexico\n\n\n\n photography by martina verhoeven.",
      "license": "all rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a2869293556_0",
      "trackinfo": [
        {
          "title": "Part One",
          "duration": "20:19",
          "lyrics": null
        },
        {
          "title": "Part Two",
          "duration": "16:44",
          "lyrics": null
        },
        {
          "title": "Smothered Hope.Infinite Daze",
          "duration": "11:58",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://dirkserries.bandcamp.com/album/outermission",
      "title": "Outermission",
      "artist": "George Hadow &amp; Dirk Serries",
      "classification": "paid",
      "tags": [
        "Experimental",
        "ambient",
        "freejazz",
        "improvisation",
        "minimal",
        "Antwerp"
      ],
      "item_id": 364085180,
      "datePublished": "07 Jul 2017 00:00:00 GMT",
      "about": "George Hadow - drums\n\nDirk Serries - electric guitar\n\n\n\nPerformed, recorded and mixed at Sunny Side Inc. Studio, Anderlecht, Belgium on February 20th 2016. Mastered by Dirk Serries.\n\n\n\nArtwork by Colin Webster\n\n\n\nRaw Tonk Records 2017\n\nRT026",
      "credits": "released July 7, 2017",
      "license": "all rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a4214658893_0",
      "trackinfo": [
        {
          "title": "Narrow",
          "duration": "03:00",
          "lyrics": null
        },
        {
          "title": "Cross",
          "duration": "03:36",
          "lyrics": null
        },
        {
          "title": "Out",
          "duration": "05:00",
          "lyrics": null
        },
        {
          "title": "Call",
          "duration": "02:58",
          "lyrics": null
        },
        {
          "title": "Apart",
          "duration": "02:45",
          "lyrics": null
        },
        {
          "title": "Leeg",
          "duration": "01:29",
          "lyrics": null
        },
        {
          "title": "Slate",
          "duration": "02:52",
          "lyrics": null
        },
        {
          "title": "Open",
          "duration": "03:59",
          "lyrics": null
        },
        {
          "title": "Night",
          "duration": "03:09",
          "lyrics": null
        },
        {
          "title": "Tear",
          "duration": "04:28",
          "lyrics": null
        },
        {
          "title": "Remission",
          "duration": "04:17",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://dirkserries.bandcamp.com/album/live-at-paradox",
      "title": "Live At Paradox",
      "artist": "Kodian Trio",
      "classification": "paid",
      "tags": [
        "Experimental",
        "ambient",
        "freejazz",
        "improvisation",
        "minimal",
        "Antwerp"
      ],
      "item_id": 3842438799,
      "datePublished": "04 Feb 2019 12:09:43 GMT",
      "about": "KODIAN TRIO :\n\n\n\nAndrew Lisle - drums\n\nDirk Serries - guitar\n\nColin Webster - alto saxophone\n\n\n\nRecorded live at Paradox, Tilburg. 14th May 2016\n\nRecorded, mixed and mastered by Dirk Serries\n\n\n\nThanks to Incubate Festival\n\n\n\nRaw Tonk Records 2016\n\nRT019",
      "credits": "released February 4, 2019",
      "license": "all rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a0594343259_0",
      "trackinfo": [
        {
          "title": "Live At Paradox, Incubate Festival",
          "duration": "36:43",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://dirkserries.bandcamp.com/album/ideal-principle",
      "title": "Ideal Principle",
      "artist": "John Dikeman / George Hadow / Dirk Serries / Martina Verhoeven / Luis Vicente",
      "classification": "paid",
      "tags": [
        "Experimental",
        "ambient",
        "freejazz",
        "improvisation",
        "minimal",
        "Antwerp"
      ],
      "item_id": 1007466437,
      "datePublished": "13 Aug 2018 00:00:00 GMT",
      "about": "John Dikeman: tenor & alto saxophone\n\nGeorge Hadow: drums\n\nDirk Serries: electric guitar\n\nMartina Verhoeven: double bass\n\nLuis Vicente: trumpet\n\n\n\nPerformed, recorded and mixed at Sunny Side Inc. Studio, Anderlecht (Belgium) on February 20th 2016.\n\nMastered by Dirk Serries.\n\n\n\nArtwork by Colin Webster\n\n\n\nRaw Tonk Records 2018\n\nRT035",
      "credits": "released August 13, 2018",
      "license": "all rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a1549511765_0",
      "trackinfo": [
        {
          "title": "Ideal",
          "duration": "15:50",
          "lyrics": null
        },
        {
          "title": "Infinite",
          "duration": "02:41",
          "lyrics": null
        },
        {
          "title": "Motion",
          "duration": "15:59",
          "lyrics": null
        },
        {
          "title": "Principle",
          "duration": "08:01",
          "lyrics": null
        },
        {
          "title": "Substance",
          "duration": "05:50",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://dirkserries.bandcamp.com/album/live-at-cafe-oto-2",
      "title": "Live At Cafe Oto",
      "artist": "DIKEMAN / LISLE / SERRIES / WEBSTER",
      "classification": "paid",
      "tags": [
        "Experimental",
        "ambient",
        "freejazz",
        "improvisation",
        "minimal",
        "Antwerp"
      ],
      "item_id": 708795908,
      "datePublished": "19 Oct 2015 00:00:00 GMT",
      "about": "John Dikeman - Tenor Saxophone\n\nDirk Serries - Guitar\n\nAndrew Lisle - Drums\n\nColin Webster - Baritone Saxophone\n\n\n\nRecorded live at Cafe Oto, London. April 1st 2015\n\nRecorded by Tom Mudd\n\nMixed and mastered by Dirk Serries\n\n\n\nRaw Tonk Records 2015\n\nRT013",
      "credits": "released October 19, 2015",
      "license": "all rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a3047656085_0",
      "trackinfo": [
        {
          "title": "Live At Cafe Oto",
          "duration": "32:28",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://dirkserries.bandcamp.com/album/surface-chord-extraction",
      "title": "Surface Chord Extraction",
      "artist": "Dirk Serries",
      "classification": "paid",
      "tags": [
        "Experimental",
        "ambient",
        "freejazz",
        "improvisation",
        "minimal",
        "Antwerp"
      ],
      "item_id": 1537921506,
      "datePublished": "24 Feb 2019 00:00:00 GMT",
      "about": null,
      "credits": "released February 24, 2019\n            \n            Dirk Serries : electric guitars, amps, effects.\n\nRecorded and mixed in 2018.\n\n\n\nOriginally released on the split tape Faux Amis Vol. 2 with Lärmschutz, Faux Amis 2019.",
      "license": "all rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a0459592580_0",
      "trackinfo": [
        {
          "title": "Surface Chord Extraction",
          "duration": "20:24",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://dirkserries.bandcamp.com/album/live-in-the-lowlands",
      "title": "Live In The Lowlands",
      "artist": "Graham Dunning &amp; Dirk Serries",
      "classification": "paid",
      "tags": [
        "Experimental",
        "ambient",
        "freejazz",
        "improvisation",
        "minimal",
        "Antwerp"
      ],
      "item_id": 330791928,
      "datePublished": "17 Oct 2017 00:00:00 GMT",
      "about": "Graham Dunning – turntable, dubplates, spring reverbs, objects\n\nDirk Serries – guitar\n\n\n\nLive at De Singer recorded at De Singer, Rijkevorsel, Belgium on 18th March 2017\n\nRecorded by Kris Roevens\n\n\n\nLive at De Ruimte recorded at De Ruimte, Amsterdam, Netherlands on 19th March 2017\n\nRecorded by Dirk Serries\n\n\n\nMixed by Dirk Serries\n\nMastered by Fear Falls Burning\n\n\n\nArtwork by Colin Webster\n\n\n\nRaw Tonk Records 2017\n\nRT028",
      "credits": "released October 17, 2017",
      "license": "all rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a2889600570_0",
      "trackinfo": [
        {
          "title": "Live At De Singer",
          "duration": "20:16",
          "lyrics": null
        },
        {
          "title": "Live At De Ruimte",
          "duration": "28:48",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://dirkserries.bandcamp.com/album/gargoyles",
      "title": "Gargoyles",
      "artist": "Colin Webster &amp; Dirk Serries",
      "classification": "paid",
      "tags": [
        "Experimental",
        "ambient",
        "freejazz",
        "improvisation",
        "minimal",
        "Antwerp"
      ],
      "item_id": 4028482326,
      "datePublished": "06 Apr 2018 00:00:00 GMT",
      "about": "Colin Webster - alto and baritone saxophones\n\nDirk Serries - guitar\n\n\n\nRecorded at Soundsavers, London on 11th June 2017 by Mark Jasper\n\nMixed and mastered by Dirk Serries\n\n\n\nArtwork by Colin Webster\n\n\n\nRaw Tonk Records 2018\n\nRT032",
      "credits": "released April 6, 2018",
      "license": "all rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a1143621677_0",
      "trackinfo": [
        {
          "title": "Gargoyles",
          "duration": "01:27",
          "lyrics": null
        },
        {
          "title": "Soil",
          "duration": "01:33",
          "lyrics": null
        },
        {
          "title": "Pilasters",
          "duration": "02:08",
          "lyrics": null
        },
        {
          "title": "Dome",
          "duration": "01:44",
          "lyrics": null
        },
        {
          "title": "Gullet",
          "duration": "01:17",
          "lyrics": null
        },
        {
          "title": "Crypt",
          "duration": "00:58",
          "lyrics": null
        },
        {
          "title": "Goji",
          "duration": "01:25",
          "lyrics": null
        },
        {
          "title": "Chimera",
          "duration": "01:03",
          "lyrics": null
        },
        {
          "title": "Spout",
          "duration": "01:59",
          "lyrics": null
        },
        {
          "title": "Spout",
          "duration": "01:59",
          "lyrics": null
        },
        {
          "title": "Cone",
          "duration": "02:18",
          "lyrics": null
        },
        {
          "title": "Organ",
          "duration": "01:13",
          "lyrics": null
        },
        {
          "title": "Grotesque",
          "duration": "01:54",
          "lyrics": null
        },
        {
          "title": "Cross",
          "duration": "01:31",
          "lyrics": null
        },
        {
          "title": "Throne",
          "duration": "01:19",
          "lyrics": null
        },
        {
          "title": "Cupola",
          "duration": "02:01",
          "lyrics": null
        },
        {
          "title": "Boss",
          "duration": "01:07",
          "lyrics": null
        },
        {
          "title": "Form",
          "duration": "01:19",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://dirkserries.bandcamp.com/album/volt-pletterij",
      "title": "Volt / Pletterij",
      "artist": "Kodian Trio",
      "classification": "paid",
      "tags": [
        "Experimental",
        "ambient",
        "freejazz",
        "improvisation",
        "minimal",
        "Antwerp"
      ],
      "item_id": 1554167126,
      "datePublished": "09 Jun 2017 00:00:00 GMT",
      "about": "KODIAN TRIO :\n\n\n\nColin Webster - Saxophone\n\nDirk Serries - Guitar\n\nAndrew Lisle - Drums\n\n\n\nSide A: Recorded at Volt, Sittard on March 21st 2016 by Bert Van Der Naald\n\n\n\nSide B: Recorded at Pletterij, Haarlem on March 19th 2016 by Rob Brakel\n\n\n\nMixing & mastering by Dirk Serries\n\n\n\nArtwork and layout by Colin Webster\n\n\n\nRaw Tonk Records 2017\n\nRT025",
      "credits": "released June 9, 2017",
      "license": "all rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a3881998167_0",
      "trackinfo": [
        {
          "title": "Live At Volt",
          "duration": "38:27",
          "lyrics": null
        },
        {
          "title": "Live At Pletterij",
          "duration": "27:04",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://dirkserries.bandcamp.com/album/ii",
      "title": "II",
      "artist": "Kodian Trio",
      "classification": "paid",
      "tags": [
        "Experimental",
        "ambient",
        "freejazz",
        "improvisation",
        "minimal",
        "Antwerp"
      ],
      "item_id": 2475837718,
      "datePublished": "27 Oct 2017 00:00:00 GMT",
      "about": "KODIAN TRIO : \n\nAndrew Lisle - drums\n\nDirk Serries - guitar\n\nColin Webster - alto saxophone \n\n\n\n\n\nPerformed, recorded and mixed at Sunny Side Inc. Studios, Anderlecht (Belgium) on October 16th 2016.\n\nMastered by Dirk Serries.\n\n\n\nCoverart & design by Lasse Marhaug",
      "credits": "released October 27, 2017",
      "license": "all rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a1882692443_0",
      "trackinfo": [
        {
          "title": "A1",
          "duration": "03:23",
          "lyrics": null
        },
        {
          "title": "A2",
          "duration": "08:49",
          "lyrics": null
        },
        {
          "title": "A3",
          "duration": "11:03",
          "lyrics": null
        },
        {
          "title": "B1",
          "duration": "04:40",
          "lyrics": null
        },
        {
          "title": "B2",
          "duration": "07:59",
          "lyrics": null
        },
        {
          "title": "B3",
          "duration": "10:02",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://dirkserries.bandcamp.com/album/etched-above-the-bow-grip",
      "title": "Etched Above The Bow Grip",
      "artist": "Dirk Serries",
      "classification": "paid",
      "tags": [
        "Experimental",
        "ambient",
        "freejazz",
        "improvisation",
        "minimal",
        "Antwerp"
      ],
      "item_id": 873982411,
      "datePublished": "14 May 2016 00:00:00 GMT",
      "about": "Dirk Serries : electric guitar, amps, effects.\n\n\n\nImprovisations recorded, mixed and mastered at Sunny Side Inc. Studio, Anderlecht (Belgium).\n\n\n\nArtwork by Colin Webster\n\n\n\nIn memory of Derek Bailey † 1930-2005.\n\n\n\nRaw Tonk Records 2016 (RT018)",
      "credits": "released May 14, 2016",
      "license": "all rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a1782307323_0",
      "trackinfo": [
        {
          "title": "Sweet Ruin",
          "duration": "01:50",
          "lyrics": null
        },
        {
          "title": "Thorn As Spite",
          "duration": "02:51",
          "lyrics": null
        },
        {
          "title": "Diffused Wire Appliance",
          "duration": "03:39",
          "lyrics": null
        },
        {
          "title": "This Brutal Vortex",
          "duration": "02:27",
          "lyrics": null
        },
        {
          "title": "Etched Above The Bow Grip",
          "duration": "02:35",
          "lyrics": null
        },
        {
          "title": "Clusters Bleed",
          "duration": "02:36",
          "lyrics": null
        },
        {
          "title": "Assert Total Illusory Curve",
          "duration": "03:45",
          "lyrics": null
        },
        {
          "title": "Futility Wrath Allegory",
          "duration": "02:52",
          "lyrics": null
        },
        {
          "title": "In The Beckoning Rust",
          "duration": "01:49",
          "lyrics": null
        },
        {
          "title": "Celestial Perfume",
          "duration": "05:05",
          "lyrics": null
        },
        {
          "title": "The Broken Story End",
          "duration": "08:18",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://dirkserries.bandcamp.com/album/day-realms",
      "title": "Day Realms",
      "artist": "AQUARIUS / DIKEMAN / SERRIES",
      "classification": "paid",
      "tags": [
        "Experimental",
        "ambient",
        "freejazz",
        "improvisation",
        "minimal",
        "Antwerp"
      ],
      "item_id": 3754671579,
      "datePublished": "31 Jul 2017 00:00:00 GMT",
      "about": "John Dikeman - Tenor Saxophone\n\nDirk Serries - Guitar\n\nRené Aquarius - Drums\n\n\n\nDay Realms was recorded live on March 25 2015\n\nat Kinky Star, Ghent, Belgium\n\n\n\nEngineered By Dirk Serries\n\nMixed and Mastered by Marlon Wolterink\n\nat White Noise Studio, Winterswijk, The Netherlands\n\n\n\nGraphic design by Lewis McLean",
      "credits": "released July 31, 2017",
      "license": "all rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a0427348384_0",
      "trackinfo": [
        {
          "title": "Day Realms",
          "duration": "41:47",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://dirkserries.bandcamp.com/album/kehr",
      "title": "Kehr",
      "artist": "N &amp; Dirk Serries",
      "classification": "paid",
      "tags": [
        "Experimental",
        "ambient",
        "freejazz",
        "improvisation",
        "minimal",
        "Antwerp"
      ],
      "item_id": 3307285702,
      "datePublished": "01 Oct 2015 00:00:00 GMT",
      "about": "N : electric guitars\n\nDirk Serries : arrangements & mixing.\n\nMastered by Fear Falls Burning.",
      "credits": "released October 1, 2015\n            \n            Released on vinyl by Denovali Records.",
      "license": "all rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a2601926287_0",
      "trackinfo": [
        {
          "title": "N H D S I 23 2 14",
          "duration": "09:59",
          "lyrics": null
        },
        {
          "title": "N H D S II 24 2 14",
          "duration": "10:55",
          "lyrics": null
        },
        {
          "title": "N H D S III 25 2 14",
          "duration": "21:27",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://dirkserries.bandcamp.com/album/daelman-serries-troch",
      "title": "DAELMAN / SERRIES / TROCH",
      "artist": "DAELMAN / SERRIES / TROCH",
      "classification": "paid",
      "tags": [
        "Experimental",
        "ambient",
        "freejazz",
        "improvisation",
        "minimal",
        "Antwerp"
      ],
      "item_id": 3312480113,
      "datePublished": "31 Oct 2016 00:00:00 GMT",
      "about": "A : Anderlecht Session II\n\nJan Daelman : tenor sax / flute / baby violin Dirk Serries : guitar\n\n\n\nB : Anderlecht Session I \n\nThijs Troch : piano Dirk Serries : guitar\n\n\n\nC : Live at De Singer Rijkevorsel \n\nJan Daelman : flute\n\nThijs Troch : piano\n\nDirk Serries : guitar\n\n\n\nD : Live at De Singer Rijkevorsel \n\nRecycling by Fear Falls Burning\n\n\n\n'A' and 'B' recorded by Nicolas Lefèvre at Sunny Side Inc. Sudio in Anderlecht, Belgium\n\n'C' recorded live by Kris Roevens at De Singer in Rijkevorsel, Belgium 'A' mixed by Jan Daelman and Dirk Serries\n\n'B' mixed by Thijs Troch, Nicolas Lefèvre and Dirk Serries\n\n'C' and 'D' mixed by Dirk Serries\n\n\n\nAll music mastered by Dirk Serries\n\n\n\nSpecial thanks to Rogé Verstraete, Nicolas Lefèvre, Kris Roevens, Tom Baeten, Luc De Vrij and David McLean. Thanks to Carla for the nice food.",
      "credits": "released October 31, 2016",
      "license": "all rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a0756577317_0",
      "trackinfo": [
        {
          "title": "A",
          "duration": "35:37",
          "lyrics": null
        },
        {
          "title": "B",
          "duration": "36:45",
          "lyrics": null
        },
        {
          "title": "C",
          "duration": "25:24",
          "lyrics": null
        },
        {
          "title": "D",
          "duration": "22:22",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://dirkserries.bandcamp.com/album/00",
      "title": "0.0",
      "artist": "Scatterwound",
      "classification": "paid",
      "tags": [
        "Experimental",
        "ambient",
        "freejazz",
        "improvisation",
        "minimal",
        "Antwerp"
      ],
      "item_id": 565409194,
      "datePublished": "04 Feb 2017 00:00:00 GMT",
      "about": "SCATTERWOUND :\n\n\n\nDirk Serries : electric guitar, effects, amps\n\nHellmut Neidhardt : electric guitar, effects, amps",
      "credits": "released February 4, 2017",
      "license": "all rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a3769970282_0",
      "trackinfo": [
        {
          "title": "110512",
          "duration": "15:28",
          "lyrics": null
        },
        {
          "title": "110513",
          "duration": "11:45",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://dirkserries.bandcamp.com/album/night-realms",
      "title": "Night Realms",
      "artist": "AQUARIUS / DIKEMAN / SERRIES",
      "classification": "paid",
      "tags": [
        "Experimental",
        "ambient",
        "freejazz",
        "improvisation",
        "minimal",
        "Antwerp"
      ],
      "item_id": 1620549149,
      "datePublished": "08 Apr 2016 00:00:00 GMT",
      "about": "John Dikeman - saxophone\n\nDirk Serries - guitar\n\nRené Aquarius - drums\n\n\n\nNight Realms was recorded live on March 14 2015 at Kunstgroep De Compagnie, Veghel, The Netherlands\n\n\n\nEngineered by Dirk Serries\n\n\n\nMixed and Mastered by Marlon Wolterink at White Noise Studio, Winterswijk, The Netherlands\n\n\n\nGraphic design by Lewis McLean",
      "credits": "released April 8, 2016",
      "license": "all rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a0737932592_0",
      "trackinfo": [
        {
          "title": "Night Realms",
          "duration": "40:34",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://dirkserries.bandcamp.com/album/hymnal",
      "title": "Hymnal",
      "artist": "Steven R. Smith &amp; Dirk Serries",
      "classification": "paid",
      "tags": [
        "Experimental",
        "ambient",
        "freejazz",
        "improvisation",
        "minimal",
        "Antwerp"
      ],
      "item_id": 2511971772,
      "datePublished": "27 Jan 2018 16:47:55 GMT",
      "about": "Originally released on limited tape (Cassauna, 2016).",
      "credits": "released January 27, 2018\n            \n            Instruments : electric guitars, spike fiddle, fender rhodes, organs, strings, effects\n\n\n\n\"stunning new tape from IMPORTANT's cassette imprint CASSAUNA - an SRS collaboration is a rare treat - before this there was only a couple lps with GARETH DAVIS from a few years back -- HYMNAL is a collection of four \"hymns\", semi improvised, dealing in elegant fermatas, lush instrumentation, rising, falling, intertwining - kinda like those minimal ambient interludes on late period TALK TALK albums stretched to the twenty minute mark, maybe landing somewhere between FLYING SAUCER ATTACK's INSTRUMENTALS and STARS OF THE LID's triple lps -- SERRIES brings his MICROPHONICS immersed atmospheric drone, SRS brings his ULAAN PASSERINE stargazing ambient folk -- HYMNAL seems an instant classic, way up there on my shortlist of epic ambient drone collaborations, in the same company as BARDO POND & TOM CARTER's 4/23/03 and TWELLS & CHRISTENSEN's COASTS, dare i even mention FRIPP & ENO, maybe -- i wasn't sure there would be a tape this year that would give FIVE GUITARS a run for it's money, let alone one so soon\n\n\n\nhighest possible recommendation\"  psilabtapes.blogspot.be",
      "license": "all rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a1099483984_0",
      "trackinfo": [
        {
          "title": "Hymn In A",
          "duration": "20:06",
          "lyrics": null
        },
        {
          "title": "Hymn In C",
          "duration": "20:01",
          "lyrics": null
        },
        {
          "title": "Hymn In F",
          "duration": "19:31",
          "lyrics": null
        },
        {
          "title": "Hymn In C#",
          "duration": "21:40",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://dirkserries.bandcamp.com/album/the-sleep-of-reason",
      "title": "The Sleep Of Reason",
      "artist": "The Sleep Of Reason",
      "classification": "paid",
      "tags": [
        "Experimental",
        "ambient",
        "freejazz",
        "improvisation",
        "minimal",
        "Antwerp"
      ],
      "item_id": 4163943740,
      "datePublished": "15 Apr 2017 00:00:00 GMT",
      "about": "Originally released on 4XLP on clear 180gram vinyl + CD, 200 hand-numbered copies, housed in a clear gatefold jacket, 2012.",
      "credits": "released April 15, 2017\n            \n            The Sleep Of Reason is Jon Attwood and Dirk Serries.\n\nAll music recorded between 2009 and 2011.\n\n\n\nBonus Live Album performed at the Tonefloat Label Night February 27, 2011, Paradox Club, Tilburg, The Netherlands.",
      "license": "all rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a0939726933_0",
      "trackinfo": [
        {
          "title": "A1A",
          "duration": "10:07",
          "lyrics": null
        },
        {
          "title": "A1B",
          "duration": "08:17",
          "lyrics": null
        },
        {
          "title": "B1C",
          "duration": "09:38",
          "lyrics": null
        },
        {
          "title": "B1D",
          "duration": "06:50",
          "lyrics": null
        },
        {
          "title": "B2A",
          "duration": "08:10",
          "lyrics": null
        },
        {
          "title": "B2B",
          "duration": "08:25",
          "lyrics": null
        },
        {
          "title": "B2C",
          "duration": "09:12",
          "lyrics": null
        },
        {
          "title": "B2D",
          "duration": "08:11",
          "lyrics": null
        },
        {
          "title": "C3A",
          "duration": "08:23",
          "lyrics": null
        },
        {
          "title": "C3B",
          "duration": "10:44",
          "lyrics": null
        },
        {
          "title": "C3C",
          "duration": "07:17",
          "lyrics": null
        },
        {
          "title": "C3D",
          "duration": "12:31",
          "lyrics": null
        },
        {
          "title": "The Sleep Of Reason Live At Paradox Feb 27th 2011",
          "duration": "33:06",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://dirkserries.bandcamp.com/album/transmission",
      "title": "Transmission",
      "artist": "Art Of Cosmic Musings",
      "classification": "paid",
      "tags": [
        "Experimental",
        "ambient",
        "freejazz",
        "improvisation",
        "minimal",
        "Antwerp"
      ],
      "item_id": 3419303921,
      "datePublished": "15 Apr 2017 00:00:00 GMT",
      "about": "Originally released in a limited edition on clear and black 180gram vinyl, 2014.",
      "credits": "released April 15, 2017\n            \n            Art Of Cosmic Musings is :\n\nTeun Verbruggen - drums, electronics\n\nDirk Serries - electric guitar\n\n\n\nRecorded live at the Sunny Side inc. studio, Anderlecht - July 2013.\n\nMixed and mastered by Nicolas Lefèvre.\n\n\n\nPhotography by Martina Verhoeven. Design by Carl Glover.",
      "license": "all rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a3742898906_0",
      "trackinfo": [
        {
          "title": "Dome",
          "duration": "19:06",
          "lyrics": null
        },
        {
          "title": "Discord",
          "duration": "14:20",
          "lyrics": null
        },
        {
          "title": "Transmission",
          "duration": "14:59",
          "lyrics": null
        },
        {
          "title": "With Thorn",
          "duration": "16:55",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://dirkserries.bandcamp.com/album/live-at-cafe-oto",
      "title": "Live at Cafe Oto",
      "artist": "Dave Jackson &amp; Dirk Serries",
      "classification": "paid",
      "tags": [
        "Experimental",
        "ambient",
        "freejazz",
        "improvisation",
        "minimal",
        "Antwerp"
      ],
      "item_id": 3190544315,
      "datePublished": "13 May 2016 00:00:00 GMT",
      "about": "Dave Jackson : alto sax\n\nDirk Serries : electric guitar\n\n\n\nRecorded live at Cafe Oto (London) on July 14th, 2015 by James Dunn. Mixing & Mastering by Dirk Serries\n\n\n\nOriginally released as a split tape TWO DUOS (with Fred Lonberg-Holm/Lotte Anker) on Astral Spirits.",
      "credits": "released May 13, 2016",
      "license": "all rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a3201805983_0",
      "trackinfo": [
        {
          "title": "Live At Cafe Oto",
          "duration": "28:55",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://dirkserries.bandcamp.com/album/enomeni",
      "title": "Enomeni",
      "artist": "AIDAN BAKER / HELLMUT NEIDHARDT / DIRK SERRIES",
      "classification": "paid",
      "tags": [
        "Experimental",
        "ambient",
        "freejazz",
        "improvisation",
        "minimal",
        "Antwerp"
      ],
      "item_id": 301649609,
      "datePublished": "14 Oct 2016 00:00:00 GMT",
      "about": "Aidan Baker : electric guitar, effects\n\nHellmut Neidhardt : electric guitar, effects, amps\n\nDirk Serries : electric guitar, effects, amps\n\n\n\nRecorded by Christoph Scheidel.\n\nMixed and mastered by Fear Falls Burning.\n\n\n\n\n\n“Enomeni” (which is Greek and means “connected”) is a document of a special live performance. Aidan Baker, N and Dirk Serries came together for the first time to play an improvised live session. The result is an one hour session, divided into four tracks.\n\n\n\nImprovised live 13/09/2014 due to the marriage of Cosima & Dimi.",
      "credits": "released October 14, 2016",
      "license": "all rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a3495406411_0",
      "trackinfo": [
        {
          "title": "Enomeni",
          "duration": "45:21",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://dirkserries.bandcamp.com/album/the-devastation-chant-ii",
      "title": "The Devastation Chant II",
      "artist": "Dirk Serries",
      "classification": "paid",
      "tags": [
        "Experimental",
        "ambient",
        "freejazz",
        "improvisation",
        "minimal",
        "Antwerp"
      ],
      "item_id": 1863774466,
      "datePublished": "03 Jun 2019 00:00:00 GMT",
      "about": null,
      "credits": "released June 3, 2019\n            \n            Dirk Serries : guitars, effects.\n\n\n\nRecorded in 2013-2014, mixex and (re-)-mastered in 2018.\n\n\n\nOriginally released on Silentes/13. Limited to 100 hand-numbered copies, issued in a gatefold sleeve, includes an Obi-strip.\n\n\n\nThis bonus track is featured on the reissue of \"8+8\" series, originally published on a single-sided lathe cut record (8 copies only) in 2015.",
      "license": "all rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a1347703942_0",
      "trackinfo": [
        {
          "title": "II",
          "duration": "08:35",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://dirkserries.bandcamp.com/album/unseen-descending-and-lamentations",
      "title": "Unseen Descending And Lamentations",
      "artist": "Dirk Serries",
      "classification": "paid",
      "tags": [
        "Experimental",
        "ambient",
        "freejazz",
        "improvisation",
        "minimal",
        "Antwerp"
      ],
      "item_id": 178491240,
      "datePublished": "22 May 2015 00:00:00 GMT",
      "about": null,
      "credits": "released May 22, 2015\n            \n            ds : all instruments.\n\n\n\nRecorded and mixed October 2014.\n\nMastered by James Plotkin.\n\n\n\nPhotography by Martina Verhoeven.\n\nLayout by Rutger Zuydervelt\n\n\n\n\n\nOriginally released on Consouling Sounds on both vinyl and cd, 2015.",
      "license": "all rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a3619530081_0",
      "trackinfo": [
        {
          "title": "Part One",
          "duration": "21:31",
          "lyrics": null
        },
        {
          "title": "Part Two",
          "duration": "22:30",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://dirkserries.bandcamp.com/album/buoyant",
      "title": "Buoyant",
      "artist": "Dirk Serries &amp; Rutger Zuydervelt",
      "classification": "paid",
      "tags": [
        "Experimental",
        "ambient",
        "freejazz",
        "improvisation",
        "minimal",
        "Antwerp"
      ],
      "item_id": 2696517077,
      "datePublished": "22 May 2015 00:00:00 GMT",
      "about": null,
      "credits": "released May 22, 2015\n            \n            Dirk Serries : electric guitars, effects.\n\nRutger Zuydervelt : Additional effects and processing.\n\nMastered by Brian Wenckebach \n\n\n\nLayout by Rutger Zuydervelt.\n\n\n\nOriginally released on both vinyl and cd by Consouling Sounds, 2015.",
      "license": "all rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a1164390112_0",
      "trackinfo": [
        {
          "title": "Buoyant One - Lost Trail",
          "duration": "10:25",
          "lyrics": null
        },
        {
          "title": "Buoyant Two - The Whispering Scale",
          "duration": "14:03",
          "lyrics": null
        },
        {
          "title": "Buoyant Three - Unraveled Blanket",
          "duration": "08:09",
          "lyrics": null
        },
        {
          "title": "Buoyant Four - The Dissection",
          "duration": "13:44",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://dirkserries.bandcamp.com/album/background-curtain",
      "title": "Background Curtain",
      "artist": "Celer &amp; Dirk Serries",
      "classification": "paid",
      "tags": [
        "Experimental",
        "ambient",
        "freejazz",
        "improvisation",
        "minimal",
        "Antwerp"
      ],
      "item_id": 4245842030,
      "datePublished": "24 Oct 2016 00:00:00 GMT",
      "about": "Recorded by Dirk Serries in Belgium between 2013 and 2015, and Will Long in Japan between 2014 and 2016.\n\n\n\nCover photo courtesy of Will Long.\n\n\n\nDesign by Rutger Zuydervelt.",
      "credits": "released October 24, 2016",
      "license": "all rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a3674161284_0",
      "trackinfo": [
        {
          "title": "Above/Below",
          "duration": "18:10",
          "lyrics": null
        },
        {
          "title": "Below/Above",
          "duration": "16:58",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://dirkserries.bandcamp.com/album/obscured-by-beams-of-sorrow",
      "title": "Obscured By Beams Of Sorrow",
      "artist": "Hakobune &amp; Dirk Serries",
      "classification": "paid",
      "tags": [
        "Experimental",
        "ambient",
        "freejazz",
        "improvisation",
        "minimal",
        "Antwerp"
      ],
      "item_id": 3605012338,
      "datePublished": "03 Sep 2015 00:00:00 GMT",
      "about": "All music written by Hakobune & Dirk Serries\n\nMixed by Hakobune\n\nMastered by Dirk Serries\n\n\n\nPhotograph by Aurélie Scouarnec",
      "credits": "released September 3, 2015",
      "license": "all rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a0320248103_0",
      "trackinfo": [
        {
          "title": "The Slow Movement Of Thought",
          "duration": "12:11",
          "lyrics": null
        },
        {
          "title": "Harrowing Surface",
          "duration": "13:26",
          "lyrics": null
        },
        {
          "title": "Nocturnal Pillars Of Solitude",
          "duration": "13:22",
          "lyrics": null
        },
        {
          "title": "Obscured",
          "duration": "12:42",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://dirkserries.bandcamp.com/album/the-storm-of-silence",
      "title": "The Storm Of Silence",
      "artist": "Chihei Hatakeyama &amp; Dirk Serries",
      "classification": "paid",
      "tags": [
        "Experimental",
        "ambient",
        "freejazz",
        "improvisation",
        "minimal",
        "Antwerp"
      ],
      "item_id": 2644358837,
      "datePublished": "15 Jan 2016 00:00:00 GMT",
      "about": "All music: Chihei Hatakeyama + Dirk Serries\n\n\n\nMixed by Dirk Serries. \n\nMastered By Chihei Hatakeyama.\n\n\n\nPhoto by Bjarne Riesto\n\nLayout by Rutger Zuydervelt",
      "credits": "released January 15, 2016",
      "license": "all rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a3211253758_0",
      "trackinfo": [
        {
          "title": "Kulde",
          "duration": "07:55",
          "lyrics": null
        },
        {
          "title": "Uvaer",
          "duration": "10:29",
          "lyrics": null
        },
        {
          "title": "Fryst",
          "duration": "12:41",
          "lyrics": null
        },
        {
          "title": "Hvit",
          "duration": "10:55",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://dirkserries.bandcamp.com/album/buoyant-live",
      "title": "Buoyant Live",
      "artist": "Dirk Serries &amp; Rutger Zuydervelt",
      "classification": "paid",
      "tags": [
        "Experimental",
        "ambient",
        "freejazz",
        "improvisation",
        "minimal",
        "Antwerp"
      ],
      "item_id": 3948772741,
      "datePublished": "15 Apr 2017 14:19:42 GMT",
      "about": "Originally released in a limited edition of 300 numbered copies on 180 grams black vinyl in 24x36inch poster sleeve.\n\n\n\nA semi-improvised live adaptation of the 'Buoyant' album, which was released on Consouling Sounds. This was also the first ever duo performance of Dirk Serries and Rutger Zuydervelt.",
      "credits": "released April 15, 2017\n            \n            Dirk Serries : electric guitar, effects.\n\nRutger Zuydervelt : sounds, effects.\n\n\n\nRecorded live at the Incubate Festival, September 19th 2015, Paradox, Tilburg, The Netherlands. Mixed and mastered by Rutger Zuydervelt.\n\n\n\nLive mix by Ronald Mariën. Recorded by Carmen Raats.\n\n\n\nDesign by Rutger Zuydervelt.",
      "license": "all rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a2228505509_0",
      "trackinfo": [
        {
          "title": "Buoyant Live",
          "duration": "48:13",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://dirkserries.bandcamp.com/album/the-devastation-chant",
      "title": "The Devastation Chant",
      "artist": "Dirk Serries",
      "classification": "paid",
      "tags": [
        "Experimental",
        "ambient",
        "freejazz",
        "improvisation",
        "minimal",
        "Antwerp"
      ],
      "item_id": 1164734297,
      "datePublished": "27 Jan 2018 00:00:00 GMT",
      "about": "Originally released on a super limited lathe 8\" cut, ltd to 8 copies, on 13/Silentes (2015).\n\n\n\nLimited edition of 8 copies.\n\n8+8 A SERIES OF TORN VISIONS\n\n8+8 is a series of 8 different visions by Stefano Gentile (photo size 8\").\n\nEach photograph is accompanied by a different soundtrack.\n\n8 different photographs with the sound track from 8 different artists.\n\nEach photo is limited to 8 numbered copies.",
      "credits": "released January 27, 2018\n            \n            Dirk Serries : guitars, effects.\n\nRecorded in 2013, Mixed and Mastered in 2015.",
      "license": "all rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a3218452055_0",
      "trackinfo": [
        {
          "title": "The Devastation Chant",
          "duration": "07:52",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://dirkserries.bandcamp.com/album/the-eightfold-model",
      "title": "The Eightfold Model",
      "artist": "The Eightfold Model",
      "classification": "paid",
      "tags": [
        "Experimental",
        "ambient",
        "freejazz",
        "improvisation",
        "minimal",
        "Antwerp"
      ],
      "item_id": 1678804779,
      "datePublished": "15 Apr 2017 00:00:00 GMT",
      "about": "Originally released in a limited edition of 500 copies on 180-gram black vinyl in gatefold picture sleeve, 2008.",
      "credits": "released April 15, 2017\n            \n            The Eightfold Model is\n\nElectric Guitar, Loops, Effects – Dirk Serries\n\nHarmonium, Field Recordings, Effects – kptmichigan*\n\n\n\nIllustration [Drawings] by Ilan Katin. Design by Carl Glover.",
      "license": "all rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a1825967176_0",
      "trackinfo": [
        {
          "title": "Exboren",
          "duration": "03:40",
          "lyrics": null
        },
        {
          "title": "Droneathon (Fast)",
          "duration": "07:47",
          "lyrics": null
        },
        {
          "title": "Lullaby For Shimon",
          "duration": "06:56",
          "lyrics": null
        },
        {
          "title": "Hille",
          "duration": "04:22",
          "lyrics": null
        },
        {
          "title": "Droneathon (Slow)",
          "duration": "08:05",
          "lyrics": null
        },
        {
          "title": "Tegel",
          "duration": "06:18",
          "lyrics": null
        },
        {
          "title": "Vrooom",
          "duration": "08:15",
          "lyrics": null
        }
      ]
    }
  ]
}