{
  "Lo.Sai": [
    {
      "url": "https://lorenzosaini.bandcamp.com/album/journal-dun-corps-ost",
      "title": "Journal d&#39;un corps (OST)",
      "artist": "Lo.Sai",
      "classification": "paid",
      "tags": [
        "Electronic",
        "IDM",
        "ambient",
        "bass",
        "contemporary dance",
        "electro-acoustic",
        "leftfield",
        "meditative",
        "ost",
        "palmas",
        "soundtrack",
        "techno",
        "Milan"
      ],
      "item_id": 1383447314,
      "datePublished": "26 Jan 2024 00:00:00 GMT",
      "about": "“Journal du corps” is a short dance theatre piece inspired by the novel of the same name by Daniel Pennac, from which it reworks some key themes. Historian, dancer, and journalist Olimpia Capitano selected five passages of the original text that evoke a sense of misperception, fear and conflict, sexuality, and fleetingness. The reinterpretation of these textual and conceptual passages is interlaced with elements that closely relate to personal life experiences, allowing them to be conveyed with genuine sincerity despite the surreal nature of the visual experience.\n\n\n\nMFZ Records presents a selection of three pieces drawn from the original soundtrack by Lorenzo Saini, aka Lo.Sai.\n\n\n\n“Only Truly” is a two-voice counterpoint for synthesizer, interrupted by moments of dark, ethereal sound design. It transports us to a Lynchian and alien dimension, reminiscent of the soundtrack of the series “Dark.” More than a race through the woods, it evokes labyrinthine architectures and dimensions.\n\n\n\n“Cinemascope” opens with traditional palmas percussion and a sampling of Tarrega’s “Capriccio Arabo,” reworked with sensual and psychedelic distortions. The guitar sound often transmutes into a Fender Rhodes, with harmonies and melodies intertwining like the bodies on stage in a seamless flow. It’s a propulsive piece straddling the line between bass music and Spanish tradition.\n\n\n\n“A Bird Song Will Rise” is a modern passacaglia, a kaleidoscopic sequence that renews its musical material through slow modal permutations. Meditative, cathartic, and psychedelic until its dissolution and liberation with the bird song that closes the piece. This choice suggests a reconciliation that passes through the body and a new balance between the two perceptual spheres, the psychological and the physical.",
      "credits": "released January 26, 2024\n            \n            Music and Sound Design: Lorenzo Saini\n\nMix and Master: Filippo Conti, Lorenzo Saini",
      "license": "all rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a0684757083_0",
      "trackinfo": [
        {
          "title": "Only Truly",
          "duration": "04:02",
          "lyrics": null
        },
        {
          "title": "Cinemascope",
          "duration": "04:24",
          "lyrics": null
        },
        {
          "title": "A Bird Song Will Rise",
          "duration": "04:58",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://lorenzosaini.bandcamp.com/album/maitake",
      "title": "Maitake - 舞茸",
      "artist": "Lo.Sai",
      "classification": "paid",
      "tags": [
        "Electronic",
        "IDM",
        "ambient",
        "asmr",
        "bass",
        "bass music",
        "hypnotic",
        "soundtrack",
        "techno",
        "tribal",
        "Milan"
      ],
      "item_id": 3025151768,
      "datePublished": "13 Jun 2025 00:00:00 GMT",
      "about": "Danza Tribale opens a new chapter in 2025 with MAITAKE – 舞茸, the debut EP from Italian sound explorer Lo.Sai. Rooted in sonic tactility and movement, the project draws from both ancestral rhythms and experimental structures to create something intimate, immersive, and future-facing.\n\nNamed after the “dancing mushroom” from Japanese folklore, MAITAKE is inspired by the interconnected growth of mycelial networks and the emotional ecology of shared experience. Developed in collaboration with choreographer Maria Combi, the EP is a meditation on collective motion — where dance, rhythm, and ritual coalesce.\n\nAcross five tracks, Lo.Sai weaves together broken percussion, deep bass, field recordings, and global rhythmic language. Fragments of flamenco, muezzin prayer, and Central African everyday rhythms float through the record — artefacts gathered by the artist’s close-knit creative circle in Lunigiana. What emerges is not just a club record, but a living, breathing sonic organism.\n\nThis release also launches a new visual era for Danza Tribale, with artwork by BIFFIPOL STUDIO — a tactile and abstract direction that reflects the EP’s deep physicality and layered cultural language. \n\n\n\nnewsdistri.ffm.to/dnzt018",
      "credits": "released June 13, 2025\n            \n            Mastered by Giuseppe Tillieci at Enisslab Studios, Rome.\n\nVocals on “Voi Siete Qui” by Maria Combi.\n\n\n\nMixed by Lorenzo Saini and Filippo Conti.\n\nThanks to Adelisa Selimbašić, Michele Mucci and Giuditta Vettese.",
      "license": "all rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a1065721485_0",
      "trackinfo": [
        {
          "title": "Voi Siete Qui",
          "duration": "01:28",
          "lyrics": null
        },
        {
          "title": "LesssGo",
          "duration": "04:15",
          "lyrics": null
        },
        {
          "title": "Look! A Selimbasic",
          "duration": "04:38",
          "lyrics": null
        },
        {
          "title": "Toute Les Choses, C'est Le Rythme",
          "duration": "03:10",
          "lyrics": null
        },
        {
          "title": "Vertigo Effect",
          "duration": "04:03",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://lorenzosaini.bandcamp.com/album/medea-ost",
      "title": "MEDEA (OST)",
      "artist": "Lo.Sai",
      "classification": "paid",
      "tags": [
        "Acoustic",
        "Ambient",
        "Electronic",
        "Granular",
        "IDM",
        "ambient",
        "bass",
        "doublebass",
        "electro-acoustic",
        "piano",
        "soundscape",
        "soundtrack",
        "techno",
        "Milan"
      ],
      "item_id": 1622729291,
      "datePublished": "25 Sep 2020 00:00:00 GMT",
      "about": "\"Once two landscapes merge a new soundscape is given birth\"\n\n\n\nMEDEA - OST is the first release of Italian multi-instrumentalist and composer Lorenzo Saini. It is a selection of tracks conceived for two different theatre performances, \"Medea, live in Corinth\" and a dance impro by \"Atelier delle arti\".\n\nThe resulting album is an electro-acoustic joruney that shifts from noisy live electronics to jazzy and neoclassical, from dark ambience to relaxing meditative sound baths.\n\n\n\nThanks to Chelo Zoppi, Elena De Carolis, Sara Fallani, Francesca Lombardi and Andrea Fumelli.",
      "credits": "released September 25, 2020\n            \n            Sound Design: Andrea Fumelli\n\nEngineer: Nicola De Luca\n\nMix and Master: Filippo Conti\n\n\n\nPhoto: Michele Giannoni \n\nArtwork: Andrea Zucca",
      "license": "all rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a1867119226_0",
      "trackinfo": [
        {
          "title": "Argano",
          "duration": "02:06",
          "lyrics": null
        },
        {
          "title": "Ira",
          "duration": "05:10",
          "lyrics": null
        },
        {
          "title": "Patagonia",
          "duration": "01:41",
          "lyrics": null
        },
        {
          "title": "Mare",
          "duration": "08:21",
          "lyrics": null
        },
        {
          "title": "Stormi",
          "duration": "01:44",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://lorenzosaini.bandcamp.com/album/mompou-an-intimate-impression",
      "title": "Mompou: an Intimate Impression",
      "artist": "Lo.Sai",
      "classification": "paid",
      "tags": [
        "Ambient",
        "Classical Music",
        "Electronic",
        "Experimental",
        "IDM",
        "Mompou",
        "Spanish Classical",
        "Synth",
        "ambient",
        "bass",
        "soundtrack",
        "techno",
        "Milan"
      ],
      "item_id": 2577676813,
      "datePublished": "07 Oct 2022 00:00:00 GMT",
      "about": "Lorenzo Saini pays tribute to Impressions íntimes, a collection of music by Catalan composer Frederic Mompou.\n\n\n\nComposed at the beginning of the Twentieth century, the nine short pieces that form the piano collection Impressions íntimes are brought into a new territory by Lorenzo Saini. Focussing on the phenomenon of resonances, the Italian musician adds a new layer of interpretation to the original music, which sits at the intersection of the sacred, the solemn, the eerie and the melancholic. \n\n\n\nConcocted during the first wave of Covid, the project tries to narrate contemporaneity through the lenses of a musical past—one that is only apparently nostalgic—by concatenating a series of short audio souvenirs in which time and sound tend to lose their usual coordinates.",
      "credits": "released October 7, 2022\n            \n            Cover art: Emilia Trevisani\n\n\n\nOriginal compositions: Frederic Mompou\n\n\n\nArrangement and Sound Design: Lorenzo Saini\n\n\n\nMixed by Lorenzo Saini and Filippo Conti\n\n\n\nMastered by Michele Mucci (Nachtkerze Studio Berlin)",
      "license": "all rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a0786253809_0",
      "trackinfo": [
        {
          "title": "Planys I",
          "duration": "01:00",
          "lyrics": null
        },
        {
          "title": "Planys II",
          "duration": "01:36",
          "lyrics": null
        },
        {
          "title": "Planys III",
          "duration": "00:57",
          "lyrics": null
        },
        {
          "title": "Planys IV",
          "duration": "02:10",
          "lyrics": null
        },
        {
          "title": "Pàjaro Triste",
          "duration": "02:26",
          "lyrics": null
        },
        {
          "title": "La Barca",
          "duration": "01:26",
          "lyrics": null
        },
        {
          "title": "Cuna",
          "duration": "02:49",
          "lyrics": null
        },
        {
          "title": "Secreto",
          "duration": "02:09",
          "lyrics": null
        },
        {
          "title": "Gitano",
          "duration": "03:10",
          "lyrics": null
        }
      ]
    }
  ]
}