{
  "Ivo Perelman": [
    {
      "url": "https://ivoperelmanmusic.bandcamp.com/album/tuning-forks",
      "title": "Tuning Forks",
      "artist": "Ivo Perelman and Matt Moran",
      "classification": "paid",
      "tags": [
        "Jazz",
        "free jazz",
        "improvisation",
        "New York"
      ],
      "item_id": 263476269,
      "datePublished": "13 Sep 2023 00:00:00 GMT",
      "about": "In the course of Ivo Perelman’s long career on and off records (but mostly, it seems to me, on, since he tends to release a new album every six weeks or so), there have been a few albums that rank as special and mesmerizing from start to finish. Fruition with pianist Matthew Shipp was clearly one of these, and so too, for me at least, is this new incarnation with vibes player Matt Moran.\n\n\n\nPerelman explained to me that he rescued my label Ibeji (which released Soccer Land and Tapebas Songs in the 90s) in the digital format of Bandcamp. This way I will launch from time to time some special projects than other labels will not. This duo with Matt Moran comes after a period of studies of the tuning fork and its acoustics and therapeutic tools (see photo). That’s why you will hear in this recording a different timbre from my sax, penetrating and with richer harmonic sounds resulting from a vibrational hyper-absorption recently provided by these studies The vibraphone and the way Matt Moran plays it is very similar to what tuning forks provide.\n\n\n\nIt is thus not accidental or coincidental that many of these pieces are named after musical genres (Gregorian), methods of tuning (Pythagorean) or numerical sequences (Fibonacci). Perhaps most surprising, to me at least, is the one named after Robert Schumann. Even though I am aware that Ivo has a classical background, his jazz playing is so outré and has been so for so long that I would have thought his connection to classical music had been severed, perhaps not in his listening habits but surely in his methods of improvising. (Fore those who are wondering, Tesia is a Greek work meaning “late summer.” “Rife” is self-explanatory in English.)\n\n\n\nPerelman starts off Gregorian with a rhythmic figure that becomes a motif, and although he produces a few high-register squeals, they are moderate and less important than his interaction with Moran, whose vibes stay mostly in the middle of the instrument’s range. Te basic calming influence of Moran has a salutary effect on Perelman, not only in this track but also in the ones that follow. For the first time in my experience Perelman’s figures, especially around the 2:30 mark, are actually playful, a nice quality that I didn’t know he possessed. He later indulges in some fast double-time figures that run up and down the scale, yet never conflicts too strongly with the vibes, which play a supporting role here but also have a calming effect. At 4:40 Perelman suddenly begins playing very softly and deep in his lowest register, a nice touch that, again, I hadn’t heard from him in other recordings. Towards the end he returns to the high range, but more to play plaintive appeals than to engender hysteria.\n\n\n\nIf anything, the mood in Pythagorean is even mellower, with Perelman playing actual melodic lines. For the most part, Moran sticks to a series of chords and isolated solo notes, creating an environment for Perelman to play in rather that goading him into more aggressive competition, and this serves both of them well. Moran gets to solo in this one, and it’s a good solo, bt by and large he acts like musical Ritalin for Perelman’s tendency towards hyper-excitement.\n\n\n\nTesia is a fast track, and here Perelman lives in his overblown high range, yet the figures he produces still make sense and add to Moran’s equally busy vibes. It’s actually a duo-improvisation rather than a chase chorus.\n\n\n\nSchumann has nothing to do with the music of that German master; in fact, it is the most abstract piece on the album, yet it still has a relaxed feel. Here, Moran mostly plays chords, sounding like a glass harmonica, while Perelman creates a sparse yet delicate filigree around him. And so the performances go, always surprising, always original and all showing a slightly different aspect of Perlman’s musical personality. In such and environment, it’s easy to take Moran for granted, but working as a stabilizing force for Pereereman he performs an immense service.\n\n\n\nSince every track works towards a unity of style, in which the twp instrument complement each other, there are no weak tracks or superfluous moments. Every note and phrase seems to have its place in this musical cocktail without one instrument or the other drowning out either participant. My sole regret was that the CD is very short, less than 40 minutes, but I assure you that every single moment has its high points.\n\n\n\n\n\nI rescued my label Ibeji (which released Soccer Land and Tapebas songs in the 90s) in the digital format of Bandcamp. This way I will launch from time to time some special projects than other labels will not. This duo with Matt Moran comes after a period of studies of the tuning fork and its acoustics and therapeutic tools (see photo). That's why you will hear in this recording a different timbre from my sax, penetrating and with richer harmonic sounds resulting from a vibrational hyper-absorption recently provided by these studies The vibraphone and the way Matt Moran plays it is very similar to what tuning forks \n\nprovide.\n\n\n\nLynn Bayley\n\nThe Art Music Lounge",
      "credits": "released September 13, 2023\n            \n            Ivo photo by Celso Oliveira\n\nMatt photo by Weintraub\n\n\n\nTuning forks is the recording debut of Perelman/Moran. Perelman has been investigating the therapeutic and sound parameters of tuning forks hence the title name( there is a remarkable similar effect when striking vibes notes and/or tuning forks). \n\n\n\nAlbum credits: recorded, mix/ mastered by Jim Clouse at Parkwest studios on September 2023, Brooklyn NY \n\n\n\nIvo Perelman:ivomusic( ASCAP)\n\nMatt Moran :Bell Cry Music (BMI)",
      "license": "all rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a1519816335_0",
      "trackinfo": [
        {
          "title": "Gregorian",
          "duration": "07:40",
          "lyrics": null
        },
        {
          "title": "Pythagorean",
          "duration": "05:12",
          "lyrics": null
        },
        {
          "title": "Tesla",
          "duration": "03:10",
          "lyrics": null
        },
        {
          "title": "Schumann",
          "duration": "04:41",
          "lyrics": null
        },
        {
          "title": "Fibonacci",
          "duration": "05:51",
          "lyrics": null
        },
        {
          "title": "Rife",
          "duration": "08:43",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://ivoperelmanmusic.bandcamp.com/album/dust-of-light-ears-drawing-sounds",
      "title": "Dust of Light / Ears Drawing Sounds",
      "artist": "Ivo Perelman and Pascal Marzan",
      "classification": "paid",
      "tags": [
        "Jazz",
        "acoustic guitar",
        "creative music",
        "free improvisation",
        "free jazz",
        "freejazz",
        "improvisation",
        "tenor sax",
        "New York"
      ],
      "item_id": 3912717720,
      "datePublished": "28 Oct 2020 00:00:00 GMT",
      "about": "Coincidence came out at the meeting of French guitarist Pascal Marzan with Ivo Perelman. Like Ivo, but later in his life, Pascal Marzan dedicated his time to the learning and the mastering the classical acoustic guitar, studying and performing the same Brazilian composer that the young Ivo teethed as a youngster : Heitor Villa-Lobos and his Préludes, Études and Guitar Concerto … But after having performed classical music and also improvised music with legendary British improvisers like guitarist John Russell, violinist Phil Wachsmann and clarinettist Alex Ward, Pascal decided very recently to refound completely his practice of his axe in tuning it very differently. He bought a new ten strings classical guitar build at the requirements of the legendary virtuoso Narciso Yepes, one of the greatest guitarist of the Twentieth Century. With a lucid and premonitory intuition, he tuned each string with an interval of a third of a tone from the next string in order to develop a kind of microtonality. Coincidentally, one of the closest musical mate of Ivo, alto virtuoso improviser Mat Maneri is completely involved in this microtonal universe since he learned it from his father, the now deceased composer and reed maestro, Joe Maneri. They even both recorded for the ECM label. When Pascal and Ivo met at one London gig, they both clicked like twins. I would add that Pascal’s tuning is allowing to play in sixth of tone, because as you know guitar frets are slicing one tone in two half-tones… and in two different scales of thirds of tones and also in equal temperament as the “normal” notes are still available. Mindboggling. Ivo Perelman strives to challenge his own diving in microtones playing above or below the “pure” notes adjusting meticulously his reed and mouthpiece air pressure and sticking to no Forte, but a softer breath with more nuances. As the intervals of the notes of this 6th tone guitar are so tiny, you wonder at listening to Dust of light/ Ears Drawing Sound. Is it a hybrid string instrument, an harp or an harpsichord? For my opinion of dedicated writer about improvised music, this is the most brilliant and deepest guitar concept in contemporary improvisation since the legendary Derek Bailey. Strangely, this string arrangement produces a spooky reverberation revealing the frail nature of the Spanish guitar body made of glued tiny pieces of wood. The session went unnoticed and the result went beyond any expectation. Confronted to all kinds of plucking and touching the strings with Pascal Marzanincredible right hand, fingers and nails and his multivoiced wild arpeggios, Perelman exceeds his current inspiration concentrating his breath and fingering to extend forcefully his high soaring notes and his singing alto range while you hear clear ruminations of past jazz heroes like Ben Webster and Don Byas or nods to Albert Ayler. The variety of musical forms created in the spur of the moment is absolutely amazing and strangely lyrical and earthy, both players making a tour de force of this unexpected musique de chambre. \n\n\n\nJean Michel Van Schouwburg, author of Perelman/ Shipp: Embrace of the Souls\"(SMP)\n\n\n\nPHYSICAL CD AVAILABLE SOOON !",
      "credits": "released October 28, 2020\n            \n            Ivo Perelman - tenor sax\n\nPascal Marzan - ten string microtonal acoustic guitar\n\nRecorded at David Hunt Studio, London UK ,feb 2020\n\nProduced by Jean-Michel Van Schouwburg",
      "license": "all rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a0461014726_0",
      "trackinfo": [
        {
          "title": "Hot Dust-Obscured Galaxies",
          "duration": "07:27",
          "lyrics": null
        },
        {
          "title": "River Mirroring A Smiling Moon",
          "duration": "05:25",
          "lyrics": null
        },
        {
          "title": "Bees And Squirrels In The Garden/Two Bees At My Window",
          "duration": "08:16",
          "lyrics": null
        },
        {
          "title": "Sun Through Closed Eyelids",
          "duration": "02:57",
          "lyrics": null
        },
        {
          "title": "Ears Drawing Sounds",
          "duration": "01:24",
          "lyrics": null
        },
        {
          "title": "Dusts Of Light/Dancing In Shadowed Forests",
          "duration": "01:52",
          "lyrics": null
        },
        {
          "title": "Swinging Swallows",
          "duration": "01:16",
          "lyrics": null
        },
        {
          "title": "Conversation In The Wind/Conversation With The Wind",
          "duration": "02:00",
          "lyrics": null
        },
        {
          "title": "Calling At The Doorway",
          "duration": "02:17",
          "lyrics": null
        },
        {
          "title": "High Mountain Walk",
          "duration": "08:13",
          "lyrics": null
        },
        {
          "title": "Reflections",
          "duration": "02:49",
          "lyrics": null
        },
        {
          "title": "Mysterious Bells",
          "duration": "07:45",
          "lyrics": null
        }
      ]
    },
    {
      "url": "https://ivoperelmanmusic.bandcamp.com/album/interaction",
      "title": "Interaction",
      "artist": "Ivo Perelman",
      "classification": "free",
      "tags": [
        "Jazz",
        "avante garde",
        "free jazz",
        "improvisation",
        "New York"
      ],
      "item_id": 3147141628,
      "datePublished": "28 Jan 2024 00:00:00 GMT",
      "about": "The earliest jazz musicians were often highly suspicious of recording technology. Why spend all those lonely hours, they reasoned, burnishing a tone, only to have it reduced to sonic slush and fat-frying crackle by acoustic recording? Others like trumpeter Freddie Keppard more pragmatically feared that recording did little more than issue an invitation to others to steal his licks. Others yet saw the recording industry as a greedy Moloch.\n\nTechnology improved, imitation became a more sincere form of flattery, the industry came to realize that not all jazz musicians were innocent lambs-to-slaughter. But still the nature and implications of recording remained part of the existential – maybe even ontological – drama of a music that was supposed to be created in the moment and which dispersed at the close of its occasion: “gone in the air” as Eric Dolphy famously put it. It’s a faintly unpalatable truth that for perhaps a majority of its admirers, the history of jazz is the history of jazz recording. During the LP era, except perhaps on those labels that espoused a by-the-yard philosophy of repertory recording, making an album was a considerable undertaking and a very definite and visible outcrop in your personal musical landscape. Chick Corea once explained to me how initially reluctant he had been to “rush” into recording, how important it felt to get everything right, and how dismayed he was that barely schooled tyros were now hurrying into print before they had found anything much to say. \n\nAt the receiving end, it was hard to disagree, but also rather discomfiting to think that one’s sense of a musician’s work and progress was like the discovery of a small archipelago – some islands small and insignificant, others larger and potentially historic – in a vast, unplumbable ocean. As time went by, and recording technology further evolved, at both ends of the process, one became drawn to so-called completism, the inclusion of “alternate” takes, false starts, breakdowns, the squawk of a producer calling for one more, chatter and discord among the musicians. In much the same way as revisionist literary history was stripping Shakespeare of his unreachable mastery and relegating him to the wider history of Elizabeth and Jacobean drama, with all its vulgarity and violence, the idea of the five-star, masterpiece, career-defining album was giving way to a more horizontal and notionally democratic conception of “the work”. The box set preserving every rescuable note of a club residency became a new paradigm and industry staple. Obscurity – Webster and Ford and Middleton and Rowley, rather than Shakespeare – was valorized.\n\nWith the CD, which we naively thought was the apex medium – it became possible to squeeze a tremendous amount of music into a small and relatively durable space, though we soon began to find them scraped along the floor and unplayable, or retasked as drinks coasters. The physical size even of an ambitious collection shrank dramatically, but so too did something of our scale of respect for recorded music.\n\nNow everything has changed again. The CD has been transvalued into just another cluttering, polluting technology, its aesthetic unloveliness no longer countered by convenience. The internet carries vast amounts of music global distances in the mere flicker of an eye, and something fundamental has changed in our attitudes to music. The great saxophonist David Murray was once asked how it felt to be having his CDs issued in batches of three by a supportive Japanese label. Not too testily he pointed out that even these represented only the tiniest fraction of the music he was making at the time, a salutary lesson.\n\nI have no idea how much of Ivo Perelman’s music I have in my notional possession: that would mean on compact disc, a few tapes, a great deal stored on one hard drive or another. He is by the standards of a past age vastly prolific but also strongly defined by the creative relationships he has formed over the years, and particularly now the partnership with Barry Guy and Ramón López. But assessing Perelman’s work, or even simply appreciating it without any critical intent, involves getting rid of any thought of “productivity”. We are (finally, though maybe too late to make a difference) entering a post-industrial age, certainly in culture if not in the industries which produce the biggest smoke plumes and effluent. It makes no sense to talk about product any more or to conceive of an artist’s work as an island group of “masterpieces” and surrounding “transitional”, “consolidating” or experimentally unsuccessful outliers. We are finally able, in a way David Murray perhaps hinted at, to tap into not a body of music, but a process of music-making.\n\nBarry Guy has his own unique perspective on this. I first heard him on a record called Prayer For Peace by the improvising trio Amalgam, and then, a matter of days or it might have been weeks later, playing at a small venue in London. I don’t recall his collaborators on the latter occasion, but what I do recall with absolute vividness is the impression that the very first notes he played then, on disc and in person, were part of a continuous chain of sound that has continued unbroken to the present day. This might sound like some kind of Mucho Maas aural paranoia, but it’s a strong and unbreakable conviction that has carried me through Guy’s music from Amalgam to the London Jazz Composers Orchestra to Baroque material with his wife Maya Homburger, to his illuminating work with the Glasgow Improvisers Orchestra and his explorations of the neglected common ground between improvised music and the (mostly abstract) visual arts.\n\nA very definite way-station in that long continuum is a record Guy made just a few years ago, before the world succumbed to the hysteria of a new Masque of the Red Death. It was an album called Sidereus Nuncius – The Starry Messenger on which his playing partner was the drummer and percussionist Ramón López. The title comes from a pamphlet written by Galileo Galilei in the humanist Neo-Latin favoured by scientific writers in the fifteenth to seventeenth centuries. The development of the telescope had allowed observers to view ten times as many stars as previously, as well as planetary moons, nebulae and other cosmic phenomena. The analogy with the present boom in recording accessibility hardly needs to be stated.\n\nWhat made finding the record doubly exciting was that it was a duo performance by Guy and Ramón López, another artist for whom I nurse the conviction that everything he plays is part of a continuous performance begun long ago and sustained to the present. I can only reliably date that feeling to a record called Eleven Drums Songs, which I believe to be now twenty five years old (though I swear I have an earlier disc with a saxophonist called Cotinaud, though there are gaps on the shelf in both the places it might be filed).\n\nIn part, some will argue, this impression of a continuity of performance is simply a function of recognition. It is, perhaps, easier for saxophone players than for bassists and drummers to have or develop an instantly recognisable “voice” on the instrument. It was once semi-seriously proposed that a British saxophone player who had lost his passport might prove his identity simply by playing a couple of phrases; regrettably, the border authorities were not jazzophiles. But I think it’s more than this. If music-making, indeed creative process, makes sense at all, then it is not as a series of works but at worst as episodes in the history of work. If the creative process is not a singular thing, then it is merely dabbling and our over-emphasis on originality and change (or development, if you’re a critic) is seriously misplaced.\n\nThe music of Ivo Perelman now resembles a vast multi-tier opera, with more functional recitative passage, grand transitional musics and outstandingly beautiful arias. It would be redundant, and inconsistent given what has already been said, to pick out individual tracks in the work you will hear here. It is part of an unfolding narrative, and still more excitingly, a confluence of three continuous musics, each part of which has a fractal relationship to the whole. At the opposite extreme of the telescope – which has since, via Hubble and James Webb, delivered previously unimaginable multiplications of the visual field and its temporal component – there is the microscope. Take this music as a whole as best you can, though we exist in a permanent skirmish with the clock (arguably the third paradigm-changing technology of the Renaissance), but also delve down deep into every moment of it. Be unafraid of scrolling back and confirming that, yes, they did just play that phrase in perfect synchronisation or that for a moment they seem to be moving apart at warp speed. These are all part of the experience, and it is, I promise, a profound and deeply satisfying one.",
      "credits": "released January 28, 2024\n            \n            Ivo Perelman, tenor sax\n\nBarry Guy, bass\n\nRamon Lopez, drums, tabla\n\n\n\nRecorded in Paris, France, 2017 by Sylvain Thévenard\n\nLiner notes by Brian Morton\n\nCover artwork by Ramon Lopez",
      "license": "all rights reserved",
      "coverUrl_0": "https://f4.bcbits.com/img/a3530082209_0",
      "trackinfo": [
        {
          "title": "Part 1 - Track 1",
          "duration": "05:38",
          "lyrics": null
        },
        {
          "title": "Part 1 - Track 2",
          "duration": "07:00",
          "lyrics": null
        },
        {
          "title": "Part 1 - Track 3",
          "duration": "09:29",
          "lyrics": null
        },
        {
          "title": "Part 1 - Track 4",
          "duration": "08:18",
          "lyrics": null
        },
        {
          "title": "Part 1 - Track 5",
          "duration": "08:37",
          "lyrics": null
        },
        {
          "title": "Part 1 - Track 6",
          "duration": "10:15",
          "lyrics": null
        },
        {
          "title": "Part 1 - Track 7",
          "duration": "05:08",
          "lyrics": null
        },
        {
          "title": "Part 1 - Track 8",
          "duration": "06:05",
          "lyrics": null
        },
        {
          "title": "Part 1 - Track 9",
          "duration": "01:37",
          "lyrics": null
        },
        {
          "title": "Part 1 - Track 10",
          "duration": "05:36",
          "lyrics": null
        },
        {
          "title": "Part 1 - Track 11",
          "duration": "06:09",
          "lyrics": null
        },
        {
          "title": "Part 2 - Track 1",
          "duration": "07:32",
          "lyrics": null
        },
        {
          "title": "Part 2 - Track 2",
          "duration": "04:20",
          "lyrics": null
        },
        {
          "title": "Part 2 - Track 3",
          "duration": "02:45",
          "lyrics": null
        },
        {
          "title": "Part 2 - Track 4",
          "duration": "06:16",
          "lyrics": null
        },
        {
          "title": "Part 2 - Track 5",
          "duration": "06:16",
          "lyrics": null
        },
        {
          "title": "Part 2 - Track 6",
          "duration": "09:15",
          "lyrics": null
        },
        {
          "title": "Part 2 - Track 7",
          "duration": "04:21",
          "lyrics": null
        },
        {
          "title": "Part 2 - Track 8",
          "duration": "07:16",
          "lyrics": null
        },
        {
          "title": "Part 2 - Track 9",
          "duration": "07:17",
          "lyrics": null
        }
      ]
    }
  ]
}