{
    "Bell Witch": [
        {
            "url": "https://bellwitch.bandcamp.com/album/bell-witch-demo-2011",
            "title": "Bell Witch Demo 2011",
            "artist": "Bell Witch",
            "label": null,
            "classification": "paid",
            "tags": [
                "Bell Witch",
                "Bell Witch Seattle",
                "Doom",
                "Doom Metal",
                "Epic",
                "Funeral Doom",
                "Metal",
                "Seattle Doom",
                "death doom",
                "Seattle"
            ],
            "item_id": 1073571930,
            "art_id": 4233493545,
            "is_preorder": false,
            "datePublished": "03 Oct 2011 00:00:00 GMT",
            "about": null,
            "credits": "released October 3, 2011\nAdrian Guerra - Drums/Vocals\nDylan Desmond - Bass/Vocals\nRecorded at Airport Grocery Studios in Seattle, WA by Brandon Fitzsimons & Mastered by Chris Hanzsek.",
            "license": "all rights reserved",
            "coverUrl_0": "https://f4.bcbits.com/img/a4233493545_0",
            "trackinfo": [
                {
                    "title": "Beneath the Mask",
                    "duration": "03:51",
                    "lyrics": null,
                    "label": null,
                    "track_id": 1088495166,
                    "track_num": "1",
                    "artist": "Bell Witch",
                    "url": "https://bellwitch.bandcamp.com/track/beneath-the-mask",
                    "trackCoverUrl_0": "https://f4.bcbits.com/img/a0698502661_0",
                    "art_id": 698502661,
                    "about": null,
                    "credits": "from Bell Witch Demo 2011, track released October 3, 2011\nAdrian Guerra - Drums/Vocals\nDylan Desmond - Bass/Vocals",
                    "license": "all rights reserved"
                },
                {
                    "title": "I Wait",
                    "duration": "11:39",
                    "lyrics": null,
                    "label": null,
                    "track_id": 3383881419,
                    "track_num": "2",
                    "artist": "Bell Witch",
                    "url": "https://bellwitch.bandcamp.com/track/i-wait",
                    "trackCoverUrl_0": "https://f4.bcbits.com/img/a1028335951_0",
                    "art_id": 1028335951,
                    "about": null,
                    "credits": "from Bell Witch Demo 2011, track released October 3, 2011\nAdrian Guerra - Drums/Vocals\nDylan Desmond - Bass/Vocals",
                    "license": "all rights reserved"
                },
                {
                    "title": "Mayknow",
                    "duration": "18:31",
                    "lyrics": null,
                    "label": null,
                    "track_id": 2646568476,
                    "track_num": "3",
                    "artist": "Bell Witch",
                    "url": "https://bellwitch.bandcamp.com/track/mayknow",
                    "trackCoverUrl_0": "https://f4.bcbits.com/img/a0057973239_0",
                    "art_id": 57973239,
                    "about": null,
                    "credits": "from Bell Witch Demo 2011, track released October 3, 2011\nAdrian Guerra - Drums/Vocals\nDylan Desmond - Bass/Vocals",
                    "license": "all rights reserved"
                },
                {
                    "title": "The Moment",
                    "duration": "03:06",
                    "lyrics": null,
                    "label": null,
                    "track_id": 3076727882,
                    "track_num": "4",
                    "artist": "Bell Witch",
                    "url": "https://bellwitch.bandcamp.com/track/the-moment",
                    "trackCoverUrl_0": "https://f4.bcbits.com/img/a3471833648_0",
                    "art_id": 3471833648,
                    "about": null,
                    "credits": "from Bell Witch Demo 2011, track released October 3, 2011\nAdrian Guerra - Drums/Vocals\nDylan Desmond - Bass/Vocals",
                    "license": "all rights reserved"
                }
            ]
        },
        {
            "url": "https://bellwitch.bandcamp.com/album/four-phantoms",
            "title": "Four Phantoms",
            "artist": "BELL WITCH",
            "label": null,
            "classification": "paid",
            "tags": [
                "Doom",
                "Epic",
                "Funeral Doom",
                "Metal",
                "death doom",
                "Seattle"
            ],
            "item_id": 343477112,
            "art_id": 366278249,
            "is_preorder": false,
            "datePublished": "28 Apr 2015 00:00:00 GMT",
            "about": null,
            "credits": "released April 28, 2015\nRecorded and mixed by Billy Anderson at Type Foundry and Everything HZ\nMastered by Brad Boatright at Audiosiege",
            "license": "all rights reserved",
            "coverUrl_0": "https://f4.bcbits.com/img/a0366278249_0",
            "trackinfo": [
                {
                    "title": "Suffocation, A Burial: I - Awoken (Breathing Teeth)",
                    "duration": "22:29",
                    "lyrics": null,
                    "label": null,
                    "track_id": 756346089,
                    "track_num": "1",
                    "artist": "BELL WITCH",
                    "url": "https://bellwitch.bandcamp.com/track/suffocation-a-burial-i-awoken-breathing-teeth",
                    "trackCoverUrl_0": "https://f4.bcbits.com/img/a0366278249_0",
                    "art_id": 366278249,
                    "about": null,
                    "credits": "from Four Phantoms, released April 28, 2015",
                    "license": "all rights reserved"
                },
                {
                    "title": "Judgement, In Fire: I – Garden (Of Blooming Ash)",
                    "duration": "10:18",
                    "lyrics": null,
                    "label": null,
                    "track_id": 997463056,
                    "track_num": "2",
                    "artist": "BELL WITCH",
                    "url": "https://bellwitch.bandcamp.com/track/judgement-in-fire-i-garden-of-blooming-ash",
                    "trackCoverUrl_0": "https://f4.bcbits.com/img/a0366278249_0",
                    "art_id": 366278249,
                    "about": null,
                    "credits": "from Four Phantoms, released April 28, 2015",
                    "license": "all rights reserved"
                },
                {
                    "title": "Suffocation, A Drowning: II - Somniloquy (The Distance Of Forever)",
                    "duration": "22:55",
                    "lyrics": null,
                    "label": null,
                    "track_id": 2631996698,
                    "track_num": "3",
                    "artist": "BELL WITCH",
                    "url": "https://bellwitch.bandcamp.com/track/suffocation-a-drowning-ii-somniloquy-the-distance-of-forever",
                    "trackCoverUrl_0": "https://f4.bcbits.com/img/a0366278249_0",
                    "art_id": 366278249,
                    "about": null,
                    "credits": "from Four Phantoms, released April 28, 2015",
                    "license": "all rights reserved"
                },
                {
                    "title": "Judgement, In Air: II – Felled (In Howling Wind)",
                    "duration": "10:45",
                    "lyrics": null,
                    "label": null,
                    "track_id": 526583568,
                    "track_num": "4",
                    "artist": "BELL WITCH",
                    "url": "https://bellwitch.bandcamp.com/track/judgement-in-air-ii-felled-in-howling-wind",
                    "trackCoverUrl_0": "https://f4.bcbits.com/img/a0366278249_0",
                    "art_id": 366278249,
                    "about": null,
                    "credits": "from Four Phantoms, released April 28, 2015",
                    "license": "all rights reserved"
                }
            ]
        },
        {
            "url": "https://bellwitch.bandcamp.com/album/futures-shadow-part-1-the-clandestine-gate",
            "title": "Future's Shadow Part 1: The Clandestine Gate",
            "artist": "BELL WITCH",
            "label": "Profound Lore Records",
            "classification": "paid",
            "tags": [
                "Doom",
                "Epic",
                "Funeral Doom",
                "Metal",
                "death doom",
                "Seattle"
            ],
            "item_id": 1526890885,
            "art_id": 239684796,
            "is_preorder": false,
            "datePublished": "21 Apr 2023 00:00:00 GMT",
            "about": "Nothing's bigger than life. All vastnesses -- expanding space, infinite time -- crouch inside of consciousness. On a historical scale, to say nothing of a cosmic one, the individual human life vanishes, and yet it's the only aperture any of us get into reality. It's barely there, and it's all there is.\nThat's the paradox Bell Witch drives at. For more than a decade, the Pacific Northwestern doom metal band has sent tides surging over the seawalls of the song form, unravelling conventional expectations about the ways music stations itself in time to absorb a listener's attention. Rather than seek catharsis, the duo's songs heave themselves through time at a glacial pace, staving off resolution in favor of a trancelike capsule eternity. Invoking both boundlessness and claustrophobia in the same charged gesture, Bell Witch cultivates a sense of time outside of time, an oasis inside an increasingly frenetic media culture.\nFor their new album, The Clandestine Gate, bassist/vocalist Dylan Desmond and drummer/vocalist Jesse Shreibman exploded Bell Witch's bounds. Like 2017's lauded Mirror Reaper, The Clandestine Gate is a single 83-minute track -- a composition that pulses and breathes on a filmic timeframe. It constitutes the first chapter in a planned triptych of longform albums, collectively called Future's Shadow. \"Eventually, the end of the last album will be looped around to the first to make a circle,\" says Desmond. \"It can be continuously looped, like a day cycle. This would be dawn. The next one would be noon. The following one would be sundown, with dawn and sundown both having something of night.\"\nBell Witch began tracing the sequences that would form Future's Shadow in live performance while on tour with Neurosis and Mono. At first, Shreibman and Desmond planned to release each chapter in the sequence as they completed it, touring each album in between. Then, in early 2020, pandemic restrictions forced them to step back from that timeline. Locked out of their rehearsal space, they worked on what would become The Clandestine Gate at a slower burn than any of their previous projects. The album germinated over the course of more than two years, a pace that allowed their music to evolve organically to a state of more focused, grounded minimalism.\nWhile traces of organ and synthesizer hovered over Mirror Reaper and Bell Witch's 2020 collaboration with Aerial Ruin, Stygian Bough Volume 1, The Clandestine Gate drew those instruments closer to the center of its compositions. \"We started experimenting with letting more of the elements shine on their own,\" says Shreibman. The band reunited with their longtime producer Billy Anderson as they began negotiating these new compositional weights. The record begins with an eight-minute organ passage that builds slowly, like the susurrations of dawn, before Desmond's distortion-choked bass cleaves it open. Throughout their new material, Shreibman and Desmond also took the opportunity to implement new vocal strategies. \"I wanted the vocals to be more active, rather than being on top of the soundscape,\" notes Shreibman. On The Clandestine Gate, Bell Witch's twinned voices build off of the chantlike textures of previous records while steering toward more developed melodic lines, structured harmonies, and rhythmic death metal growls.\nThe expansive scale of Future's Shadow gave Bell Witch more leeway to plumb themes that have long percolated throughout their work. The concept of eternal return -- that time doesn't end and death doesn't punctuate life, but both go on forever in an infinite loop no one can remember -- inflected the development of The Clandestine Gate after Desmond encountered the idea in Nietzche's book The Gay Science. \"I read the eternal return concept and was like, 'oh, yeah, all of our songs have been about this all the while,\" Desmond says. \"Anything could be applied to a cyclical point of view. The sun comes up every morning. Spring comes every year, winter comes every year. Everything has a cycle: a life, a death, an existence, a non-existence.\"\nThe films of 20th century Russian director Andrei Tarkovsky similarly supplied a framework for the movements of The Clandestine Gate and Future's Shadow as a whole. Tarkovsky's movies creep glacially, powered by the performances of his actors, which imbue his weathered landscapes with a tumultuous interiority. Simple actions -- carrying a candle across a room, tossing a metal nut into an overgrown field -- carry life-and-death weight, a strategy echoed in Bell Witch's suspension of minimal melodies across planetary expanses. \"Tarkovsky's intention of poetry through visuals has a strong parallel to ours through sound,\" notes Desmond. \"His drawn-out scenes are similar in execution to what we're doing musically, and his films are a big inspiration for this album and triptych.\"\nThe immense gravity of a work like The Clandestine Gate allows these ideas to simmer in a way that feels profoundly and somatically intuitive -- not just a philosophical exercise, but an embodied truth. By slowing down both their creative process and the tempo of the music itself, Bell Witch digs even deeper into their long standing focus: the way life spills on inside its minuscule container, both eternal and fleeting, a chord that echoes without resolution. As both the beginning and end of the Future's Shadow triptych, The Clandestine Gate opens a new chapter in Bell Witch's macroscopic minimalism: the start of a yawning orbit around an increasingly massive core.",
            "credits": "released April 21, 2023\nEngine-Eared by Billy Anderson at Avast Recording Studios.\nMixed by Billy Anderson at Flora.\nMastered by Justin Weis at Traxworx.\nArtwork/Cover Painting by Jordi Diaz Alamà.\nDesign/layout by Chimere Noire.",
            "license": "all rights reserved",
            "coverUrl_0": "https://f4.bcbits.com/img/a0239684796_0",
            "trackinfo": [
                {
                    "title": "The Clandestine Gate",
                    "duration": "01:23:15",
                    "lyrics": "Reflected whisper of me, a drowned ruse Shallow dug in a pulsing maze Deafened foe I see- glowing in a labyrinth of waves The aired specter, deception of the light  That I follow   Sculpted emptiness of all things Held in shade, cast by the spark  Returning veil Hollow specter bleeding on the dark, The fleeting breath in the returning light That I follow Incessant wheel of Time, Dawn’s bodies Formless waves frozen in night Immutable eyes Stare infinite and squander sight Gaze backwards but the waxing light, That I follow The moment’s hands eluded by that which time astrays  Scorch the flames of tomorrows to ashes by today, A lifetime’s shadow Under wingless wind to flight, unborn memory array  That echoes in forever, decay bloomed of the light That I follow The greatest weight, the breathed wind blown gone What innumerable shudders of the recurring past Open ahead What matter of a flown moment shall spread last In blooming decay under the climbing light That I follow  The greatest weight, this recurring dawn The greatest weight, falling glass the rising gate Of a sightless phantom, Sullen butcher, the fleeing horizon that forever escapes Crashing wave of chariots, arrows of the light That I follow  The moment, if ascent from the sinking blindness Would remove the barbs from their hold Emerging spring A phantom forest rises in the dawn’s cold  Bleeding wounds pulse in the light That I follow If water could stand, prehensive stone sea An arrow loosed at forever will soon crash As blind waves Climbing rain light throned, the wind shuts Ten thousand gates- mirrored graves of dawn Blinded foe I hear- in walls ravens lead upon Beneath the warless chariot of blinding light That I follow Unhallowed ubiquitous grasp Hold everything to the light That I follow  Dawn shrouding the void to pass That when daylight comes- arrows of birth loose  And Death rains In the imbrued dawn of springs wound Worms pulse the breathless veins  Of permeation’s throne Below and above the mountains reign Enfleshing the spineless ribs of light That I follow No- but striking life, dawns phantom truth Climbing to darkness shedding the light That I follow Death’s waking crown a blinding shore Breaking waves reaching above The beginning Of the end of night it grew of Stone organ, purging in the light That I follow Purging storm, clandestine gate, the glare escapes Carving mountains, pulsing gale, the light reappears The world’s worn  Skin pile folds, in the distance birth nears In sinking blackness under waves of light That I follow An edge above time, heaven’s spire The precipitous tip of Death’s sight, soon Still air, unshadow the miser stone, Time, wind into the world of dust  Falling, climbing Hold untouched a fleeting breath’s cusp Of recurring eternity, the rising light That I follow  (Tooth of predation) The Down-stroking rapacious eye of doom In the diadem of waves through the light That I follow",
                    "label": "Profound Lore Records",
                    "track_id": 3183962452,
                    "track_num": "1",
                    "artist": "BELL WITCH",
                    "url": "https://bellwitch.bandcamp.com/track/the-clandestine-gate",
                    "trackCoverUrl_0": "https://f4.bcbits.com/img/a0239684796_0",
                    "art_id": 239684796,
                    "about": null,
                    "credits": "from Future's Shadow Part 1: The Clandestine Gate, released April 21, 2023",
                    "license": "all rights reserved"
                }
            ]
        },
        {
            "url": "https://bellwitch.bandcamp.com/album/longing-4",
            "title": "Longing",
            "artist": "Bell Witch",
            "label": null,
            "classification": "paid",
            "tags": [
                "Doom",
                "Epic",
                "Funeral Doom",
                "Metal",
                "Profound Lore Records",
                "death doom",
                "Seattle"
            ],
            "item_id": 1075688922,
            "art_id": 3544015860,
            "is_preorder": false,
            "datePublished": "13 Nov 2012 00:00:00 GMT",
            "about": null,
            "credits": "released November 13, 2012\nAll songs written by Bell Witch\nAdrian Guerra - Drums/Vocals\nDylan Desmond - Bass/Vocals\nGuest Musicians:\nErik Moggridge - Vocals on \"Rows (Of Endless Waves)\"\nRecorded at Soundhouse Studios in Seattle, WA May 2012 by Brandon Fitzsimons & Mastered by Chris Hanzsek.",
            "license": "all rights reserved",
            "coverUrl_0": "https://f4.bcbits.com/img/a3544015860_0",
            "trackinfo": [
                {
                    "title": "Bails (Of Flesh)",
                    "duration": "21:17",
                    "lyrics": null,
                    "label": null,
                    "track_id": 526721817,
                    "track_num": "1",
                    "artist": "Bell Witch",
                    "url": "https://bellwitch.bandcamp.com/track/bails-of-flesh",
                    "trackCoverUrl_0": "https://f4.bcbits.com/img/a3544015860_0",
                    "art_id": 3544015860,
                    "about": null,
                    "credits": "from Longing, released November 13, 2012",
                    "license": "all rights reserved"
                },
                {
                    "title": "Rows (Of Endless Waves)",
                    "duration": "14:23",
                    "lyrics": null,
                    "label": null,
                    "track_id": 962747711,
                    "track_num": "2",
                    "artist": "Bell Witch",
                    "url": "https://bellwitch.bandcamp.com/track/rows-of-endless-waves",
                    "trackCoverUrl_0": "https://f4.bcbits.com/img/a3544015860_0",
                    "art_id": 3544015860,
                    "about": null,
                    "credits": "from Longing, released November 13, 2012",
                    "license": "all rights reserved"
                },
                {
                    "title": "Longing (The River Of Ash)",
                    "duration": "12:13",
                    "lyrics": null,
                    "label": null,
                    "track_id": 3739442415,
                    "track_num": "3",
                    "artist": "Bell Witch",
                    "url": "https://bellwitch.bandcamp.com/track/longing-the-river-of-ash",
                    "trackCoverUrl_0": "https://f4.bcbits.com/img/a3544015860_0",
                    "art_id": 3544015860,
                    "about": null,
                    "credits": "from Longing, released November 13, 2012",
                    "license": "all rights reserved"
                },
                {
                    "title": "Beneath The Mask",
                    "duration": "06:17",
                    "lyrics": null,
                    "label": null,
                    "track_id": 567485132,
                    "track_num": "4",
                    "artist": "Bell Witch",
                    "url": "https://bellwitch.bandcamp.com/track/beneath-the-mask-2",
                    "trackCoverUrl_0": "https://f4.bcbits.com/img/a3544015860_0",
                    "art_id": 3544015860,
                    "about": null,
                    "credits": "from Longing, released November 13, 2012",
                    "license": "all rights reserved"
                },
                {
                    "title": "I Wait",
                    "duration": "12:49",
                    "lyrics": null,
                    "label": null,
                    "track_id": 2146155211,
                    "track_num": "5",
                    "artist": "Bell Witch",
                    "url": "https://bellwitch.bandcamp.com/track/i-wait-2",
                    "trackCoverUrl_0": "https://f4.bcbits.com/img/a3544015860_0",
                    "art_id": 3544015860,
                    "about": null,
                    "credits": "from Longing, released November 13, 2012",
                    "license": "all rights reserved"
                },
                {
                    "title": "Outro",
                    "duration": "03:48",
                    "lyrics": null,
                    "label": null,
                    "track_id": 533353490,
                    "track_num": "6",
                    "artist": "Bell Witch",
                    "url": "https://bellwitch.bandcamp.com/track/outro",
                    "trackCoverUrl_0": "https://f4.bcbits.com/img/a3544015860_0",
                    "art_id": 3544015860,
                    "about": null,
                    "credits": "from Longing, released November 13, 2012",
                    "license": "all rights reserved"
                }
            ]
        },
        {
            "url": "https://bellwitch.bandcamp.com/album/mirror-reaper",
            "title": "Mirror Reaper",
            "artist": "Bell Witch",
            "label": "Profound Lore Records",
            "classification": "paid",
            "tags": [
                "Doom",
                "Epic",
                "Funeral Doom",
                "Metal",
                "death doom",
                "Seattle"
            ],
            "item_id": 4165913683,
            "art_id": 2573679411,
            "is_preorder": false,
            "datePublished": "20 Oct 2017 00:00:00 GMT",
            "about": "With their third full-length album, “Mirror Reaper,” Seattle’s doom metal duo BELL WITCH have created a truly enormous work – one continuous 83-minute piece unfolding as a single track. The album will be released on October 20th by Profound Lore Records.\nEngineered and mixed by veteran producer Billy Anderson (Swans, Sleep, Neurosis), the duo of Dylan Desmond (bass, vocals) and Jesse Shreibman (drums, vocals, organ) have pushed the band’s sound further than it’s ever gone before. While retaining the monolithic heaviness of their previous releases, “Mirror Reaper” sees the band explore the more meditative, melancholy, and introspective aspects to their sound through the introduction of long, lonely organ passages and the return of honorary BELL WITCH member, vocalist Erik Moggridge (Aerial Ruin), offering a prominent presence. The artwork for “Mirror Reaper” was painted by Mariusz Lewandowski respectively.\nFormed by Desmond and ex-drummer/vocalist Adrian Guerra, BELL WITCH released their first self-titled demo in 2011 and partnered with Profound Lore Records for their debut album, “Longing,” in 2012. The duo’s second LP, the acclaimed “Four Phantoms” (2015) was recognized as one of doom metal’s triumphs of the year. The band extensively toured in North America and Europe, securing notable festival appearances (Roadburn, Basilica Soundscape, Sled Island, Psycho CA).\nOn the themes surrounding the concept and lyrics of “Mirror Reaper” the band state:\n“The title ‘Mirror Reaper’ is indicative of the Hermetic axiom ‘As Above, So Below,’ written with two sides to form one whole. The song is both its own and its reflection, as an opposite is whole only with its contrary. Our focus as a band has always been the perception of ghosts and the implied archetype of the dichotomy of life/death therein. ‘Mirror Reaper’ is a continuation of that concept.\nDuring the writing process we were devastated by the loss of our dear friend and former drummer, Adrian Guerra. In love and respect to his memory, we reserved an important yet brief section in the song for him that features unused vocal tracks from our last album. This specific movement serves as a conceptual turn in the piece, or point of reflection. We believe he would be proud of it as well.\n‘Mirror Reaper’ was the first collaborative writing project with the new line up, and Adrian's death during it brought extra emotional weight. We sought to match the complexity and weight of these events within the composition of the piece.”",
            "credits": "released October 20, 2017\nBell Witch is\nDylan Desmond - bass, vocals\nJesse Shreibman - percussion, Hammond B3, vocals\nAdditional vocals and lyrics performed and written by Erik Moggridge\nProduced and Engine-Eared by Billy Anderson and Bell Witch\nRecorded at Hallowed Halls in Portland, Oregon\nMixed by Billy Anderson at Everything Hz in Portland, Oregon\nMastered by Justin Weis\nArtwork by Mariusz Lewandowski\nAlbum layout by C.N.\n“The Words of the Dead\" by Adrian Guerra",
            "license": "all rights reserved",
            "coverUrl_0": "https://f4.bcbits.com/img/a2573679411_0",
            "trackinfo": [
                {
                    "title": "Mirror Reaper",
                    "duration": "01:23:15",
                    "lyrics": null,
                    "label": "Profound Lore Records",
                    "track_id": 2929994288,
                    "track_num": "1",
                    "artist": "Bell Witch",
                    "url": "https://bellwitch.bandcamp.com/track/mirror-reaper",
                    "trackCoverUrl_0": "https://f4.bcbits.com/img/a2573679411_0",
                    "art_id": 2573679411,
                    "about": null,
                    "credits": "from Mirror Reaper, released October 20, 2017",
                    "license": "all rights reserved"
                }
            ]
        },
        {
            "url": "https://bellwitch.bandcamp.com/album/stygian-bough-volume-i",
            "title": "Stygian Bough Volume I",
            "artist": "BELL WITCH and AERIAL RUIN",
            "label": "Profound Lore Records",
            "classification": "paid",
            "tags": [
                "Doom",
                "Epic",
                "Funeral Doom",
                "Metal",
                "death doom",
                "Seattle"
            ],
            "item_id": 2700280678,
            "art_id": 339555290,
            "is_preorder": false,
            "datePublished": "26 Jun 2020 00:00:00 GMT",
            "about": "Genuine collaborations between two sets of artists are rare. For their new album, Stygian Bough Volume I, the members—Dylan Desmond (bass/vocals) and Jesse Shreibman (drums/vocals)—of doom duo Bell Witch didn’t just team up (again) with dark folk elegist Erik Moggridge (guitars/vocals) of Aerial Ruin, they fully integrated the two outfits. While Moggridge has been a part of Bell Witch’s sonic fingerprint on all their prior records, perhaps most notably for his vocals on their previous full-length, Mirror Reaper, he’s now part of the very fabric that makes up the five hauntingly beautiful, strikingly heavy songs that comprise Stygian Bough Volume I.\n“We started working on collaboration material together sometime in 2019,” says Bell Witch’s Dylan Desmond. “But there was writing going on as far back as 2018. The original approach was going to be doing a split record in which we each covered specific songs from each other’s catalog.”\n“It started in early 2018, I think,” Aerial Ruin’s Erik Moggridge adds. “By late autumn 2018, we were all three jamming and going through the ideas and writing lots of new ones. We then had to shift gears to rehearse for the Mirror Reaper (in its entirety) European tour in December 2018, but soon picked back up with writing in early 2019, which continued off and on right up until we entered the studio.”\nBell Witch and Aerial Ruin are officially a trio on Stygian Bough Volume I. The addition of guitar to the bass and drum-only dynamic came naturally as the threesome discussed potential models for their joint effort. Ulver’s unorthodox folk album Kveldssanger came up as did Candlemass' milemarker Nightfall. But the real fuel to Stygian Bough Volume I was the Bell Witch track, “Rows (of Endless Waves),\" which was not only Moggridge’s first appearance with Bell Witch but also a track that has deeply resonated with Desmond over the years. With the approach in place, Bell Witch and Aerial Ruin collectively wrote five desolate yet mystical songs that defy categorization. From the mournful \"The Bastard Wind\" and the crepuscular “Heaven Torn Low (the passage)” to the monstrous “Heaven Torn Low (the toll)” and the liturgical gloom of “The Unbodied Air,” Stygian Bough: Volume I is an album of deep, dark undertows and careful respite.\n“Bell Witch songs have always focused on the theme of the space between life and death,” reveals Desmond. “This approach lends itself to themes of duality and has absolutely shaped the concepts within Bell Witch. While I can’t speak for Aerial Ruin, I do think there is conceptual overlap between the two projects also. Aerial Ruin songs often mention a sort of empirical ‘veil’ or ‘lie’ in regards to perception or life, which I think is ever-present in much of the conceptual and lyrical ambiguity and insinuations Bell Witch works with also.\"\n“The duality of life and death is certainly important here,” Moggridge continues.\nLyrically, the themes explored by both Bell Witch and Aerial Ruin independently were tackled from different angles but were mainly from similar spaces. Whereas Bell Witch plumbed the depths of purgatory—a place of atonement between life and death—across three full-lengths, Moggridge’s Aerial Ruin have centered on the loss of the self and the spiritual places the vacancy ultimately leads to. For Stygian Bough Volume I, Bell Witch and Aerial Ruin topics of choice intersect and complement, continuing in spirit but with a broader vantage point where \"Rows (of Endless Waves)” left off.\n“Stygian Bough is a reference to the theme of The Golden Bough,” observes Desmond. “The book’s theme is centered on the rites of a temple in ancient Italy where slaves were transformed into kings by slaying he who reigned as such after successfully stealing the Golden Bough from the sacred tree within the temple. Within that notion, a different sort of slavery was brought upon the newly crowned king, as he must understand sooner or later that his fate would ultimately be the same as his predecessor. In short, the golden bough made a king out of a slave only to find they were now enslaved to a different sort of tyranny, always stalking them from the darkest shadows of their imagination. From this perspective, the \"golden bough\" is better understood as a deception casting darkness. Thus, Stygian Bough.”\nAdds Moggridge: “They presented that song [“Rows (of Endless Waves)”] to me in a mostly instrumental form with the idea that it's about a ghost trapped on rows of waves that can’t reach the land. I ran with this idea and started to think of the ghost of a king who, if he reached land could be reborn and rule again. The king is also a larger metaphor for humanity who rules over the planet and other species. On this new album our ghost upon the waves flees not towards the land but towards death. The narrative, as much as it exists, is loose and not linear and definitely stream of consciousness. There are cyclical and spherical qualities to the journey where death, desolation, and the spirit are reflected in myriad ways.”\nStygian Bough Volume I was recorded and mixed by Randall Dunn at Avast Recording Co. in Seattle. Bell Witch and Aerial Ruin then took the full-length to mastering ace Bob Weston at Chicago Mastering Service in Chicago. The result is a full-length of profound lows and delicate highs. The overall production fits Bell Witch and Aerial Ruin's quiet/introspective and heavy/loud dynamic well. One listen to \"Bastard Wind\" and instrumental piece \"Prelude,\" and it's easy to understand the trio's sonic preferences, which fall somewhere between Roy Harper, Bert Jansch, Warning, and Candlemass. As for the triumvirate's next steps, they're planning on touring in support of Stygian Bough – Volume I and eventually collaborating on music for Volume II.\n“We’re hoping to do another one of these collaboration albums in the coming years,” says Desmond. “I think the direction we’ve taken is well worth exploring further.”\n“We look forward to touring in support of this album,” Moggridge divulges. “Then, working on and eventually recording new material. New song ideas have already begun to grow…”",
            "credits": "released June 26, 2020\nErik Moggridge - lead vocals, guitar\nDylan Desmond - bass, vocals\nJesse Shreibman - drums and percussion, organ, piano, synthesizer, vocals\nProduced by Randall Dunn at Avast Recording Co.\nMastered by Bob Weston at Chicago Mastering Co.\nCover art by Adam Burke",
            "license": "all rights reserved",
            "coverUrl_0": "https://f4.bcbits.com/img/a0339555290_0",
            "trackinfo": [
                {
                    "title": "The Bastard Wind",
                    "duration": "19:08",
                    "lyrics": null,
                    "label": "Profound Lore Records",
                    "track_id": 1855340190,
                    "track_num": "1",
                    "artist": "BELL WITCH and AERIAL RUIN",
                    "url": "https://bellwitch.bandcamp.com/track/the-bastard-wind",
                    "trackCoverUrl_0": "https://f4.bcbits.com/img/a0339555290_0",
                    "art_id": 339555290,
                    "about": null,
                    "credits": "from Stygian Bough Volume I, released June 26, 2020",
                    "license": "all rights reserved"
                },
                {
                    "title": "Heaven Torn Low I (the passage)",
                    "duration": "12:54",
                    "lyrics": null,
                    "label": "Profound Lore Records",
                    "track_id": 302624677,
                    "track_num": "2",
                    "artist": "BELL WITCH and AERIAL RUIN",
                    "url": "https://bellwitch.bandcamp.com/track/heaven-torn-low-i-the-passage",
                    "trackCoverUrl_0": "https://f4.bcbits.com/img/a0339555290_0",
                    "art_id": 339555290,
                    "about": null,
                    "credits": "from Stygian Bough Volume I, released June 26, 2020",
                    "license": "all rights reserved"
                },
                {
                    "title": "Heaven Torn Low II (the toll)",
                    "duration": "08:31",
                    "lyrics": null,
                    "label": "Profound Lore Records",
                    "track_id": 1632655886,
                    "track_num": "3",
                    "artist": "BELL WITCH and AERIAL RUIN",
                    "url": "https://bellwitch.bandcamp.com/track/heaven-torn-low-ii-the-toll",
                    "trackCoverUrl_0": "https://f4.bcbits.com/img/a0339555290_0",
                    "art_id": 339555290,
                    "about": null,
                    "credits": "from Stygian Bough Volume I, released June 26, 2020",
                    "license": "all rights reserved"
                },
                {
                    "title": "Prelude",
                    "duration": "04:23",
                    "lyrics": null,
                    "label": "Profound Lore Records",
                    "track_id": 1820620163,
                    "track_num": "4",
                    "artist": "BELL WITCH and AERIAL RUIN",
                    "url": "https://bellwitch.bandcamp.com/track/prelude",
                    "trackCoverUrl_0": "https://f4.bcbits.com/img/a0339555290_0",
                    "art_id": 339555290,
                    "about": null,
                    "credits": "from Stygian Bough Volume I, released June 26, 2020",
                    "license": "all rights reserved"
                },
                {
                    "title": "The Unbodied Air",
                    "duration": "19:20",
                    "lyrics": null,
                    "label": "Profound Lore Records",
                    "track_id": 1528505538,
                    "track_num": "5",
                    "artist": "BELL WITCH and AERIAL RUIN",
                    "url": "https://bellwitch.bandcamp.com/track/the-unbodied-air",
                    "trackCoverUrl_0": "https://f4.bcbits.com/img/a0339555290_0",
                    "art_id": 339555290,
                    "about": null,
                    "credits": "from Stygian Bough Volume I, released June 26, 2020",
                    "license": "all rights reserved"
                }
            ]
        }
    ]
}