{
    "The Milieu Music Fan Club": [
        {
            "url": "https://milieumusicfanclub.bandcamp.com/album/alignment-lethargy",
            "title": "Alignment Lethargy",
            "artist": "Coppice Halifax",
            "label": "Milieu Music Digital",
            "classification": "paid",
            "tags": [
                "Electronic",
                "ambient",
                "ambient dub",
                "ambient electronic",
                "ambient techno",
                "analog",
                "braindance",
                "deep",
                "deep techno",
                "dub",
                "dub techno",
                "house",
                "idm",
                "minimal dub",
                "minimal techno",
                "techno",
                "Kettering"
            ],
            "item_id": 3147992323,
            "art_id": 389329151,
            "is_preorder": false,
            "datePublished": "29 Apr 2018 00:00:00 GMT",
            "about": "The second release in the Milieu Music Fan Club catalog, Alignment Lethargy, is a three-track Coppice Halifax EP that feels like a long lost Analog Botany installment. Composted from the salvaged remnants of a live set, broadcast to the Fan Club in 2017, which was riddled with recording errors and could not be released, Alignment Lethargy serves as an ample compromise with carefully selected loops and source textures from an analog hardware rig.\nThis EP was brought into existence via a community poll that was voted on by the members of the Fan Club. Without these wonderful people, this music would simply not exist! Thanks go to: Justin T / Burton T / William C / Brian C / Chris S / Levi G / Rich A / Joel B / Matthew D / Peter B / Rik J / Jose S / Jonathan W / Jim P / David T / Devin H / Mathieu L / Andy B / Francois H / Benoit P / Alex G / Daniel F / Gordon C / Alex S / Sean W / Alex B.\nTo get this EP, and also the COUNTRY LOW single, for free, become a member of the Milieu Music Fan Club at Patreon!  www.patreon.com/analogbotany",
            "credits": "released April 29, 2018\nW/P by Brian Grainger. Recorded at White Pillar Workshop, April 2018, using source material from a live broadcast from Winter 2017. Mastered by The Analog Botanist. Photograph by Brian, Dayton April 2018. This is Milieu Music number MMFC002, exclusive to the Milieu Music Fan Club community at Patreon.",
            "license": "all rights reserved",
            "coverUrl_0": "https://f4.bcbits.com/img/a0389329151_0",
            "trackinfo": [
                {
                    "title": "Lethargy II",
                    "duration": "08:55",
                    "lyrics": null,
                    "label": "Milieu Music Digital",
                    "track_id": 2040006401,
                    "track_num": "3",
                    "artist": "Coppice Halifax",
                    "url": "https://milieumusicfanclub.bandcamp.com/track/lethargy-ii",
                    "mp3url": "https://t4.bcbits.com/stream/8e54ff60f8a047d0f5fe5dfb4221dcdd/mp3-128/2040006401?p=0&ts=1753211363&t=5c71a8e416ffc78617b6da6401b0182d978208b0&token=1753211363_bd5ace4aece7cb0ee19b82b6443b97b2f73ee91b",
                    "trackCoverUrl_0": "https://f4.bcbits.com/img/a0389329151_0",
                    "art_id": 389329151,
                    "about": null,
                    "credits": "from Alignment Lethargy, released April 29, 2018",
                    "license": "all rights reserved"
                }
            ]
        },
        {
            "url": "https://milieumusicfanclub.bandcamp.com/album/echoplay",
            "title": "Echoplay",
            "artist": "Coppice Halifax",
            "label": "Milieu Music Digital",
            "classification": "paid",
            "tags": [
                "Electronic",
                "ambient",
                "ambient techno",
                "braindance",
                "deep",
                "deep house",
                "deep techno",
                "dub",
                "dub tech",
                "dub techno",
                "dubtech",
                "echospace",
                "idm",
                "minimal techno",
                "techno",
                "Kettering"
            ],
            "item_id": 2758262671,
            "art_id": 2196754926,
            "is_preorder": false,
            "datePublished": "11 Sep 2020 05:00:13 GMT",
            "about": "To celebrate the third anniversary of the Milieu Music Fan Club, still running strong at Patreon, I'm proud to issue this unearthed session undertaken in 2017 - a deep Halifaxian dub techno experience built using two Korg samplers and a number of elements and sound materials from Stephen Hitchell's superb Echospace Studio sound libraries. This album has remained underground, until now, where it lands with the blessing of Echospace [Detroit], without whose stellar contributions these recordings would not have been possible.\nSonically, these tracks recall other moments in the Halifaxian catalog, albums like Urceolatmospherion, Verdant Acre and Dripping Earth, among lots of other connections. Even though much of the tonal content and melodic information present on Echoplay are things that originated in Echospace, these pieces feel just as much at home with My Earths, my own aural fingerprints and DNA that bind together all of my work in ways I cannot always fully detect or explain. Perhaps then, this is evidence of the notion that Coppice Halifax records contain, as passengers, whether willing or unaware, all of the things and people and places that have helped to shape and inspire the recordings. If this is the case, I am more than content knowing I've migrated over beautiful minds like Stephen Hitchell's to my own maps and landscapes, although the far more likely reality is that he has been there the entire time.\nHopefully, all of this translates if you choose to be aware of it, and also hopefully, all of it becomes completely irrelevant should you choose to simply press play and let the music wash over you. Echoplay, for me, is much like many of the incredible and engrossing records I've listened to from Echospace - an escape path, a portal out of the fray and into somewhere new, not totally familiar, but comfortable, yielding and supportive, a warm blanket or a cozy chair or even the assuring arms of a loved one wrapped around you when the world outside becomes too much to bear. It is this sentiment that informed my need to give something back to my community of steadfast supporters at Patreon, who have been my safety net for three years now, and continue to support me even beyond that.\nThank you, to all of you. You're the best.\n**NOTE: If you'd like to own Echoplay or any of the other five Milieu Music Fan Club releases, all you need to do is join the Patreon as a paid supporter. Any amount will do, and of course larger amounts come with larger and cooler rewards, beyond even this. And don't be a dick and sign up for $1 just to grab these six albums and head for the door. Nobody likes that, and I happen to believe that kinda shit will come back to you. We all need to support each other in the artistic community, now perhaps more than ever, so if you enjoy my work and would like to connect, Patreon is perhaps the best way to do it!",
            "credits": "released September 11, 2020\nW/P by Brian Grainger. Recorded at White Pillar Workshop, 2017. Constructed using two Korg samplers and elements from the Echospace Studio sound libraries, recorded in Detroit by Stephen Hitchell. Mastered by The Analog Botanist. Photography and text by ABM&D. This is Milieu Music number MMFC-006, the 6th entry in the Milieu Music Fan Club catalog of exclusive recordings. Echoplay is issued with the kind permission from Echospace [Detroit]. Stephen Hitchell appears courtesy of Echospace [Detroit].\nechospacestudio.bandcamp.com/album/echospace-sounds-presents-echoes-in-space-4-2-gb-sound-library\nanalogbotany.com",
            "license": "all rights reserved",
            "coverUrl_0": "https://f4.bcbits.com/img/a2196754926_0",
            "trackinfo": [
                {
                    "title": "Echoplay [Botany]",
                    "duration": "14:12",
                    "lyrics": null,
                    "label": "Milieu Music Digital",
                    "track_id": 4159643201,
                    "track_num": "1",
                    "artist": "Coppice Halifax",
                    "url": "https://milieumusicfanclub.bandcamp.com/track/echoplay-botany",
                    "mp3url": "https://t4.bcbits.com/stream/796542246afd271b713ab7f1d4432068/mp3-128/4159643201?p=0&ts=1753211366&t=84a8791373c02b75baa65fec3f4c51f25b15bb1b&token=1753211366_01c274655a54be9c2556d2bfd6e2020487c23190",
                    "trackCoverUrl_0": "https://f4.bcbits.com/img/a2196754926_0",
                    "art_id": 2196754926,
                    "about": null,
                    "credits": "from Echoplay, released September 11, 2020",
                    "license": "all rights reserved"
                }
            ]
        },
        {
            "url": "https://milieumusicfanclub.bandcamp.com/album/black-mountain-log",
            "title": "Black Mountain Log",
            "artist": "Milieu",
            "label": "Milieu Music Digital",
            "classification": "paid",
            "tags": [
                "3ds",
                "Electronic",
                "ambient",
                "ambient electronic",
                "ambient techno",
                "analog",
                "braindance",
                "dub techno",
                "electro",
                "idm",
                "korg",
                "nintendo 3ds",
                "techno",
                "Kettering"
            ],
            "item_id": 4092444632,
            "art_id": 2273134366,
            "is_preorder": false,
            "datePublished": "25 Sep 2018 00:00:00 GMT",
            "about": "A Milieu EP created and released in celebration of the first anniversary of the Milieu Music Fan Club! Three tracks, the first two created using only sounds and sequences from the Korg DS-10 cartridge on the Nintendo 3DS handheld gaming system, with the third track being plucked from the Milieu Music archives and dusted off - a melodic improvisation on the Arturia Microbrute and Korg Volca Bass from January 2016, which bears some resemblance to the recent Zelda-themed Milieu album, and probably also Statuettes.\nWhile recording the EP, memories of Autumn were conjured up, specifically October 2015, when I brought my wife, my daughter and one of my best friends to a log cabin in Black Mountain, North Carolina, to get away from the flooding and hurricane weather in Columbia at the time, and also to see Autechre perform in Asheville. It was a wonderful break from the craziness and I have wanted to go back ever since. This EP is the closest I can manage, in the meantime.\nTo get this EP, and also COUNTRY LOW and ALIGNMENT LETHARGY, for free, become a member of the Milieu Music Fan Club at Patreon!  www.patreon.com/analogbotany",
            "credits": "released September 25, 2018\nW/P by Brian Grainger. Recorded at White Pillar Workshop, September 2018 (#1-2) using sounds and sequences made with a Korg DS-10 cartridge in a Nintendo 3DS handheld gaming system, and at Botany Bay (#3) January 2016 using the Arturia Microbrute and Korg Volca Bass monophonic analog synthesizers. Photograph taken by Brian, Black Mountain NC, October 2015. This is Milieu Music number MMFC003.\nHugs and gracious thanks go to the members of the Milieu Music Fan Club, who at the present moment are: Alan A, Alex B, Andy B, Alex K, Benoit P, Brian C, Brian H, Burton T, Chris S, Daniel F, David T, Devin H, Gordon C, Francois H, Jim P, Joel B, Jonathan W, Jose S, Levi G, Mathieu L, Matthew F, Peter T, Peter B, Pierre P, Rich A, Rik J, Sean W, Seth B, Tony S, Alex G, Sam P, Peter C",
            "license": "all rights reserved",
            "coverUrl_0": "https://f4.bcbits.com/img/a2273134366_0",
            "trackinfo": [
                {
                    "title": "Black Mountain Log",
                    "duration": "08:27",
                    "lyrics": null,
                    "label": "Milieu Music Digital",
                    "track_id": 2683981411,
                    "track_num": "1",
                    "artist": "Milieu",
                    "url": "https://milieumusicfanclub.bandcamp.com/track/black-mountain-log",
                    "mp3url": "https://t4.bcbits.com/stream/5b5fbe92cb23907c2c9a5f13974b0aae/mp3-128/2683981411?p=0&ts=1753211368&t=9ba18f90c161451052ba4de5e02c69cfc64c5bb0&token=1753211368_cd53444d66202f6e7ffeabdece2646de34d830aa",
                    "trackCoverUrl_0": "https://f4.bcbits.com/img/a2273134366_0",
                    "art_id": 2273134366,
                    "about": null,
                    "credits": "from Black Mountain Log, released September 25, 2018",
                    "license": "all rights reserved"
                }
            ]
        },
        {
            "url": "https://milieumusicfanclub.bandcamp.com/album/the-cartridge-readers-travelogue",
            "title": "The Cartridge Reader's Travelogue",
            "artist": "Milieu",
            "label": "Milieu Music Digital",
            "classification": "paid",
            "tags": [
                "Electronic",
                "acid",
                "ambient",
                "ambient electronic",
                "ambient techno",
                "braindance",
                "dub techno",
                "electro",
                "electronica",
                "idm",
                "korg",
                "nintendo",
                "techno",
                "Kettering"
            ],
            "item_id": 350651573,
            "art_id": 1251589879,
            "is_preorder": false,
            "datePublished": "24 Oct 2018 00:00:00 GMT",
            "about": "For the third Fan Club-commissioned release and the first full-length recording exclusive to the Fan Club catalog, the members of the community were polled on which moniker they'd like a full-length album from. The results were tied between Milieu and Coppice Halifax, and I rolled a D20 live on Twitch to break the tie, with Milieu (although in preparation for both outcomes, a Coppice Halifax release was also partially underway, and those recordings will likely see a release later this Fall).\nGiven the opportunity to fill out a Milieu release just for the Fan Club, I wanted to do something I hadn't done before, so I opted to pull the audio from almost two-dozen different tracks written exclusively with the Korg DS-10 cartridge on my Nintendo 3DS portable gaming system. My DS goes wherever I go, most of the time, and definitely comes with me on longer trips when I have to stay in a hotel room somewhere. As such, I'd been inadvertantly writing this album in hotel beds in Asheville, Dayton, Cleveland, Columbus, Chicago and Indianapolis, as well as possibly other locations between those. Bouncing down the loops and sequences and drum breaks I'd constructed with Korg's digital workstation (which emulates two MS-10 monophonic synthesizers, alongside a drum machine that's also 'grown' from that synth engine), the album began to fully take shape after arrangment and some clever repurposing of the source in my studio DAW. Still, 100% of the audio presented here was generated using only the Korg DS-10 (minus a couple spots of my daughter's speech sampled here and there), showcasing just how flexible and powerful even Korg's emulated synthesis can be.\nLooking back on the places and people and events that these pieces were fashioned alongside brings to mind both happy and sad (and even some unpleasant) memories, so the idea of presenting this material as a digital-audio-travelogue became appealing. Pair this with my romance of empty public spaces, cities after dark and off-grid interstate isolation, and The Cartridge Reader's Travelogue almost wrote itself.\nFor longtime listeners, there are reference points here going as far back as Aurora Borealis/Night Currents, the 8-bit melancholy of the Sophiesongs album (which is due for a reissue) as well as more 'modern' Milieu fare like Quebrith & Yarrow, Polypsilon or Academy Stripes. Hopefully, the album is diverse enough to appeal to everyone in the Fan Club, and possibly others, although it was definitely designed for those of you who continue to support me in extraordinary ways - thank you!",
            "credits": "released October 24, 2018\nW/P by Brian Grainger. Recorded using a Korg DS-10 cartridge in a Nintendo 3DS portable gaming system, in tandem with the White Pillar Workshop DAW. Initial compositions created between 2015-2018 in hotel rooms, rest stops, libraries and vehicles while traveling. Final production and arrangement completed at White Pillar Workshop, Sept-Oct 2018. Mastered by The Analog Botanist. Photography by Brian, Dayton OH Summer 2018. This is Milieu Music number MMFC-004, 4th in the Milieu Music Fan Club exclusive catalog.\nSpecial thanks to all of the members of the Milieu Music Fan Club at Patreon  (www.patreon.com/analogbotany).  With their continued support, more music like this release can happen! At the present moment, the members of the Fan Club are: Alan A, Alex B, Andy B, Alex K, Benoit P, Brian C, Brian H, Burton T, Chris S, Daniel F, David T, Devin H, Gordon C, Francois H, Jim P, Joel B, Jonathan W, Jose S, Levi G, Mathieu L, Matthew F, Peter T, Peter B, Pierre P, Rich A, Rik J, Sean W, Seth B, Tony S, Alex G, Sam P, Peter C, Arthur W, Rob S, Daniel O, Jake P\nMany humble thanks to the subscribers of the Deep Earth series. Without them, this music might not exist, and if it did, you might not be able to hear it. Support deep electronic mining initiatives today:  malfokusita.bandcamp.com",
            "license": "all rights reserved",
            "coverUrl_0": "https://f4.bcbits.com/img/a1251589879_0",
            "trackinfo": [
                {
                    "title": "Soapwater",
                    "duration": "06:57",
                    "lyrics": null,
                    "label": "Milieu Music Digital",
                    "track_id": 2847031378,
                    "track_num": "1",
                    "artist": "Milieu",
                    "url": "https://milieumusicfanclub.bandcamp.com/track/soapwater",
                    "mp3url": "https://t4.bcbits.com/stream/76a52317c07115f82adc33444f58fd8c/mp3-128/2847031378?p=0&ts=1753211372&t=bcf3ec2b6603385075b854c575d189707cc5d0e5&token=1753211372_d395e0cc6da6870e5ed8da5ba4d497a9622cb5f9",
                    "trackCoverUrl_0": "https://f4.bcbits.com/img/a1251589879_0",
                    "art_id": 1251589879,
                    "about": null,
                    "credits": "from The Cartridge Reader's Travelogue, released October 24, 2018",
                    "license": "all rights reserved"
                },
                {
                    "title": "Rainy Windows",
                    "duration": "05:29",
                    "lyrics": null,
                    "label": "Milieu Music Digital",
                    "track_id": 1232031933,
                    "track_num": "7",
                    "artist": "Milieu",
                    "url": "https://milieumusicfanclub.bandcamp.com/track/rainy-windows",
                    "mp3url": "https://t4.bcbits.com/stream/1daba83f6b1b3c8af6632178e39b909b/mp3-128/1232031933?p=0&ts=1753211372&t=b89e19bbe3ad37aec8a31c7eb5b5aa7401b36f69&token=1753211372_3901c3b3153fe4a21be8030d34cf4b20d16486b7",
                    "trackCoverUrl_0": "https://f4.bcbits.com/img/a1251589879_0",
                    "art_id": 1251589879,
                    "about": null,
                    "credits": "from The Cartridge Reader's Travelogue, released October 24, 2018",
                    "license": "all rights reserved"
                }
            ]
        },
        {
            "url": "https://milieumusicfanclub.bandcamp.com/album/a-sky-with-no-moon-blind-in-the-dark-wood",
            "title": "A Sky With No Moon / Blind in the Dark Wood",
            "artist": "Milieu",
            "label": "Milieu Music Digital",
            "classification": "paid",
            "tags": [
                "Electronic",
                "ambience",
                "ambient",
                "braindance",
                "drone",
                "drones",
                "dub techno",
                "idm",
                "lowercase",
                "minimal",
                "minimalism",
                "minimalist",
                "new age",
                "sleep music",
                "techno",
                "Kettering"
            ],
            "item_id": 760255622,
            "art_id": 2943744348,
            "is_preorder": false,
            "datePublished": "17 Sep 2023 21:21:39 GMT",
            "about": "This release is published as a sincere thanks to all members, past/present/future, of the Milieu Music Fan Club, on the occasion of the MMFC's sixth anniversary.\nRecorded in an initial overnight session in late 2022, and subsequently shelved after technical errors in the recording became apparent, I've revisited these recordings throughout the '23 year, either resampling them in my R-EW modular system to generate new forms (as I often do with damaged recordings) or reprocessing them in a few different granular processors within my DAW.\nThe strange thing about these sessions is that each time I went to work, I found something new that I liked about the resultant audio, and this then changed the entire trajectory for the remainder of whatever \"release\" may have manifested from the sessions. This constantly shifting compass orientation in the creative act only reinforced my uncertainty about what to actually do with these pieces, and so it has continued to expand and mutate, until now.\nSometimes, not knowing where to publish something is a positive, because it serves to highlight that work in some unique way, forcing me to really consider what about it is so confounding. Until last month, I hadn't really thought about what I might be interested in releasing for the yearly Fan Club anniversary, and it finally dawned on me that the Fan Club would be the perfect place to issue this sprawling work. If anyone will understand and appreciate it for what it has become, it would be the people who have gone out of their way to support my work in ways beyond simply buying records (though this obviously cannot be overstated as my main source of income), because a number of members in the Fan Club have convinced me that it doesn't really matter what I'm making, so long as I continue to make it.\nSo this digital tome is for you, Constant Listener. Thank you for helping me to continue on this excessively tangential path of creative exploration. I really cannot express my gratitude clearly or completely just writing this letter, so I hope that the music bridges that gap in my communication. That such monumental audio-structures can somewhat incidentally exist is a testament to the support your Fan Club membership has continued to provide me - monuments that would never be built if my hands and mind were not able to meander in the first place.\nN.B. This release, like all releases in the MMFC catalog, is free to all supporters at my Patreon page, regardless of pledge level or involvement. If you were previously a member of the Fan Club, and you'd like a copy of this release, simply write to me in any of the usual channels and I will send you a download code. Thank you.",
            "credits": "released September 17, 2023\nW/P by Brian Grainger. Recorded initially at White Pillar, October 2022, using the R-EW Audioholistics modular system. Subsequent reprocessing and re-recording completed 2022-2023. Mastered by The Analog Botanist. Text by Brian. Photograph taken at White Pillar by Brian, 2022, using a Papershoot camera with no post-processing. Title inspired by a film by Sylvia D'Agostino. This is Milieu Music number MMFC-010. (C) + (P) Oscillog ASCAP 2023. All nights preserved.\nThis release is published as a sincere thanks to all members, past/present/future, of the Milieu Music Fan Club, on the occasion of the MMFC's sixth anniversary.",
            "license": "all rights reserved",
            "coverUrl_0": "https://f4.bcbits.com/img/a2943744348_0",
            "trackinfo": [
                {
                    "title": "Moon (Transposition I)",
                    "duration": "01:00:04",
                    "lyrics": null,
                    "label": "Milieu Music Digital",
                    "track_id": 2373436352,
                    "track_num": "1",
                    "artist": "Milieu",
                    "url": "https://milieumusicfanclub.bandcamp.com/track/moon-transposition-i",
                    "mp3url": "https://t4.bcbits.com/stream/bf685734f40ce8c59377de946254106f/mp3-128/2373436352?p=0&ts=1753211376&t=6a3fd953e40588a8f69decb54b65d7dcab9da6e3&token=1753211376_1e21ab3f145865ac073836532118fe2f62b74144",
                    "trackCoverUrl_0": "https://f4.bcbits.com/img/a2943744348_0",
                    "art_id": 2943744348,
                    "about": null,
                    "credits": "from A Sky With No Moon / Blind in the Dark Wood, released September 17, 2023",
                    "license": "all rights reserved"
                }
            ]
        },
        {
            "url": "https://milieumusicfanclub.bandcamp.com/album/arpland",
            "title": "Arpland",
            "artist": "Quiet Yardwork",
            "label": "Milieu Music Digital",
            "classification": "paid",
            "tags": [
                "Electronic",
                "ambient",
                "ambient techno",
                "braindance",
                "deep house",
                "dub techno",
                "electronica",
                "house",
                "idm",
                "minimal",
                "minimal electronic",
                "minimal techno",
                "techno",
                "Kettering"
            ],
            "item_id": 2008399088,
            "art_id": 1234568976,
            "is_preorder": false,
            "datePublished": "14 Sep 2022 00:00:00 GMT",
            "about": "Arpland was recorded live at Botany Bay in January, 2016, using only a Yamaha QY-70 and a Tascam DR-07 digital recorder. It is one of the few finished albums that was created in that studio space that has remained unreleased, up to now. Originally meant for a cassette tape on an imprint that never got off the ground, focusing only on recordings made with the QY series of machines, and then stashed in the archives.\nAs the fifth anniversary of the Milieu Music Fan Club at Patreon approached, I spent a good amount of time considering what I could release to celebrate - I began work on an acoustic guitar and four-track tape machine album, which quickly became too complex to finish in time for the anniversary...I thought about doing a CH session of dub music, which mutated into River Mural and just didn't feel right for the purpose of publishing here...after getting nowhere, I began to dig through the dreadful archives (I say dreadful because my sense of organization has never been very good, and it follows that my organization in the digital data realm is even worse) looking for something I'd forgotten about, and happened upon Arpland.\nYes! Arpland would be perfect - five years of the Fan Club, five tracks - a bit of synchronicity is always nice, especially when it isn't intentional, because it feels then as if the universe is smiling upon you. So much of my adult life continues to be carrying around one question or another, until something manifests in or near my search that I determine to be an answer. Whether or not there are other forces involved besides my own very flawed human mind looking for patterns where there are none, who can know? (The Shadow knows!) For now, in this time and place, which is where you and I always find ourselves in these one-sided talks, this is enough of an answer to sate my curiosity.\nAnd so I sat down to master these five pieces properly, as they never had been after I laid the jams down live and labeled them. I love how immediately easy on the ear they are, while also possessing a sense of relaxed restraint. The QY-70 is a marvelous and versatile machine, capable of a lot of compositional and sound-design tasks, but it lacks any kind of dedicated performance orientation, and I've long tried to use external devices to provide flesh-and-blood faders/knobs for the QY's internal digital mixing board, to better facilitate the live hands-on jams that I prefer to work through in my takes, rather than programming everything out. Arpland was done live with the QY's cumbersome internal mixer, despite its massive shortcomings, so the changes that occur in these tracks are subtle, gradual, perhaps a bit more deliberate than impulsive, and so this could be the explanation for Arpland's placid mood.\nOf course, texturally it is easy to hear references to many of my favorite ambient techno albums - SAW 85-92, Voltage Control, early Paradinas and Perala, Cylobian Sunset and other gems from the Rephlex catalog - and so Quiet Yardwork feels like a playful, slightly melancholic contribution to the era of bedroom carpeted knob twiddling, and there have always been plans to return to the project, but after Arpland was completed, it just slipped away as other, newer and easier to use machines arrived in my studio. I think the last time I turned on the QY-70 was to play a bassline in the Green Pharming live set? I could be wrong, but...it's nice to see this material get some attention again, and I just might brush the dust off the QY-70 soon because of it. I seem to remember there being the building blocks of most of an entire album sitting in the pattern banks on it, just waiting for a better interface to mix them down with.\nArpland also felt apt to include in the MMFC catalog, as it follows after recordings like The Cartridge Reader's Travelogue - another recording that was created using a singular somewhat unwieldy machine (the Korg DS-10 cartridge for the Nintendo DS portable gaming system) - although it's singular nature allows for some surprising variance, with the title track's pianos sounding far better than they have any right to, given the unit's digital soundfonts being closer to general MIDI than not, or 'Aqualom' sounding a bit like an outtake from the Ocean Lion II sessions.I enjoy these songs for their vibrant simplicity, and I hope they bring you some joy when you listen to them too.\nA huge debt of gratitude is owed to the longtime and current supporters of my work at Patreon, without whom Arpland would remain in stasis for who knows how much longer, as well as so many other things that happen in my creative life and output because of the financial stability and emotional support those people provide. I love you all, and here's to another five years of this weird little get-together on the internet!",
            "credits": "released September 14, 2022\nW/P by Brian Grainger. Recorded live at Botany Bay, Columbia, South Carolina, January 2016, using a Yamaha QY-70 and a Tascam DR-07. Mastered by The Analog Botanist at White Pillar, Summer 2022. Photography by Brian, Botany Bay, August 2016. This is Milieu Music number MMFC-008, 8th in the Milieu Music Fan Club's catalog of exclusive recordings. (C) + (P) Oscillog ASCAP 2022. All lights observed.",
            "license": "all rights reserved",
            "coverUrl_0": "https://f4.bcbits.com/img/a1234568976_0",
            "trackinfo": [
                {
                    "title": "Manic Manx",
                    "duration": "06:03",
                    "lyrics": null,
                    "label": "Milieu Music Digital",
                    "track_id": 3407804886,
                    "track_num": "1",
                    "artist": "Quiet Yardwork",
                    "url": "https://milieumusicfanclub.bandcamp.com/track/manic-manx",
                    "mp3url": "https://t4.bcbits.com/stream/aad858e1f9e97961808a6f52cd699d95/mp3-128/3407804886?p=0&ts=1753211379&t=ba27571048c116a11537aff642f0de85f5ceab7a&token=1753211379_b57e341c2f569618d8b897c939c34e05b9eca4df",
                    "trackCoverUrl_0": "https://f4.bcbits.com/img/a1234568976_0",
                    "art_id": 1234568976,
                    "about": null,
                    "credits": "from Arpland, released September 14, 2022",
                    "license": "all rights reserved"
                }
            ]
        },
        {
            "url": "https://milieumusicfanclub.bandcamp.com/album/country-low",
            "title": "Country Low",
            "artist": "Brian Grainger",
            "label": "Milieu Music Digital",
            "classification": "paid",
            "tags": [
                "Electronic",
                "acoustic",
                "alternative",
                "alternative pop",
                "alternative rock",
                "ambient",
                "braindance",
                "dub techno",
                "idm",
                "indie pop",
                "new wave",
                "psychedelic rock",
                "techno",
                "Kettering"
            ],
            "item_id": 754599848,
            "art_id": 2535384915,
            "is_preorder": false,
            "datePublished": "28 Oct 2017 00:00:00 GMT",
            "about": "Country Low is the first exclusive release to be issued via the Milieu Music Fan Club. Writing and recording work began after a poll was taken at the Fan Club website, wherein members voted on what kind of single should be recorded. The session was extensively filmed and, subsequently, a mini-documentary was released here:  youtu.be/ch1jTVYIlEQ\nAll members of the Fan Club receive this single for free, regardless of when they join. You can support Milieu Music and get cool rewards in return at the Patreon page for the Fan Club:  www.patreon.com/analogbotany",
            "credits": "released October 28, 2017\nW/P by Brian Grainger. Recorded at White Pillar Workshop, September 2017. Mastered by The Analog Botanist. This is Milieu Music number MMFC001. Photograph by Brian, Dayton Summer 2017.",
            "license": "all rights reserved",
            "coverUrl_0": "https://f4.bcbits.com/img/a2535384915_0",
            "trackinfo": [
                {
                    "title": "Country Low",
                    "duration": "04:55",
                    "lyrics": null,
                    "label": "Milieu Music Digital",
                    "track_id": 1882470781,
                    "track_num": "1",
                    "artist": "Brian Grainger",
                    "url": "https://milieumusicfanclub.bandcamp.com/track/country-low",
                    "mp3url": "https://t4.bcbits.com/stream/8264ba827cb68e13ec8e0f36ca5559ff/mp3-128/1882470781?p=0&ts=1753211381&t=6c26909c9c03610587bd21d90877e8ff0bc834a1&token=1753211381_40d9e075a5331c8dc3039975ee2449f0c6adc9eb",
                    "trackCoverUrl_0": "https://f4.bcbits.com/img/a2535384915_0",
                    "art_id": 2535384915,
                    "about": null,
                    "credits": "from Country Low, released October 28, 2017",
                    "license": "all rights reserved"
                }
            ]
        },
        {
            "url": "https://milieumusicfanclub.bandcamp.com/album/an-uncertain-gradient",
            "title": "An Uncertain Gradient",
            "artist": "Milieu",
            "label": "Milieu Music Digital",
            "classification": "paid",
            "tags": [
                "Electronic",
                "ambient",
                "braindance",
                "dub techno",
                "idm",
                "techno",
                "Kettering"
            ],
            "item_id": 2995998940,
            "art_id": 3274594410,
            "is_preorder": false,
            "datePublished": "15 May 2024 00:00:00 GMT",
            "about": "'An Uncertain Gradient' is a milemarker in the Urth - nothing more, nothing less - to mark the passage of time with a pleasant frame drawn around the same moment, twelve months later, following 'Beside a Green Window' on my 40th birthday.\nFrom 40, a so-called milestone year, to 41, a much less glamorous year, much has happened, and yet it also feels that nothing has changed. This strange sensation persists, and I can't quite remember where or when I first noticed it - probably sometime in my teen years - but at 41 it still confounds me, how I can observe the passage of time, observe the very evident changes, and yet still feel weirdly indifferent, apparently numb to the feeling of that change having come and gone.\nOr perhaps this feeling is itself what change does to a human mind, or anything made of the same biomass, susceptible to gravity and barometric pressure and temperature shifts, and this is to say nothing at all of the possible mental changes, the perception that can be utterly skewed, the senses that can deceive and fail, the synapses in the body-machine misfiring as the parts wear down. The physical sensation of entropy, continually rescanned and redefined by a progressively blind radar array.\nAnd yet I do not feel sad about this, or worried about dying, at least in any greater amount than I have my entire life, preemptively grieving about the pain of old age and the loss of my functions. Those things will come, if I am lucky enough to be alive for that long, and given the progressively bleak state of the world since I've arrived upon in in 1983, that act alone will feel like a grand achievement. There's a contentment to be found in these years, for me, where even with all of the turmoil and suffering around me, and the heightened awareness of that negativity thanks to the irascible information superhighway, I can recognize my happiness as being more substantial than it has ever been before. I have my family, my work and all the topical or subliminal validation that I could need with you, Constant Listener, and this is more than enough.\nSo in light of my 41st year, I once again carve a line into this sun-baked tree, where it seems like only a little while ago I was doing the same thing. I hope you enjoy this arrangement of polite sounds and melodious moments, which I've placed into their own little orbits, with their own laws, their own gravitations and repulsions, all accumulating into another warm circling of the sun. Is there ever really a point? Does there even have to be? 'An Uncertain Gradient' is my half-hearted non-answer to these rhetorical questions. It sits beside a window and listens to the birds, and every now and again the music skips a beat, or recurs for a while, and it doesn't matter, because it doesn't need to.\n---\nNOTE: If you are already a member of the Milieu Music Fan Club at Patreon, please do not purchase this album. You will receive instructions via a Patreon blog post that will allow you to add this release to your Bandcamp collection free of charge, where you can stream and download it as many times as you like.",
            "credits": "released May 15, 2024\nW/P by Brian Grainger. Recorded April 12th, 2024, using loops harvested from a January 9th 2024 session with Mutable Instruments' Rings and Repetita Versio in the Locrian scale. Field recording captured with a Zoom H1 following the eclipse totality on April 8th, 2024. Mastered by The Analog Botanist. Text by Brian. Photography by Brian using a Papershoot camera. This is MMFC-011, 11th in the exclusive catalog of recordings made for the Milieu Music Fan Club at Patreon. Special thanks are owed to those in the MMFC, past present and future, for listening to and supporting my work through the many years of tangents that have brought you and I together, here and now. (C) + (P) Oscillog ASCAP 2024. All nights preserved.",
            "license": "all rights reserved",
            "coverUrl_0": "https://f4.bcbits.com/img/a3274594410_0",
            "trackinfo": [
                {
                    "title": "The Unexpected Contentment in a Fixed Perspective as You Move Through an Uncertain Gradient",
                    "duration": "52:55",
                    "lyrics": null,
                    "label": "Milieu Music Digital",
                    "track_id": 2677235059,
                    "track_num": "1",
                    "artist": "Milieu",
                    "url": "https://milieumusicfanclub.bandcamp.com/track/the-unexpected-contentment-in-a-fixed-perspective-as-you-move-through-an-uncertain-gradient",
                    "mp3url": "https://t4.bcbits.com/stream/ca65139d17a1422c156c382fe347bcdb/mp3-128/2677235059?p=0&ts=1753211384&t=8ef74919ea5ce27a184a97741ace6e851cf8453c&token=1753211384_2981c52efd25ab025a68ba04631d4ed5bec611ef",
                    "trackCoverUrl_0": "https://f4.bcbits.com/img/a3274594410_0",
                    "art_id": 3274594410,
                    "about": null,
                    "credits": "from An Uncertain Gradient, released May 15, 2024",
                    "license": "all rights reserved"
                }
            ]
        },
        {
            "url": "https://milieumusicfanclub.bandcamp.com/album/high-in-the-middle",
            "title": "High In The Middle",
            "artist": "Milieu",
            "label": "Milieu Music Digital",
            "classification": "paid",
            "tags": [
                "Electronic",
                "acid",
                "acid house",
                "ambient",
                "ambient techno",
                "braindance",
                "dance",
                "deep house",
                "dub techno",
                "glitch",
                "house",
                "idm",
                "intelligent dance music",
                "techno",
                "Kettering"
            ],
            "item_id": 3199157714,
            "art_id": 1804696758,
            "is_preorder": false,
            "datePublished": "10 Sep 2021 00:00:00 GMT",
            "about": "Unbelievably, it has now been FOUR YEARS since the Milieu Music Fan Club began operation, and thanks to so many amazingly kind and generous people joining the groop, I've been much more able to keep my head above water financially, as well as reaching certain creative goals that may have taken longer otherwise, or simply never come to pass at all. I am perpetually thankful, literally thinking of how lucky I am to be here doing this, on a daily basis, but nothing quite expresses my own gratitude better than more of the MUSIC that brought everyone here in the first place.\nSo, with as little fanfare as possible (hooray! oh wait...sssh) I'm happy to offer a very informal and fun Milieu adventure up to your ears. HIGH IN THE MIDDLE is a set of trax that are either entirely new jams that were created without any final release in mind, or were outtakes from other album sessions throughout 2020-2021. Despite this, the release functions well as a cohesive listen I think, and also picks up nicely where THE CARTRIDGE READER'S TRAVELOGUE left off. (Truth be told, some of the sounds loaded into the samplers on these tracks were the same ones built with the Korg DS-10 that TRAVELOGUE was generated from). There are also moments that recall recent work such as THALLINE DRESS, BLURRY THURSDAY and STELLAR DEBRIS, and the title evokes a multifaceted array of meanings - my first five years as a Daytonian celebrated next month, and the omnipresent self-deprecation that runs like a thread through all of my work, waving and smiling while asking you to keep your expectations low and flimsy, that this may be as good as it ever gets, and it could all simply be downhill from here. Of course, I always manage to come back and do it again, somehow, and releases such as this seem to further reinforce the fact that peaks and valleys are not so much inconsistencies in the creative act, but rather, the actual sinewave-shaped arc of creative work itself.\nHopefully these cuts tickle your eardrums and bring a few smiles, and convey even a fraction of the happiness I feel when I think about my awesome Milieu Music Fan Club. Thanks to every one of you! Here's to another four years of the MMFC! HUGS!",
            "credits": "released September 10, 2021\nW/P by Brian Grainger. Recorded at White Pillar Workshop, 2020-2021. Mastered by The Analog Botanist. Text, design and photography by ABM&D. This is Milieu Music number MMFC-007.",
            "license": "all rights reserved",
            "coverUrl_0": "https://f4.bcbits.com/img/a1804696758_0",
            "trackinfo": [
                {
                    "title": "High In The Middle",
                    "duration": "07:22",
                    "lyrics": null,
                    "label": "Milieu Music Digital",
                    "track_id": 1851583762,
                    "track_num": "1",
                    "artist": "Milieu",
                    "url": "https://milieumusicfanclub.bandcamp.com/track/high-in-the-middle",
                    "mp3url": "https://t4.bcbits.com/stream/8ac469dc9fa25ef461dd94d25d848b3e/mp3-128/1851583762?p=0&ts=1753211387&t=473a4a8b603d4aa2ecd1057dd605359b5ff0b523&token=1753211387_43135b99d108e2274888970549bad5aa81f6b3ed",
                    "trackCoverUrl_0": "https://f4.bcbits.com/img/a1804696758_0",
                    "art_id": 1804696758,
                    "about": null,
                    "credits": "from High In The Middle, released September 10, 2021",
                    "license": "all rights reserved"
                },
                {
                    "title": "Endora 2",
                    "duration": "06:04",
                    "lyrics": null,
                    "label": "Milieu Music Digital",
                    "track_id": 871608356,
                    "track_num": "2",
                    "artist": "Milieu",
                    "url": "https://milieumusicfanclub.bandcamp.com/track/endora-2",
                    "mp3url": "https://t4.bcbits.com/stream/b255025b92aa52e54fdf49a9bc1f55bf/mp3-128/871608356?p=0&ts=1753211387&t=3dae3397227dbb4cb42cc798961e1d9e42bd137c&token=1753211387_c5bf416129dfa28cc81d63b7328738c2c8354852",
                    "trackCoverUrl_0": "https://f4.bcbits.com/img/a1804696758_0",
                    "art_id": 1804696758,
                    "about": null,
                    "credits": "from High In The Middle, released September 10, 2021",
                    "license": "all rights reserved"
                },
                {
                    "title": "Into",
                    "duration": "10:46",
                    "lyrics": null,
                    "label": "Milieu Music Digital",
                    "track_id": 283367020,
                    "track_num": "9",
                    "artist": "Milieu",
                    "url": "https://milieumusicfanclub.bandcamp.com/track/into",
                    "mp3url": "https://t4.bcbits.com/stream/d462f8faf9700a135bbf591ea8a7e3d5/mp3-128/283367020?p=0&ts=1753211387&t=59b523f57a29f0125b8b1d746d0a7ab2a5c90ca5&token=1753211387_6c444a8e90eb0a344e5f82407dbbdfb82e636240",
                    "trackCoverUrl_0": "https://f4.bcbits.com/img/a1804696758_0",
                    "art_id": 1804696758,
                    "about": null,
                    "credits": "from High In The Middle, released September 10, 2021",
                    "license": "all rights reserved"
                }
            ]
        },
        {
            "url": "https://milieumusicfanclub.bandcamp.com/album/names-sung-hewn-in-grey",
            "title": "Names Sung, Hewn in Grey",
            "artist": "Milieu",
            "label": "Milieu Music Digital",
            "classification": "paid",
            "tags": [
                "Electronic",
                "ambience",
                "ambient",
                "braindance",
                "drone",
                "drones",
                "dub techno",
                "idm",
                "minimal",
                "minimalism",
                "minimalist",
                "new age",
                "relaxation",
                "sleep music",
                "techno",
                "Kettering"
            ],
            "item_id": 2788333699,
            "art_id": 2538071560,
            "is_preorder": false,
            "datePublished": "04 Oct 2024 00:00:00 GMT",
            "about": "In the sun white sun\nA resonant chime laid bare\nCarried on a line\nTraced in a spiral\nDroning, mindless, mirroring\nGolden symmetries\nWe played and we slept\nThe stars so bright, and yet still\nTheir chimes never far\n---\n\"Names Sung, Hewn in Grey\" is an album of modular ambient music, plucked from the archives, recorded in 2021 and shelved after a scheduled cassette release de-materialized, hanging in limbo until now.\nMusically, it is an early example of my explorations with a modestly-sized modular system, seeking out timbres similar to those on my ambient guitar recordings at Second Sun and Attacknine. It is now made part of the MMFC catalog to celebrate the 7th anniversary of the Milieu Music Fan Club, and given as a gift to all paid members of that club at Patreon.\nThank you, to every one of you, for your continued support of my work. Having you be any part, large or small, of helping to keep my distracted head above water goes so much further for me than you probably think.\nNOTE: If you would like to obtain this album, please consider becoming a paid member of my Patreon page. All supporters of $5 or more per month receive this and all eleven prior MMFC catalog releases the moment they sign up.  patreon.com/analogbotany",
            "credits": "released October 4, 2024\nW/P by Brian Grainger. Recorded at White Pillar, 2021, using the R-EW Audioholistics modular system. Mastered by The Analog Botanist. Poem and photograph by Brian. This is Milieu Music number MMFC-012. (C) + (P) Oscillog ASCAP 2024. All nights preserved.",
            "license": "all rights reserved",
            "coverUrl_0": "https://f4.bcbits.com/img/a2538071560_0",
            "trackinfo": [
                {
                    "title": "Names Sung",
                    "duration": "03:07",
                    "lyrics": null,
                    "label": "Milieu Music Digital",
                    "track_id": 966419962,
                    "track_num": "1",
                    "artist": "Milieu",
                    "url": "https://milieumusicfanclub.bandcamp.com/track/names-sung",
                    "mp3url": "https://t4.bcbits.com/stream/0db942c29251a38896cd8337b0097b1c/mp3-128/966419962?p=0&ts=1753211391&t=0d3191ad98650c5340cf72d8431c9804886b3217&token=1753211391_87ac2114051f16ebc473f14800aaaf45539e8196",
                    "trackCoverUrl_0": "https://f4.bcbits.com/img/a2538071560_0",
                    "art_id": 2538071560,
                    "about": null,
                    "credits": "from Names Sung, Hewn in Grey, released October 4, 2024",
                    "license": "all rights reserved"
                },
                {
                    "title": "Hewn in Grey",
                    "duration": "04:54",
                    "lyrics": null,
                    "label": "Milieu Music Digital",
                    "track_id": 1533357888,
                    "track_num": "6",
                    "artist": "Milieu",
                    "url": "https://milieumusicfanclub.bandcamp.com/track/hewn-in-grey",
                    "mp3url": "https://t4.bcbits.com/stream/f1262d3ef89070451cd0c27d1f54fc8b/mp3-128/1533357888?p=0&ts=1753211391&t=a5eeda9d4b0373f016d91a0e49a46b3d00586533&token=1753211391_c11a6769d8cabe7a6e7fec1a169dec42cd471650",
                    "trackCoverUrl_0": "https://f4.bcbits.com/img/a2538071560_0",
                    "art_id": 2538071560,
                    "about": null,
                    "credits": "from Names Sung, Hewn in Grey, released October 4, 2024",
                    "license": "all rights reserved"
                }
            ]
        },
        {
            "url": "https://milieumusicfanclub.bandcamp.com/album/eos-chasma",
            "title": "Eos Chasma",
            "artist": "Milieu",
            "label": "Milieu Music Digital",
            "classification": "paid",
            "tags": [
                "Electronic",
                "ambience",
                "ambient",
                "braindance",
                "drone",
                "drones",
                "dub techno",
                "generative",
                "idm",
                "minimal",
                "minimalism",
                "minimalist",
                "new age",
                "sleep music",
                "techno",
                "Kettering"
            ],
            "item_id": 3036287349,
            "art_id": 878513575,
            "is_preorder": false,
            "datePublished": "02 Jul 2023 00:00:00 GMT",
            "about": "'Eos Chasma' is a session of generative ambient music, assembled through three different sessions of processing work between February and June 2023. The provenance of the sound itself originates from a Doepfer A-121-3 bandpass filter in self oscillation, and several different granular processors, fast Fourier transforms and parametric equalization passes were used in order to arrive at this end point.\nInitially published via Patreon's digital sales platform as a feasibility study, and now properly issued here for the sake of convenience. Many thanks to the members of the MMFC at Patreon who dutifully tested the release's original configuration and provided feedback - you are appreciated!\nThis release is FREE to all Patreon supporters, so please do not buy it here if you are a member of the Fan Club. Check the blog posts for your personal download code (if you're currently a member) and if you've just signed up, look for your Welcome Mat email for a code inside.",
            "credits": "released July 2, 2023\nW/P by Brian Grainger. Recorded at White Pillar, February-June 2023 using the Doepfer A-121-3 bandpass filter in conjunction with multiple digital processing systems. Mastered by The Analog Botanist. Text by Brian. Design by ABM&D. This is Milieu Music number MMFC-009. (C) + (P) Oscillog ASCAP 2023. All nights preserved.",
            "license": "all rights reserved",
            "coverUrl_0": "https://f4.bcbits.com/img/a0878513575_0",
            "trackinfo": [
                {
                    "title": "Eos Chasma",
                    "duration": "01:01:15",
                    "lyrics": null,
                    "label": "Milieu Music Digital",
                    "track_id": 3526207575,
                    "track_num": "1",
                    "artist": "Milieu",
                    "url": "https://milieumusicfanclub.bandcamp.com/track/eos-chasma",
                    "mp3url": "https://t4.bcbits.com/stream/5f9b2fa9115e12d4d56706554461ec59/mp3-128/3526207575?p=0&ts=1753211395&t=4f32f8df146774d6772d965898e9d7bf8e19d2b1&token=1753211395_e952edf9e408a86b740f52de8d094fcc69269bac",
                    "trackCoverUrl_0": "https://f4.bcbits.com/img/a0878513575_0",
                    "art_id": 878513575,
                    "about": null,
                    "credits": "from Eos Chasma, released July 2, 2023",
                    "license": "all rights reserved"
                }
            ]
        },
        {
            "url": "https://milieumusicfanclub.bandcamp.com/album/anniversary-dubs",
            "title": "Anniversary Dubs",
            "artist": "Coppice Halifax",
            "label": "Milieu Music Digital",
            "classification": "paid",
            "tags": [
                "Electronic",
                "ambient",
                "ambient techno",
                "analog",
                "braindance",
                "deep house",
                "dub",
                "dub tech",
                "dub techno",
                "electro",
                "electronica",
                "house",
                "idm",
                "minimal techno",
                "techno",
                "Kettering"
            ],
            "item_id": 3103457962,
            "art_id": 4085203362,
            "is_preorder": false,
            "datePublished": "09 Sep 2019 15:12:12 GMT",
            "about": "In celebration of the second anniversary of the Milieu Music Fan Club, I've assembled this four-track EP of Analog Botany to add to the MMFC catalog of exclusives. All four tracks were created live and taken from four very different sessions, and built with very different hardware and equipment, and until now they have been strays kicking around hard drives and badly labeled cassettes.\nStylo Dub, leading the set, was recorded during the lengthy Sun Cast sessions, using a Korg ES-1 sampler, a Boss DR-880 and of course a Stylophone. It is the oldest of the four, and originated at the Botany Bay studio in South Carolina. MS-20 Dub was recorded at White Pillar, as one of the very first tracks made using the Korg MS-20 monophonic analog synthesizer, in tandem with a Korg Volca Beats drum machine. RY-20 Dub, like Stylo Dub, came from Botany Bay as well, sometime during the first year of Deep Earth, and is built primarily out of a Yamaha RY-20 drum machine modulating/modulated by custom resonator patches on an Alesis Quadraverb and three Moog FX units. DS-10 Dub is another White Pillar cut, being jammed on during the sessions for MMFC-004 / The Cartridge Reader's Travelogue, and built using only the Korg DS-10 cartridge for the Nintendo DS portable gaming system. It was likely designed in a Chicago hotel, in March 2018.\nWith this release, I raise a glass to all the members of the Milieu Music Fan Club, past present and future - here's to many more years! Thanks to all of you for being a part of it.",
            "credits": "released September 9, 2019\nW/P by Brian Grainger. Recorded various dates at Botany Bay & White Pillar, 2015-2018. Mastered by The Analog Botanist. Text, photography & design by ABM&D. This is Milieu Music number MMFC005, 5th in the Milieu Music Fan Club catalog. (C) + (P) Milieu Music 2019. All nights preserved.\nSpecial thanks to all of the members of the Milieu Music Fan Club at Patreon  (www.patreon.com/analogbotany).  With their continued support, more music like this release can happen! At the present moment, the members of the Fan Club are: Burt T / Brian S / Jake P / Christ S / Damian H / Levi G / Brian C / Arthur W / Joel B / Peter H-B / Rik J / Jose S / David P / Helge J / Peter C / Alan A / Alex G / Seth B / David T / Devin H / Mathieu L / Andy B / Francois H / Benoit P / J.C. Bastos\nMany humble thanks to the subscribers of the Deep Earth series. Without them, this music might not exist, and if it did, you might not be able to hear it. Support deep electronic mining initiatives today:  malfokusita.bandcamp.com",
            "license": "all rights reserved",
            "coverUrl_0": "https://f4.bcbits.com/img/a4085203362_0",
            "trackinfo": [
                {
                    "title": "Stylo Dub",
                    "duration": "06:40",
                    "lyrics": null,
                    "label": "Milieu Music Digital",
                    "track_id": 166522700,
                    "track_num": "1",
                    "artist": "Coppice Halifax",
                    "url": "https://milieumusicfanclub.bandcamp.com/track/stylo-dub",
                    "mp3url": "https://t4.bcbits.com/stream/597d93267baa56eda2bc46ac17c7e6d0/mp3-128/166522700?p=0&ts=1753211398&t=c127f7ab2c19f09a353f32330204108f21b71e03&token=1753211398_5bb49ebc0c722992902d87d27183910688d8f353",
                    "trackCoverUrl_0": "https://f4.bcbits.com/img/a4085203362_0",
                    "art_id": 4085203362,
                    "about": null,
                    "credits": "from Anniversary Dubs, released September 9, 2019",
                    "license": "all rights reserved"
                }
            ]
        }
    ]
}